XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x10 : dac_0 */
#define AUDIO_DAC_0_OFFSET             (0x10)
#define AUDIO_ADC_PDM_H                AUDIO_ADC_PDM_H
#define AUDIO_ADC_PDM_H_POS            (0U)
#define AUDIO_ADC_PDM_H_LEN            (6U)
#define AUDIO_ADC_PDM_H_MSK            (((1U << AUDIO_ADC_PDM_H_LEN) - 1) << AUDIO_ADC_PDM_H_POS)
#define AUDIO_ADC_PDM_H_UMSK           (~(((1U << AUDIO_ADC_PDM_H_LEN) - 1) << AUDIO_ADC_PDM_H_POS))
#define AUDIO_ADC_PDM_L                AUDIO_ADC_PDM_L
#define AUDIO_ADC_PDM_L_POS            (6U)
#define AUDIO_ADC_PDM_L_LEN            (6U)
#define AUDIO_ADC_PDM_L_MSK            (((1U << AUDIO_ADC_PDM_L_LEN) - 1) << AUDIO_ADC_PDM_L_POS)
#define AUDIO_ADC_PDM_L_UMSK           (~(((1U << AUDIO_ADC_PDM_L_LEN) - 1) << AUDIO_ADC_PDM_L_POS))
#define AUDIO_ADC_0_SRC                AUDIO_ADC_0_SRC
#define AUDIO_ADC_0_SRC_POS            (12U)
#define AUDIO_ADC_0_SRC_LEN            (1U)
#define AUDIO_ADC_0_SRC_MSK            (((1U << AUDIO_ADC_0_SRC_LEN) - 1) << AUDIO_ADC_0_SRC_POS)
#define AUDIO_ADC_0_SRC_UMSK           (~(((1U << AUDIO_ADC_0_SRC_LEN) - 1) << AUDIO_ADC_0_SRC_POS))
#define AUDIO_ADC_0_PDM_LVL_SWAP       AUDIO_ADC_0_PDM_LVL_SWAP
#define AUDIO_ADC_0_PDM_LVL_SWAP_POS   (13U)
#define AUDIO_ADC_0_PDM_LVL_SWAP_LEN   (1U)
#define AUDIO_ADC_0_PDM_LVL_SWAP_MSK   (((1U << AUDIO_ADC_0_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_0_PDM_LVL_SWAP_POS)
#define AUDIO_ADC_0_PDM_LVL_SWAP_UMSK  (~(((1U << AUDIO_ADC_0_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_0_PDM_LVL_SWAP_POS))
#define AUDIO_ADC_0_MASH_BIT_SWAP      AUDIO_ADC_0_MASH_BIT_SWAP
#define AUDIO_ADC_0_MASH_BIT_SWAP_POS  (14U)
#define AUDIO_ADC_0_MASH_BIT_SWAP_LEN  (1U)
#define AUDIO_ADC_0_MASH_BIT_SWAP_MSK  (((1U << AUDIO_ADC_0_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_0_MASH_BIT_SWAP_POS)
#define AUDIO_ADC_0_MASH_BIT_SWAP_UMSK (~(((1U << AUDIO_ADC_0_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_0_MASH_BIT_SWAP_POS))
#define AUDIO_ADC_1_SRC                AUDIO_ADC_1_SRC
#define AUDIO_ADC_1_SRC_POS            (15U)
#define AUDIO_ADC_1_SRC_LEN            (1U)
#define AUDIO_ADC_1_SRC_MSK            (((1U << AUDIO_ADC_1_SRC_LEN) - 1) << AUDIO_ADC_1_SRC_POS)
#define AUDIO_ADC_1_SRC_UMSK           (~(((1U << AUDIO_ADC_1_SRC_LEN) - 1) << AUDIO_ADC_1_SRC_POS))
#define AUDIO_ADC_1_PDM_LVL_SWAP       AUDIO_ADC_1_PDM_LVL_SWAP
#define AUDIO_ADC_1_PDM_LVL_SWAP_POS   (16U)
#define AUDIO_ADC_1_PDM_LVL_SWAP_LEN   (1U)
#define AUDIO_ADC_1_PDM_LVL_SWAP_MSK   (((1U << AUDIO_ADC_1_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_1_PDM_LVL_SWAP_POS)
#define AUDIO_ADC_1_PDM_LVL_SWAP_UMSK  (~(((1U << AUDIO_ADC_1_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_1_PDM_LVL_SWAP_POS))
#define AUDIO_ADC_1_MASH_BIT_SWAP      AUDIO_ADC_1_MASH_BIT_SWAP
#define AUDIO_ADC_1_MASH_BIT_SWAP_POS  (17U)
#define AUDIO_ADC_1_MASH_BIT_SWAP_LEN  (1U)
#define AUDIO_ADC_1_MASH_BIT_SWAP_MSK  (((1U << AUDIO_ADC_1_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_1_MASH_BIT_SWAP_POS)
#define AUDIO_ADC_1_MASH_BIT_SWAP_UMSK (~(((1U << AUDIO_ADC_1_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_1_MASH_BIT_SWAP_POS))
#define AUDIO_ADC_2_SRC                AUDIO_ADC_2_SRC
#define AUDIO_ADC_2_SRC_POS            (18U)
#define AUDIO_ADC_2_SRC_LEN            (1U)
#define AUDIO_ADC_2_SRC_MSK            (((1U << AUDIO_ADC_2_SRC_LEN) - 1) << AUDIO_ADC_2_SRC_POS)
#define AUDIO_ADC_2_SRC_UMSK           (~(((1U << AUDIO_ADC_2_SRC_LEN) - 1) << AUDIO_ADC_2_SRC_POS))
#define AUDIO_ADC_2_PDM_LVL_SWAP       AUDIO_ADC_2_PDM_LVL_SWAP
#define AUDIO_ADC_2_PDM_LVL_SWAP_POS   (19U)
#define AUDIO_ADC_2_PDM_LVL_SWAP_LEN   (1U)
#define AUDIO_ADC_2_PDM_LVL_SWAP_MSK   (((1U << AUDIO_ADC_2_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_2_PDM_LVL_SWAP_POS)
#define AUDIO_ADC_2_PDM_LVL_SWAP_UMSK  (~(((1U << AUDIO_ADC_2_PDM_LVL_SWAP_LEN) - 1) << AUDIO_ADC_2_PDM_LVL_SWAP_POS))
#define AUDIO_ADC_2_MASH_BIT_SWAP      AUDIO_ADC_2_MASH_BIT_SWAP
#define AUDIO_ADC_2_MASH_BIT_SWAP_POS  (20U)
#define AUDIO_ADC_2_MASH_BIT_SWAP_LEN  (1U)
#define AUDIO_ADC_2_MASH_BIT_SWAP_MSK  (((1U << AUDIO_ADC_2_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_2_MASH_BIT_SWAP_POS)
#define AUDIO_ADC_2_MASH_BIT_SWAP_UMSK (~(((1U << AUDIO_ADC_2_MASH_BIT_SWAP_LEN) - 1) << AUDIO_ADC_2_MASH_BIT_SWAP_POS))
#define AUDIO_MIX_0_SEL                AUDIO_MIX_0_SEL
#define AUDIO_MIX_0_SEL_POS            (21U)
#define AUDIO_MIX_0_SEL_LEN            (2U)
#define AUDIO_MIX_0_SEL_MSK            (((1U << AUDIO_MIX_0_SEL_LEN) - 1) << AUDIO_MIX_0_SEL_POS)
#define AUDIO_MIX_0_SEL_UMSK           (~(((1U << AUDIO_MIX_0_SEL_LEN) - 1) << AUDIO_MIX_0_SEL_POS))
#define AUDIO_MIX_0_MODE               AUDIO_MIX_0_MODE
#define AUDIO_MIX_0_MODE_POS           (23U)
#define AUDIO_MIX_0_MODE_LEN           (2U)
#define AUDIO_MIX_0_MODE_MSK           (((1U << AUDIO_MIX_0_MODE_LEN) - 1) << AUDIO_MIX_0_MODE_POS)
#define AUDIO_MIX_0_MODE_UMSK          (~(((1U << AUDIO_MIX_0_MODE_LEN) - 1) << AUDIO_MIX_0_MODE_POS))
#define AUDIO_MIX_0_ATT_MODE1          AUDIO_MIX_0_ATT_MODE1
#define AUDIO_MIX_0_ATT_MODE1_POS      (25U)
#define AUDIO_MIX_0_ATT_MODE1_LEN      (3U)
#define AUDIO_MIX_0_ATT_MODE1_MSK      (((1U << AUDIO_MIX_0_ATT_MODE1_LEN) - 1) << AUDIO_MIX_0_ATT_MODE1_POS)
#define AUDIO_MIX_0_ATT_MODE1_UMSK     (~(((1U << AUDIO_MIX_0_ATT_MODE1_LEN) - 1) << AUDIO_MIX_0_ATT_MODE1_POS))
#define AUDIO_MIX_0_ATT_MODE2          AUDIO_MIX_0_ATT_MODE2
#define AUDIO_MIX_0_ATT_MODE2_POS      (28U)
#define AUDIO_MIX_0_ATT_MODE2_LEN      (3U)
#define AUDIO_MIX_0_ATT_MODE2_MSK      (((1U << AUDIO_MIX_0_ATT_MODE2_LEN) - 1) << AUDIO_MIX_0_ATT_MODE2_POS)
#define AUDIO_MIX_0_ATT_MODE2_UMSK     (~(((1U << AUDIO_MIX_0_ATT_MODE2_LEN) - 1) << AUDIO_MIX_0_ATT_MODE2_POS))

/* 0x14 : dac_1 */
#define AUDIO_DAC_1_OFFSET                  (0x14)
#define AUDIO_DAC_DEM_BYPASS                AUDIO_DAC_DEM_BYPASS
#define AUDIO_DAC_DEM_BYPASS_POS            (0U)
#define AUDIO_DAC_DEM_BYPASS_LEN            (1U)
#define AUDIO_DAC_DEM_BYPASS_MSK            (((1U << AUDIO_DAC_DEM_BYPASS_LEN) - 1) << AUDIO_DAC_DEM_BYPASS_POS)
#define AUDIO_DAC_DEM_BYPASS_UMSK           (~(((1U << AUDIO_DAC_DEM_BYPASS_LEN) - 1) << AUDIO_DAC_DEM_BYPASS_POS))
#define AUDIO_DAC_DEM_OUT_SWAP              AUDIO_DAC_DEM_OUT_SWAP
#define AUDIO_DAC_DEM_OUT_SWAP_POS          (1U)
#define AUDIO_DAC_DEM_OUT_SWAP_LEN          (1U)
#define AUDIO_DAC_DEM_OUT_SWAP_MSK          (((1U << AUDIO_DAC_DEM_OUT_SWAP_LEN) - 1) << AUDIO_DAC_DEM_OUT_SWAP_POS)
#define AUDIO_DAC_DEM_OUT_SWAP_UMSK         (~(((1U << AUDIO_DAC_DEM_OUT_SWAP_LEN) - 1) << AUDIO_DAC_DEM_OUT_SWAP_POS))
#define AUDIO_DAC_DSM_ORDER                 AUDIO_DAC_DSM_ORDER
#define AUDIO_DAC_DSM_ORDER_POS             (5U)
#define AUDIO_DAC_DSM_ORDER_LEN             (1U)
#define AUDIO_DAC_DSM_ORDER_MSK             (((1U << AUDIO_DAC_DSM_ORDER_LEN) - 1) << AUDIO_DAC_DSM_ORDER_POS)
#define AUDIO_DAC_DSM_ORDER_UMSK            (~(((1U << AUDIO_DAC_DSM_ORDER_LEN) - 1) << AUDIO_DAC_DSM_ORDER_POS))
#define AUDIO_DAC_DSM_SCALING_FACTOR        AUDIO_DAC_DSM_SCALING_FACTOR
#define AUDIO_DAC_DSM_SCALING_FACTOR_POS    (6U)
#define AUDIO_DAC_DSM_SCALING_FACTOR_LEN    (4U)
#define AUDIO_DAC_DSM_SCALING_FACTOR_MSK    (((1U << AUDIO_DAC_DSM_SCALING_FACTOR_LEN) - 1) << AUDIO_DAC_DSM_SCALING_FACTOR_POS)
#define AUDIO_DAC_DSM_SCALING_FACTOR_UMSK   (~(((1U << AUDIO_DAC_DSM_SCALING_FACTOR_LEN) - 1) << AUDIO_DAC_DSM_SCALING_FACTOR_POS))
#define AUDIO_DAC_DSM_SCALING_EN            AUDIO_DAC_DSM_SCALING_EN
#define AUDIO_DAC_DSM_SCALING_EN_POS        (10U)
#define AUDIO_DAC_DSM_SCALING_EN_LEN        (1U)
#define AUDIO_DAC_DSM_SCALING_EN_MSK        (((1U << AUDIO_DAC_DSM_SCALING_EN_LEN) - 1) << AUDIO_DAC_DSM_SCALING_EN_POS)
#define AUDIO_DAC_DSM_SCALING_EN_UMSK       (~(((1U << AUDIO_DAC_DSM_SCALING_EN_LEN) - 1) << AUDIO_DAC_DSM_SCALING_EN_POS))
#define AUDIO_DAC_DSM_DITHER_AMP            AUDIO_DAC_DSM_DITHER_AMP
#define AUDIO_DAC_DSM_DITHER_AMP_POS        (11U)
#define AUDIO_DAC_DSM_DITHER_AMP_LEN        (3U)
#define AUDIO_DAC_DSM_DITHER_AMP_MSK        (((1U << AUDIO_DAC_DSM_DITHER_AMP_LEN) - 1) << AUDIO_DAC_DSM_DITHER_AMP_POS)
#define AUDIO_DAC_DSM_DITHER_AMP_UMSK       (~(((1U << AUDIO_DAC_DSM_DITHER_AMP_LEN) - 1) << AUDIO_DAC_DSM_DITHER_AMP_POS))
#define AUDIO_DAC_DSM_DITHER_EN             AUDIO_DAC_DSM_DITHER_EN
#define AUDIO_DAC_DSM_DITHER_EN_POS         (14U)
#define AUDIO_DAC_DSM_DITHER_EN_LEN         (1U)
#define AUDIO_DAC_DSM_DITHER_EN_MSK         (((1U << AUDIO_DAC_DSM_DITHER_EN_LEN) - 1) << AUDIO_DAC_DSM_DITHER_EN_POS)
#define AUDIO_DAC_DSM_DITHER_EN_UMSK        (~(((1U << AUDIO_DAC_DSM_DITHER_EN_LEN) - 1) << AUDIO_DAC_DSM_DITHER_EN_POS))
#define AUDIO_DAC_DSM_DITHER_PRBS_MODE      AUDIO_DAC_DSM_DITHER_PRBS_MODE
#define AUDIO_DAC_DSM_DITHER_PRBS_MODE_POS  (15U)
#define AUDIO_DAC_DSM_DITHER_PRBS_MODE_LEN  (2U)
#define AUDIO_DAC_DSM_DITHER_PRBS_MODE_MSK  (((1U << AUDIO_DAC_DSM_DITHER_PRBS_MODE_LEN) - 1) << AUDIO_DAC_DSM_DITHER_PRBS_MODE_POS)
#define AUDIO_DAC_DSM_DITHER_PRBS_MODE_UMSK (~(((1U << AUDIO_DAC_DSM_DITHER_PRBS_MODE_LEN) - 1) << AUDIO_DAC_DSM_DITHER_PRBS_MODE_POS))
#define AUDIO_MIX_1_SEL                     AUDIO_MIX_1_SEL
#define AUDIO_MIX_1_SEL_POS                 (21U)
#define AUDIO_MIX_1_SEL_LEN                 (2U)
#define AUDIO_MIX_1_SEL_MSK                 (((1U << AUDIO_MIX_1_SEL_LEN) - 1) << AUDIO_MIX_1_SEL_POS)
#define AUDIO_MIX_1_SEL_UMSK                (~(((1U << AUDIO_MIX_1_SEL_LEN) - 1) << AUDIO_MIX_1_SEL_POS))
#define AUDIO_MIX_1_MODE                    AUDIO_MIX_1_MODE
#define AUDIO_MIX_1_MODE_POS                (23U)
#define AUDIO_MIX_1_MODE_LEN                (2U)
#define AUDIO_MIX_1_MODE_MSK                (((1U << AUDIO_MIX_1_MODE_LEN) - 1) << AUDIO_MIX_1_MODE_POS)
#define AUDIO_MIX_1_MODE_UMSK               (~(((1U << AUDIO_MIX_1_MODE_LEN) - 1) << AUDIO_MIX_1_MODE_POS))
#define AUDIO_MIX_1_ATT_MODE1               AUDIO_MIX_1_ATT_MODE1
#define AUDIO_MIX_1_ATT_MODE1_POS           (25U)
#define AUDIO_MIX_1_ATT_MODE1_LEN           (3U)
#define AUDIO_MIX_1_ATT_MODE1_MSK           (((1U << AUDIO_MIX_1_ATT_MODE1_LEN) - 1) << AUDIO_MIX_1_ATT_MODE1_POS)
#define AUDIO_MIX_1_ATT_MODE1_UMSK          (~(((1U << AUDIO_MIX_1_ATT_MODE1_LEN) - 1) << AUDIO_MIX_1_ATT_MODE1_POS))
#define AUDIO_MIX_1_ATT_MODE2               AUDIO_MIX_1_ATT_MODE2
#define AUDIO_MIX_1_ATT_MODE2_POS           (28U)
#define AUDIO_MIX_1_ATT_MODE2_LEN           (3U)
#define AUDIO_MIX_1_ATT_MODE2_MSK           (((1U << AUDIO_MIX_1_ATT_MODE2_LEN) - 1) << AUDIO_MIX_1_ATT_MODE2_POS)
#define AUDIO_MIX_1_ATT_MODE2_UMSK          (~(((1U << AUDIO_MIX_1_ATT_MODE2_LEN) - 1) << AUDIO_MIX_1_ATT_MODE2_POS))

/* 0x18 : aec_0 */
#define AUDIO_AEC_0_OFFSET               (0x18)
#define AUDIO_AEC_0_ATTEN_MODE           AUDIO_AEC_0_ATTEN_MODE
#define AUDIO_AEC_0_ATTEN_MODE_POS       (5U)
#define AUDIO_AEC_0_ATTEN_MODE_LEN       (3U)
#define AUDIO_AEC_0_ATTEN_MODE_MSK       (((1U << AUDIO_AEC_0_ATTEN_MODE_LEN) - 1) << AUDIO_AEC_0_ATTEN_MODE_POS)
#define AUDIO_AEC_0_ATTEN_MODE_UMSK      (~(((1U << AUDIO_AEC_0_ATTEN_MODE_LEN) - 1) << AUDIO_AEC_0_ATTEN_MODE_POS))
#define AUDIO_AEC_1_ATTEN_MODE           AUDIO_AEC_1_ATTEN_MODE
#define AUDIO_AEC_1_ATTEN_MODE_POS       (8U)
#define AUDIO_AEC_1_ATTEN_MODE_LEN       (3U)
#define AUDIO_AEC_1_ATTEN_MODE_MSK       (((1U << AUDIO_AEC_1_ATTEN_MODE_LEN) - 1) << AUDIO_AEC_1_ATTEN_MODE_POS)
#define AUDIO_AEC_1_ATTEN_MODE_UMSK      (~(((1U << AUDIO_AEC_1_ATTEN_MODE_LEN) - 1) << AUDIO_AEC_1_ATTEN_MODE_POS))
#define AUDIO_AEC_RECORD_VLD_4S_DIV      AUDIO_AEC_RECORD_VLD_4S_DIV
#define AUDIO_AEC_RECORD_VLD_4S_DIV_POS  (11U)
#define AUDIO_AEC_RECORD_VLD_4S_DIV_LEN  (2U)
#define AUDIO_AEC_RECORD_VLD_4S_DIV_MSK  (((1U << AUDIO_AEC_RECORD_VLD_4S_DIV_LEN) - 1) << AUDIO_AEC_RECORD_VLD_4S_DIV_POS)
#define AUDIO_AEC_RECORD_VLD_4S_DIV_UMSK (~(((1U << AUDIO_AEC_RECORD_VLD_4S_DIV_LEN) - 1) << AUDIO_AEC_RECORD_VLD_4S_DIV_POS))
#define AUDIO_AEC_RECORD_VLD_4S_EN       AUDIO_AEC_RECORD_VLD_4S_EN
#define AUDIO_AEC_RECORD_VLD_4S_EN_POS   (13U)
#define AUDIO_AEC_RECORD_VLD_4S_EN_LEN   (1U)
#define AUDIO_AEC_RECORD_VLD_4S_EN_MSK   (((1U << AUDIO_AEC_RECORD_VLD_4S_EN_LEN) - 1) << AUDIO_AEC_RECORD_VLD_4S_EN_POS)
#define AUDIO_AEC_RECORD_VLD_4S_EN_UMSK  (~(((1U << AUDIO_AEC_RECORD_VLD_4S_EN_LEN) - 1) << AUDIO_AEC_RECORD_VLD_4S_EN_POS))

/* 0x1C : pdm_0 */
#define AUDIO_PDM_0_OFFSET       (0x1C)
#define AUDIO_PDM_0_EN           AUDIO_PDM_0_EN
#define AUDIO_PDM_0_EN_POS       (0U)
#define AUDIO_PDM_0_EN_LEN       (1U)
#define AUDIO_PDM_0_EN_MSK       (((1U << AUDIO_PDM_0_EN_LEN) - 1) << AUDIO_PDM_0_EN_POS)
#define AUDIO_PDM_0_EN_UMSK      (~(((1U << AUDIO_PDM_0_EN_LEN) - 1) << AUDIO_PDM_0_EN_POS))
#define AUDIO_PDM_1_EN           AUDIO_PDM_1_EN
#define AUDIO_PDM_1_EN_POS       (1U)
#define AUDIO_PDM_1_EN_LEN       (1U)
#define AUDIO_PDM_1_EN_MSK       (((1U << AUDIO_PDM_1_EN_LEN) - 1) << AUDIO_PDM_1_EN_POS)
#define AUDIO_PDM_1_EN_UMSK      (~(((1U << AUDIO_PDM_1_EN_LEN) - 1) << AUDIO_PDM_1_EN_POS))
#define AUDIO_PDM_2_EN           AUDIO_PDM_2_EN
#define AUDIO_PDM_2_EN_POS       (2U)
#define AUDIO_PDM_2_EN_LEN       (1U)
#define AUDIO_PDM_2_EN_MSK       (((1U << AUDIO_PDM_2_EN_LEN) - 1) << AUDIO_PDM_2_EN_POS)
#define AUDIO_PDM_2_EN_UMSK      (~(((1U << AUDIO_PDM_2_EN_LEN) - 1) << AUDIO_PDM_2_EN_POS))
#define AUDIO_ADC_0_PDM_SEL      AUDIO_ADC_0_PDM_SEL
#define AUDIO_ADC_0_PDM_SEL_POS  (3U)
#define AUDIO_ADC_0_PDM_SEL_LEN  (3U)
#define AUDIO_ADC_0_PDM_SEL_MSK  (((1U << AUDIO_ADC_0_PDM_SEL_LEN) - 1) << AUDIO_ADC_0_PDM_SEL_POS)
#define AUDIO_ADC_0_PDM_SEL_UMSK (~(((1U << AUDIO_ADC_0_PDM_SEL_LEN) - 1) << AUDIO_ADC_0_PDM_SEL_POS))
#define AUDIO_ADC_1_PDM_SEL      AUDIO_ADC_1_PDM_SEL
#define AUDIO_ADC_1_PDM_SEL_POS  (6U)
#define AUDIO_ADC_1_PDM_SEL_LEN  (3U)
#define AUDIO_ADC_1_PDM_SEL_MSK  (((1U << AUDIO_ADC_1_PDM_SEL_LEN) - 1) << AUDIO_ADC_1_PDM_SEL_POS)
#define AUDIO_ADC_1_PDM_SEL_UMSK (~(((1U << AUDIO_ADC_1_PDM_SEL_LEN) - 1) << AUDIO_ADC_1_PDM_SEL_POS))
#define AUDIO_ADC_2_PDM_SEL      AUDIO_ADC_2_PDM_SEL
#define AUDIO_ADC_2_PDM_SEL_POS  (9U)
#define AUDIO_ADC_2_PDM_SEL_LEN  (3U)
#define AUDIO_ADC_2_PDM_SEL_MSK  (((1U << AUDIO_ADC_2_PDM_SEL_LEN) - 1) << AUDIO_ADC_2_PDM_SEL_POS)
#define AUDIO_ADC_2_PDM_SEL_UMSK (~(((1U << AUDIO_ADC_2_PDM_SEL_LEN) - 1) << AUDIO_ADC_2_PDM_SEL_POS))

/* 0x20 : rsvd0 */
#define AUDIO_RSVD0_OFFSET (0x20)

/* 0x24 : dbg_0 */
#define AUDIO_DBG_0_OFFSET           (0x24)
#define AUDIO_AUD_SIN_EN             AUDIO_AUD_SIN_EN
#define AUDIO_AUD_SIN_EN_POS         (0U)
#define AUDIO_AUD_SIN_EN_LEN         (1U)
#define AUDIO_AUD_SIN_EN_MSK         (((1U << AUDIO_AUD_SIN_EN_LEN) - 1) << AUDIO_AUD_SIN_EN_POS)
#define AUDIO_AUD_SIN_EN_UMSK        (~(((1U << AUDIO_AUD_SIN_EN_LEN) - 1) << AUDIO_AUD_SIN_EN_POS))
#define AUDIO_AUD_SIN_STEP           AUDIO_AUD_SIN_STEP
#define AUDIO_AUD_SIN_STEP_POS       (1U)
#define AUDIO_AUD_SIN_STEP_LEN       (3U)
#define AUDIO_AUD_SIN_STEP_MSK       (((1U << AUDIO_AUD_SIN_STEP_LEN) - 1) << AUDIO_AUD_SIN_STEP_POS)
#define AUDIO_AUD_SIN_STEP_UMSK      (~(((1U << AUDIO_AUD_SIN_STEP_LEN) - 1) << AUDIO_AUD_SIN_STEP_POS))
#define AUDIO_TEST_OUT_SEL           AUDIO_TEST_OUT_SEL
#define AUDIO_TEST_OUT_SEL_POS       (18U)
#define AUDIO_TEST_OUT_SEL_LEN       (2U)
#define AUDIO_TEST_OUT_SEL_MSK       (((1U << AUDIO_TEST_OUT_SEL_LEN) - 1) << AUDIO_TEST_OUT_SEL_POS)
#define AUDIO_TEST_OUT_SEL_UMSK      (~(((1U << AUDIO_TEST_OUT_SEL_LEN) - 1) << AUDIO_TEST_OUT_SEL_POS))
#define AUDIO_DAC_TEST_CLKIN_EN      AUDIO_DAC_TEST_CLKIN_EN
#define AUDIO_DAC_TEST_CLKIN_EN_POS  (20U)
#define AUDIO_DAC_TEST_CLKIN_EN_LEN  (1U)
#define AUDIO_DAC_TEST_CLKIN_EN_MSK  (((1U << AUDIO_DAC_TEST_CLKIN_EN_LEN) - 1) << AUDIO_DAC_TEST_CLKIN_EN_POS)
#define AUDIO_DAC_TEST_CLKIN_EN_UMSK (~(((1U << AUDIO_DAC_TEST_CLKIN_EN_LEN) - 1) << AUDIO_DAC_TEST_CLKIN_EN_POS))
#define AUDIO_ADC_TEST_CLKIN_EN      AUDIO_ADC_TEST_CLKIN_EN
#define AUDIO_ADC_TEST_CLKIN_EN_POS  (21U)
#define AUDIO_ADC_TEST_CLKIN_EN_LEN  (1U)
#define AUDIO_ADC_TEST_CLKIN_EN_MSK  (((1U << AUDIO_ADC_TEST_CLKIN_EN_LEN) - 1) << AUDIO_ADC_TEST_CLKIN_EN_POS)
#define AUDIO_ADC_TEST_CLKIN_EN_UMSK (~(((1U << AUDIO_ADC_TEST_CLKIN_EN_LEN) - 1) << AUDIO_ADC_TEST_CLKIN_EN_POS))
#define AUDIO_DAC_TEST_DIN_EN        AUDIO_DAC_TEST_DIN_EN
#define AUDIO_DAC_TEST_DIN_EN_POS    (22U)
#define AUDIO_DAC_TEST_DIN_EN_LEN    (1U)
#define AUDIO_DAC_TEST_DIN_EN_MSK    (((1U << AUDIO_DAC_TEST_DIN_EN_LEN) - 1) << AUDIO_DAC_TEST_DIN_EN_POS)
#define AUDIO_DAC_TEST_DIN_EN_UMSK   (~(((1U << AUDIO_DAC_TEST_DIN_EN_LEN) - 1) << AUDIO_DAC_TEST_DIN_EN_POS))
#define AUDIO_ADC_TEST_DIN_EN        AUDIO_ADC_TEST_DIN_EN
#define AUDIO_ADC_TEST_DIN_EN_POS    (23U)
#define AUDIO_ADC_TEST_DIN_EN_LEN    (1U)
#define AUDIO_ADC_TEST_DIN_EN_MSK    (((1U << AUDIO_ADC_TEST_DIN_EN_LEN) - 1) << AUDIO_ADC_TEST_DIN_EN_POS)
#define AUDIO_ADC_TEST_DIN_EN_UMSK   (~(((1U << AUDIO_ADC_TEST_DIN_EN_LEN) - 1) << AUDIO_ADC_TEST_DIN_EN_POS))
#define AUDIO_AUD_TEST_READ_SEL      AUDIO_AUD_TEST_READ_SEL
#define AUDIO_AUD_TEST_READ_SEL_POS  (24U)
#define AUDIO_AUD_TEST_READ_SEL_LEN  (6U)
#define AUDIO_AUD_TEST_READ_SEL_MSK  (((1U << AUDIO_AUD_TEST_READ_SEL_LEN) - 1) << AUDIO_AUD_TEST_READ_SEL_POS)
#define AUDIO_AUD_TEST_READ_SEL_UMSK (~(((1U << AUDIO_AUD_TEST_READ_SEL_LEN) - 1) << AUDIO_AUD_TEST_READ_SEL_POS))

/* 0x28 : dbg_1 */
#define AUDIO_DBG_1_OFFSET       (0x28)
#define AUDIO_AUD_TEST_READ      AUDIO_AUD_TEST_READ
#define AUDIO_AUD_TEST_READ_POS  (0U)
#define AUDIO_AUD_TEST_READ_LEN  (32U)
#define AUDIO_AUD_TEST_READ_MSK  (((1U << AUDIO_AUD_TEST_READ_LEN) - 1) << AUDIO_AUD_TEST_READ_POS)
#define AUDIO_AUD_TEST_READ_UMSK (~(((1U << AUDIO_AUD_TEST_READ_LEN) - 1) << AUDIO_AUD_TEST_READ_POS))

/* 0x2C : dbg_2 */
#define AUDIO_DBG_2_OFFSET           (0x2C)
#define AUDIO_ADC_FIR_4S_VAL         AUDIO_ADC_FIR_4S_VAL
#define AUDIO_ADC_FIR_4S_VAL_POS     (0U)
#define AUDIO_ADC_FIR_4S_VAL_LEN     (20U)
#define AUDIO_ADC_FIR_4S_VAL_MSK     (((1U << AUDIO_ADC_FIR_4S_VAL_LEN) - 1) << AUDIO_ADC_FIR_4S_VAL_POS)
#define AUDIO_ADC_FIR_4S_VAL_UMSK    (~(((1U << AUDIO_ADC_FIR_4S_VAL_LEN) - 1) << AUDIO_ADC_FIR_4S_VAL_POS))
#define AUDIO_ADC_0_FIR_4S_EN        AUDIO_ADC_0_FIR_4S_EN
#define AUDIO_ADC_0_FIR_4S_EN_POS    (20U)
#define AUDIO_ADC_0_FIR_4S_EN_LEN    (1U)
#define AUDIO_ADC_0_FIR_4S_EN_MSK    (((1U << AUDIO_ADC_0_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_0_FIR_4S_EN_POS)
#define AUDIO_ADC_0_FIR_4S_EN_UMSK   (~(((1U << AUDIO_ADC_0_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_0_FIR_4S_EN_POS))
#define AUDIO_ADC_1_FIR_4S_EN        AUDIO_ADC_1_FIR_4S_EN
#define AUDIO_ADC_1_FIR_4S_EN_POS    (21U)
#define AUDIO_ADC_1_FIR_4S_EN_LEN    (1U)
#define AUDIO_ADC_1_FIR_4S_EN_MSK    (((1U << AUDIO_ADC_1_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_1_FIR_4S_EN_POS)
#define AUDIO_ADC_1_FIR_4S_EN_UMSK   (~(((1U << AUDIO_ADC_1_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_1_FIR_4S_EN_POS))
#define AUDIO_ADC_2_FIR_4S_EN        AUDIO_ADC_2_FIR_4S_EN
#define AUDIO_ADC_2_FIR_4S_EN_POS    (22U)
#define AUDIO_ADC_2_FIR_4S_EN_LEN    (1U)
#define AUDIO_ADC_2_FIR_4S_EN_MSK    (((1U << AUDIO_ADC_2_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_2_FIR_4S_EN_POS)
#define AUDIO_ADC_2_FIR_4S_EN_UMSK   (~(((1U << AUDIO_ADC_2_FIR_4S_EN_LEN) - 1) << AUDIO_ADC_2_FIR_4S_EN_POS))
#define AUDIO_ADC_IN_0_TEST_SEL      AUDIO_ADC_IN_0_TEST_SEL
#define AUDIO_ADC_IN_0_TEST_SEL_POS  (23U)
#define AUDIO_ADC_IN_0_TEST_SEL_LEN  (1U)
#define AUDIO_ADC_IN_0_TEST_SEL_MSK  (((1U << AUDIO_ADC_IN_0_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_0_TEST_SEL_POS)
#define AUDIO_ADC_IN_0_TEST_SEL_UMSK (~(((1U << AUDIO_ADC_IN_0_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_0_TEST_SEL_POS))
#define AUDIO_ADC_IN_1_TEST_SEL      AUDIO_ADC_IN_1_TEST_SEL
#define AUDIO_ADC_IN_1_TEST_SEL_POS  (24U)
#define AUDIO_ADC_IN_1_TEST_SEL_LEN  (1U)
#define AUDIO_ADC_IN_1_TEST_SEL_MSK  (((1U << AUDIO_ADC_IN_1_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_1_TEST_SEL_POS)
#define AUDIO_ADC_IN_1_TEST_SEL_UMSK (~(((1U << AUDIO_ADC_IN_1_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_1_TEST_SEL_POS))
#define AUDIO_ADC_IN_2_TEST_SEL      AUDIO_ADC_IN_2_TEST_SEL
#define AUDIO_ADC_IN_2_TEST_SEL_POS  (25U)
#define AUDIO_ADC_IN_2_TEST_SEL_LEN  (1U)
#define AUDIO_ADC_IN_2_TEST_SEL_MSK  (((1U << AUDIO_ADC_IN_2_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_2_TEST_SEL_POS)
#define AUDIO_ADC_IN_2_TEST_SEL_UMSK (~(((1U << AUDIO_ADC_IN_2_TEST_SEL_LEN) - 1) << AUDIO_ADC_IN_2_TEST_SEL_POS))

/* 0x30 : dbg_3 */
#define AUDIO_DBG_3_OFFSET           (0x30)
#define AUDIO_DAC_4S_VAL             AUDIO_DAC_4S_VAL
#define AUDIO_DAC_4S_VAL_POS         (0U)
#define AUDIO_DAC_4S_VAL_LEN         (20U)
#define AUDIO_DAC_4S_VAL_MSK         (((1U << AUDIO_DAC_4S_VAL_LEN) - 1) << AUDIO_DAC_4S_VAL_POS)
#define AUDIO_DAC_4S_VAL_UMSK        (~(((1U << AUDIO_DAC_4S_VAL_LEN) - 1) << AUDIO_DAC_4S_VAL_POS))
#define AUDIO_DAC_DWA_0_4S_EN        AUDIO_DAC_DWA_0_4S_EN
#define AUDIO_DAC_DWA_0_4S_EN_POS    (20U)
#define AUDIO_DAC_DWA_0_4S_EN_LEN    (1U)
#define AUDIO_DAC_DWA_0_4S_EN_MSK    (((1U << AUDIO_DAC_DWA_0_4S_EN_LEN) - 1) << AUDIO_DAC_DWA_0_4S_EN_POS)
#define AUDIO_DAC_DWA_0_4S_EN_UMSK   (~(((1U << AUDIO_DAC_DWA_0_4S_EN_LEN) - 1) << AUDIO_DAC_DWA_0_4S_EN_POS))
#define AUDIO_DAC_DWA_1_4S_EN        AUDIO_DAC_DWA_1_4S_EN
#define AUDIO_DAC_DWA_1_4S_EN_POS    (21U)
#define AUDIO_DAC_DWA_1_4S_EN_LEN    (1U)
#define AUDIO_DAC_DWA_1_4S_EN_MSK    (((1U << AUDIO_DAC_DWA_1_4S_EN_LEN) - 1) << AUDIO_DAC_DWA_1_4S_EN_POS)
#define AUDIO_DAC_DWA_1_4S_EN_UMSK   (~(((1U << AUDIO_DAC_DWA_1_4S_EN_LEN) - 1) << AUDIO_DAC_DWA_1_4S_EN_POS))
#define AUDIO_DAC_IN_0_TEST_SEL      AUDIO_DAC_IN_0_TEST_SEL
#define AUDIO_DAC_IN_0_TEST_SEL_POS  (22U)
#define AUDIO_DAC_IN_0_TEST_SEL_LEN  (1U)
#define AUDIO_DAC_IN_0_TEST_SEL_MSK  (((1U << AUDIO_DAC_IN_0_TEST_SEL_LEN) - 1) << AUDIO_DAC_IN_0_TEST_SEL_POS)
#define AUDIO_DAC_IN_0_TEST_SEL_UMSK (~(((1U << AUDIO_DAC_IN_0_TEST_SEL_LEN) - 1) << AUDIO_DAC_IN_0_TEST_SEL_POS))
#define AUDIO_DAC_IN_1_TEST_SEL      AUDIO_DAC_IN_1_TEST_SEL
#define AUDIO_DAC_IN_1_TEST_SEL_POS  (23U)
#define AUDIO_DAC_IN_1_TEST_SEL_LEN  (1U)
#define AUDIO_DAC_IN_1_TEST_SEL_MSK  (((1U << AUDIO_DAC_IN_1_TEST_SEL_LEN) - 1) << AUDIO_DAC_IN_1_TEST_SEL_POS)
#define AUDIO_DAC_IN_1_TEST_SEL_UMSK (~(((1U << AUDIO_DAC_IN_1_TEST_SEL_LEN) - 1) << AUDIO_DAC_IN_1_TEST_SEL_POS))

