XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x34 : dbg_4 */
#define AUDIO_DBG_4_OFFSET                 (0x34)
#define AUDIO_ADC_IN_RATIO_4S_VAL          AUDIO_ADC_IN_RATIO_4S_VAL
#define AUDIO_ADC_IN_RATIO_4S_VAL_POS      (0U)
#define AUDIO_ADC_IN_RATIO_4S_VAL_LEN      (1U)
#define AUDIO_ADC_IN_RATIO_4S_VAL_MSK      (((1U << AUDIO_ADC_IN_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_RATIO_4S_VAL_POS)
#define AUDIO_ADC_IN_RATIO_4S_VAL_UMSK     (~(((1U << AUDIO_ADC_IN_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_RATIO_4S_VAL_POS))
#define AUDIO_ADC_IN_CH0_RATIO_4S_VAL      AUDIO_ADC_IN_CH0_RATIO_4S_VAL
#define AUDIO_ADC_IN_CH0_RATIO_4S_VAL_POS  (1U)
#define AUDIO_ADC_IN_CH0_RATIO_4S_VAL_LEN  (1U)
#define AUDIO_ADC_IN_CH0_RATIO_4S_VAL_MSK  (((1U << AUDIO_ADC_IN_CH0_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH0_RATIO_4S_VAL_POS)
#define AUDIO_ADC_IN_CH0_RATIO_4S_VAL_UMSK (~(((1U << AUDIO_ADC_IN_CH0_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH0_RATIO_4S_VAL_POS))
#define AUDIO_ADC_IN_CH1_RATIO_4S_VAL      AUDIO_ADC_IN_CH1_RATIO_4S_VAL
#define AUDIO_ADC_IN_CH1_RATIO_4S_VAL_POS  (2U)
#define AUDIO_ADC_IN_CH1_RATIO_4S_VAL_LEN  (1U)
#define AUDIO_ADC_IN_CH1_RATIO_4S_VAL_MSK  (((1U << AUDIO_ADC_IN_CH1_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH1_RATIO_4S_VAL_POS)
#define AUDIO_ADC_IN_CH1_RATIO_4S_VAL_UMSK (~(((1U << AUDIO_ADC_IN_CH1_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH1_RATIO_4S_VAL_POS))
#define AUDIO_ADC_IN_CH2_RATIO_4S_VAL      AUDIO_ADC_IN_CH2_RATIO_4S_VAL
#define AUDIO_ADC_IN_CH2_RATIO_4S_VAL_POS  (3U)
#define AUDIO_ADC_IN_CH2_RATIO_4S_VAL_LEN  (1U)
#define AUDIO_ADC_IN_CH2_RATIO_4S_VAL_MSK  (((1U << AUDIO_ADC_IN_CH2_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH2_RATIO_4S_VAL_POS)
#define AUDIO_ADC_IN_CH2_RATIO_4S_VAL_UMSK (~(((1U << AUDIO_ADC_IN_CH2_RATIO_4S_VAL_LEN) - 1) << AUDIO_ADC_IN_CH2_RATIO_4S_VAL_POS))
#define AUDIO_PDM_IN_RATIO_4S_VAL          AUDIO_PDM_IN_RATIO_4S_VAL
#define AUDIO_PDM_IN_RATIO_4S_VAL_POS      (4U)
#define AUDIO_PDM_IN_RATIO_4S_VAL_LEN      (1U)
#define AUDIO_PDM_IN_RATIO_4S_VAL_MSK      (((1U << AUDIO_PDM_IN_RATIO_4S_VAL_LEN) - 1) << AUDIO_PDM_IN_RATIO_4S_VAL_POS)
#define AUDIO_PDM_IN_RATIO_4S_VAL_UMSK     (~(((1U << AUDIO_PDM_IN_RATIO_4S_VAL_LEN) - 1) << AUDIO_PDM_IN_RATIO_4S_VAL_POS))
#define AUDIO_PDM_IN_RATIO_4S              AUDIO_PDM_IN_RATIO_4S
#define AUDIO_PDM_IN_RATIO_4S_POS          (5U)
#define AUDIO_PDM_IN_RATIO_4S_LEN          (1U)
#define AUDIO_PDM_IN_RATIO_4S_MSK          (((1U << AUDIO_PDM_IN_RATIO_4S_LEN) - 1) << AUDIO_PDM_IN_RATIO_4S_POS)
#define AUDIO_PDM_IN_RATIO_4S_UMSK         (~(((1U << AUDIO_PDM_IN_RATIO_4S_LEN) - 1) << AUDIO_PDM_IN_RATIO_4S_POS))
#define AUDIO_DAC_OUT_RATIO_4S_VAL         AUDIO_DAC_OUT_RATIO_4S_VAL
#define AUDIO_DAC_OUT_RATIO_4S_VAL_POS     (6U)
#define AUDIO_DAC_OUT_RATIO_4S_VAL_LEN     (2U)
#define AUDIO_DAC_OUT_RATIO_4S_VAL_MSK     (((1U << AUDIO_DAC_OUT_RATIO_4S_VAL_LEN) - 1) << AUDIO_DAC_OUT_RATIO_4S_VAL_POS)
#define AUDIO_DAC_OUT_RATIO_4S_VAL_UMSK    (~(((1U << AUDIO_DAC_OUT_RATIO_4S_VAL_LEN) - 1) << AUDIO_DAC_OUT_RATIO_4S_VAL_POS))
#define AUDIO_AEC_FS_RATE_4S_VAL           AUDIO_AEC_FS_RATE_4S_VAL
#define AUDIO_AEC_FS_RATE_4S_VAL_POS       (8U)
#define AUDIO_AEC_FS_RATE_4S_VAL_LEN       (3U)
#define AUDIO_AEC_FS_RATE_4S_VAL_MSK       (((1U << AUDIO_AEC_FS_RATE_4S_VAL_LEN) - 1) << AUDIO_AEC_FS_RATE_4S_VAL_POS)
#define AUDIO_AEC_FS_RATE_4S_VAL_UMSK      (~(((1U << AUDIO_AEC_FS_RATE_4S_VAL_LEN) - 1) << AUDIO_AEC_FS_RATE_4S_VAL_POS))

/* 0x80 : rx_fifo_ctrl */
#define AUDIO_RX_FIFO_CTRL_OFFSET (0x80)
#define AUDIO_RX_FIFO_FLUSH       AUDIO_RX_FIFO_FLUSH
#define AUDIO_RX_FIFO_FLUSH_POS   (0U)
#define AUDIO_RX_FIFO_FLUSH_LEN   (1U)
#define AUDIO_RX_FIFO_FLUSH_MSK   (((1U << AUDIO_RX_FIFO_FLUSH_LEN) - 1) << AUDIO_RX_FIFO_FLUSH_POS)
#define AUDIO_RX_FIFO_FLUSH_UMSK  (~(((1U << AUDIO_RX_FIFO_FLUSH_LEN) - 1) << AUDIO_RX_FIFO_FLUSH_POS))
#define AUDIO_RXO_INT_EN          AUDIO_RXO_INT_EN
#define AUDIO_RXO_INT_EN_POS      (1U)
#define AUDIO_RXO_INT_EN_LEN      (1U)
#define AUDIO_RXO_INT_EN_MSK      (((1U << AUDIO_RXO_INT_EN_LEN) - 1) << AUDIO_RXO_INT_EN_POS)
#define AUDIO_RXO_INT_EN_UMSK     (~(((1U << AUDIO_RXO_INT_EN_LEN) - 1) << AUDIO_RXO_INT_EN_POS))
#define AUDIO_RXU_INT_EN          AUDIO_RXU_INT_EN
#define AUDIO_RXU_INT_EN_POS      (2U)
#define AUDIO_RXU_INT_EN_LEN      (1U)
#define AUDIO_RXU_INT_EN_MSK      (((1U << AUDIO_RXU_INT_EN_LEN) - 1) << AUDIO_RXU_INT_EN_POS)
#define AUDIO_RXU_INT_EN_UMSK     (~(((1U << AUDIO_RXU_INT_EN_LEN) - 1) << AUDIO_RXU_INT_EN_POS))
#define AUDIO_RXA_INT_EN          AUDIO_RXA_INT_EN
#define AUDIO_RXA_INT_EN_POS      (3U)
#define AUDIO_RXA_INT_EN_LEN      (1U)
#define AUDIO_RXA_INT_EN_MSK      (((1U << AUDIO_RXA_INT_EN_LEN) - 1) << AUDIO_RXA_INT_EN_POS)
#define AUDIO_RXA_INT_EN_UMSK     (~(((1U << AUDIO_RXA_INT_EN_LEN) - 1) << AUDIO_RXA_INT_EN_POS))
#define AUDIO_RX_DRQ_EN           AUDIO_RX_DRQ_EN
#define AUDIO_RX_DRQ_EN_POS       (4U)
#define AUDIO_RX_DRQ_EN_LEN       (1U)
#define AUDIO_RX_DRQ_EN_MSK       (((1U << AUDIO_RX_DRQ_EN_LEN) - 1) << AUDIO_RX_DRQ_EN_POS)
#define AUDIO_RX_DRQ_EN_UMSK      (~(((1U << AUDIO_RX_DRQ_EN_LEN) - 1) << AUDIO_RX_DRQ_EN_POS))
#define AUDIO_RX_DATA_RES         AUDIO_RX_DATA_RES
#define AUDIO_RX_DATA_RES_POS     (5U)
#define AUDIO_RX_DATA_RES_LEN     (1U)
#define AUDIO_RX_DATA_RES_MSK     (((1U << AUDIO_RX_DATA_RES_LEN) - 1) << AUDIO_RX_DATA_RES_POS)
#define AUDIO_RX_DATA_RES_UMSK    (~(((1U << AUDIO_RX_DATA_RES_LEN) - 1) << AUDIO_RX_DATA_RES_POS))
#define AUDIO_RX_CH_EN            AUDIO_RX_CH_EN
#define AUDIO_RX_CH_EN_POS        (8U)
#define AUDIO_RX_CH_EN_LEN        (5U)
#define AUDIO_RX_CH_EN_MSK        (((1U << AUDIO_RX_CH_EN_LEN) - 1) << AUDIO_RX_CH_EN_POS)
#define AUDIO_RX_CH_EN_UMSK       (~(((1U << AUDIO_RX_CH_EN_LEN) - 1) << AUDIO_RX_CH_EN_POS))
#define AUDIO_RX_DRQ_CNT          AUDIO_RX_DRQ_CNT
#define AUDIO_RX_DRQ_CNT_POS      (14U)
#define AUDIO_RX_DRQ_CNT_LEN      (2U)
#define AUDIO_RX_DRQ_CNT_MSK      (((1U << AUDIO_RX_DRQ_CNT_LEN) - 1) << AUDIO_RX_DRQ_CNT_POS)
#define AUDIO_RX_DRQ_CNT_UMSK     (~(((1U << AUDIO_RX_DRQ_CNT_LEN) - 1) << AUDIO_RX_DRQ_CNT_POS))
#define AUDIO_RX_TRG_LEVEL        AUDIO_RX_TRG_LEVEL
#define AUDIO_RX_TRG_LEVEL_POS    (16U)
#define AUDIO_RX_TRG_LEVEL_LEN    (7U)
#define AUDIO_RX_TRG_LEVEL_MSK    (((1U << AUDIO_RX_TRG_LEVEL_LEN) - 1) << AUDIO_RX_TRG_LEVEL_POS)
#define AUDIO_RX_TRG_LEVEL_UMSK   (~(((1U << AUDIO_RX_TRG_LEVEL_LEN) - 1) << AUDIO_RX_TRG_LEVEL_POS))
#define AUDIO_RX_DATA_MODE        AUDIO_RX_DATA_MODE
#define AUDIO_RX_DATA_MODE_POS    (24U)
#define AUDIO_RX_DATA_MODE_LEN    (2U)
#define AUDIO_RX_DATA_MODE_MSK    (((1U << AUDIO_RX_DATA_MODE_LEN) - 1) << AUDIO_RX_DATA_MODE_POS)
#define AUDIO_RX_DATA_MODE_UMSK   (~(((1U << AUDIO_RX_DATA_MODE_LEN) - 1) << AUDIO_RX_DATA_MODE_POS))

/* 0x84 : rx_fifo_status */
#define AUDIO_RX_FIFO_STATUS_OFFSET (0x84)
#define AUDIO_RXO_INT               AUDIO_RXO_INT
#define AUDIO_RXO_INT_POS           (1U)
#define AUDIO_RXO_INT_LEN           (1U)
#define AUDIO_RXO_INT_MSK           (((1U << AUDIO_RXO_INT_LEN) - 1) << AUDIO_RXO_INT_POS)
#define AUDIO_RXO_INT_UMSK          (~(((1U << AUDIO_RXO_INT_LEN) - 1) << AUDIO_RXO_INT_POS))
#define AUDIO_RXU_INT               AUDIO_RXU_INT
#define AUDIO_RXU_INT_POS           (2U)
#define AUDIO_RXU_INT_LEN           (1U)
#define AUDIO_RXU_INT_MSK           (((1U << AUDIO_RXU_INT_LEN) - 1) << AUDIO_RXU_INT_POS)
#define AUDIO_RXU_INT_UMSK          (~(((1U << AUDIO_RXU_INT_LEN) - 1) << AUDIO_RXU_INT_POS))
#define AUDIO_RXA_INT               AUDIO_RXA_INT
#define AUDIO_RXA_INT_POS           (4U)
#define AUDIO_RXA_INT_LEN           (1U)
#define AUDIO_RXA_INT_MSK           (((1U << AUDIO_RXA_INT_LEN) - 1) << AUDIO_RXA_INT_POS)
#define AUDIO_RXA_INT_UMSK          (~(((1U << AUDIO_RXA_INT_LEN) - 1) << AUDIO_RXA_INT_POS))
#define AUDIO_RXA_CNT               AUDIO_RXA_CNT
#define AUDIO_RXA_CNT_POS           (16U)
#define AUDIO_RXA_CNT_LEN           (7U)
#define AUDIO_RXA_CNT_MSK           (((1U << AUDIO_RXA_CNT_LEN) - 1) << AUDIO_RXA_CNT_POS)
#define AUDIO_RXA_CNT_UMSK          (~(((1U << AUDIO_RXA_CNT_LEN) - 1) << AUDIO_RXA_CNT_POS))
#define AUDIO_RXA                   AUDIO_RXA
#define AUDIO_RXA_POS               (24U)
#define AUDIO_RXA_LEN               (1U)
#define AUDIO_RXA_MSK               (((1U << AUDIO_RXA_LEN) - 1) << AUDIO_RXA_POS)
#define AUDIO_RXA_UMSK              (~(((1U << AUDIO_RXA_LEN) - 1) << AUDIO_RXA_POS))

