XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x204 : peq_00_b1 */
#define AUDIO_PEQ_00_B1_OFFSET (0x204)
#define AUDIO_PEQ_00_B1        AUDIO_PEQ_00_B1
#define AUDIO_PEQ_00_B1_POS    (0U)
#define AUDIO_PEQ_00_B1_LEN    (20U)
#define AUDIO_PEQ_00_B1_MSK    (((1U << AUDIO_PEQ_00_B1_LEN) - 1) << AUDIO_PEQ_00_B1_POS)
#define AUDIO_PEQ_00_B1_UMSK   (~(((1U << AUDIO_PEQ_00_B1_LEN) - 1) << AUDIO_PEQ_00_B1_POS))

/* 0x208 : peq_00_b2 */
#define AUDIO_PEQ_00_B2_OFFSET (0x208)
#define AUDIO_PEQ_00_B2        AUDIO_PEQ_00_B2
#define AUDIO_PEQ_00_B2_POS    (0U)
#define AUDIO_PEQ_00_B2_LEN    (20U)
#define AUDIO_PEQ_00_B2_MSK    (((1U << AUDIO_PEQ_00_B2_LEN) - 1) << AUDIO_PEQ_00_B2_POS)
#define AUDIO_PEQ_00_B2_UMSK   (~(((1U << AUDIO_PEQ_00_B2_LEN) - 1) << AUDIO_PEQ_00_B2_POS))

/* 0x20C : peq_00_a1 */
#define AUDIO_PEQ_00_A1_OFFSET (0x20C)
#define AUDIO_PEQ_00_A1        AUDIO_PEQ_00_A1
#define AUDIO_PEQ_00_A1_POS    (0U)
#define AUDIO_PEQ_00_A1_LEN    (20U)
#define AUDIO_PEQ_00_A1_MSK    (((1U << AUDIO_PEQ_00_A1_LEN) - 1) << AUDIO_PEQ_00_A1_POS)
#define AUDIO_PEQ_00_A1_UMSK   (~(((1U << AUDIO_PEQ_00_A1_LEN) - 1) << AUDIO_PEQ_00_A1_POS))

/* 0x210 : peq_00_a2 */
#define AUDIO_PEQ_00_A2_OFFSET (0x210)
#define AUDIO_PEQ_00_A2        AUDIO_PEQ_00_A2
#define AUDIO_PEQ_00_A2_POS    (0U)
#define AUDIO_PEQ_00_A2_LEN    (20U)
#define AUDIO_PEQ_00_A2_MSK    (((1U << AUDIO_PEQ_00_A2_LEN) - 1) << AUDIO_PEQ_00_A2_POS)
#define AUDIO_PEQ_00_A2_UMSK   (~(((1U << AUDIO_PEQ_00_A2_LEN) - 1) << AUDIO_PEQ_00_A2_POS))

/* 0x214 : peq_01_b0 */
#define AUDIO_PEQ_01_B0_OFFSET (0x214)
#define AUDIO_PEQ_01_B0        AUDIO_PEQ_01_B0
#define AUDIO_PEQ_01_B0_POS    (0U)
#define AUDIO_PEQ_01_B0_LEN    (20U)
#define AUDIO_PEQ_01_B0_MSK    (((1U << AUDIO_PEQ_01_B0_LEN) - 1) << AUDIO_PEQ_01_B0_POS)
#define AUDIO_PEQ_01_B0_UMSK   (~(((1U << AUDIO_PEQ_01_B0_LEN) - 1) << AUDIO_PEQ_01_B0_POS))
#define AUDIO_PEQ_01_BYP       AUDIO_PEQ_01_BYP
#define AUDIO_PEQ_01_BYP_POS   (20U)
#define AUDIO_PEQ_01_BYP_LEN   (1U)
#define AUDIO_PEQ_01_BYP_MSK   (((1U << AUDIO_PEQ_01_BYP_LEN) - 1) << AUDIO_PEQ_01_BYP_POS)
#define AUDIO_PEQ_01_BYP_UMSK  (~(((1U << AUDIO_PEQ_01_BYP_LEN) - 1) << AUDIO_PEQ_01_BYP_POS))
#define AUDIO_PEQ_01_QFMT      AUDIO_PEQ_01_QFMT
#define AUDIO_PEQ_01_QFMT_POS  (21U)
#define AUDIO_PEQ_01_QFMT_LEN  (1U)
#define AUDIO_PEQ_01_QFMT_MSK  (((1U << AUDIO_PEQ_01_QFMT_LEN) - 1) << AUDIO_PEQ_01_QFMT_POS)
#define AUDIO_PEQ_01_QFMT_UMSK (~(((1U << AUDIO_PEQ_01_QFMT_LEN) - 1) << AUDIO_PEQ_01_QFMT_POS))

/* 0x218 : peq_01_b1 */
#define AUDIO_PEQ_01_B1_OFFSET (0x218)
#define AUDIO_PEQ_01_B1        AUDIO_PEQ_01_B1
#define AUDIO_PEQ_01_B1_POS    (0U)
#define AUDIO_PEQ_01_B1_LEN    (20U)
#define AUDIO_PEQ_01_B1_MSK    (((1U << AUDIO_PEQ_01_B1_LEN) - 1) << AUDIO_PEQ_01_B1_POS)
#define AUDIO_PEQ_01_B1_UMSK   (~(((1U << AUDIO_PEQ_01_B1_LEN) - 1) << AUDIO_PEQ_01_B1_POS))

/* 0x21C : peq_01_b2 */
#define AUDIO_PEQ_01_B2_OFFSET (0x21C)
#define AUDIO_PEQ_01_B2        AUDIO_PEQ_01_B2
#define AUDIO_PEQ_01_B2_POS    (0U)
#define AUDIO_PEQ_01_B2_LEN    (20U)
#define AUDIO_PEQ_01_B2_MSK    (((1U << AUDIO_PEQ_01_B2_LEN) - 1) << AUDIO_PEQ_01_B2_POS)
#define AUDIO_PEQ_01_B2_UMSK   (~(((1U << AUDIO_PEQ_01_B2_LEN) - 1) << AUDIO_PEQ_01_B2_POS))

/* 0x220 : peq_01_a1 */
#define AUDIO_PEQ_01_A1_OFFSET (0x220)
#define AUDIO_PEQ_01_A1        AUDIO_PEQ_01_A1
#define AUDIO_PEQ_01_A1_POS    (0U)
#define AUDIO_PEQ_01_A1_LEN    (20U)
#define AUDIO_PEQ_01_A1_MSK    (((1U << AUDIO_PEQ_01_A1_LEN) - 1) << AUDIO_PEQ_01_A1_POS)
#define AUDIO_PEQ_01_A1_UMSK   (~(((1U << AUDIO_PEQ_01_A1_LEN) - 1) << AUDIO_PEQ_01_A1_POS))

/* 0x224 : peq_01_a2 */
#define AUDIO_PEQ_01_A2_OFFSET (0x224)
#define AUDIO_PEQ_01_A2        AUDIO_PEQ_01_A2
#define AUDIO_PEQ_01_A2_POS    (0U)
#define AUDIO_PEQ_01_A2_LEN    (20U)
#define AUDIO_PEQ_01_A2_MSK    (((1U << AUDIO_PEQ_01_A2_LEN) - 1) << AUDIO_PEQ_01_A2_POS)
#define AUDIO_PEQ_01_A2_UMSK   (~(((1U << AUDIO_PEQ_01_A2_LEN) - 1) << AUDIO_PEQ_01_A2_POS))

/* 0x228 : peq_02_b0 */
#define AUDIO_PEQ_02_B0_OFFSET (0x228)
#define AUDIO_PEQ_02_B0        AUDIO_PEQ_02_B0
#define AUDIO_PEQ_02_B0_POS    (0U)
#define AUDIO_PEQ_02_B0_LEN    (20U)
#define AUDIO_PEQ_02_B0_MSK    (((1U << AUDIO_PEQ_02_B0_LEN) - 1) << AUDIO_PEQ_02_B0_POS)
#define AUDIO_PEQ_02_B0_UMSK   (~(((1U << AUDIO_PEQ_02_B0_LEN) - 1) << AUDIO_PEQ_02_B0_POS))
#define AUDIO_PEQ_02_BYP       AUDIO_PEQ_02_BYP
#define AUDIO_PEQ_02_BYP_POS   (20U)
#define AUDIO_PEQ_02_BYP_LEN   (1U)
#define AUDIO_PEQ_02_BYP_MSK   (((1U << AUDIO_PEQ_02_BYP_LEN) - 1) << AUDIO_PEQ_02_BYP_POS)
#define AUDIO_PEQ_02_BYP_UMSK  (~(((1U << AUDIO_PEQ_02_BYP_LEN) - 1) << AUDIO_PEQ_02_BYP_POS))
#define AUDIO_PEQ_02_QFMT      AUDIO_PEQ_02_QFMT
#define AUDIO_PEQ_02_QFMT_POS  (21U)
#define AUDIO_PEQ_02_QFMT_LEN  (1U)
#define AUDIO_PEQ_02_QFMT_MSK  (((1U << AUDIO_PEQ_02_QFMT_LEN) - 1) << AUDIO_PEQ_02_QFMT_POS)
#define AUDIO_PEQ_02_QFMT_UMSK (~(((1U << AUDIO_PEQ_02_QFMT_LEN) - 1) << AUDIO_PEQ_02_QFMT_POS))

/* 0x22C : peq_02_b1 */
#define AUDIO_PEQ_02_B1_OFFSET (0x22C)
#define AUDIO_PEQ_02_B1        AUDIO_PEQ_02_B1
#define AUDIO_PEQ_02_B1_POS    (0U)
#define AUDIO_PEQ_02_B1_LEN    (20U)
#define AUDIO_PEQ_02_B1_MSK    (((1U << AUDIO_PEQ_02_B1_LEN) - 1) << AUDIO_PEQ_02_B1_POS)
#define AUDIO_PEQ_02_B1_UMSK   (~(((1U << AUDIO_PEQ_02_B1_LEN) - 1) << AUDIO_PEQ_02_B1_POS))

/* 0x230 : peq_02_b2 */
#define AUDIO_PEQ_02_B2_OFFSET (0x230)
#define AUDIO_PEQ_02_B2        AUDIO_PEQ_02_B2
#define AUDIO_PEQ_02_B2_POS    (0U)
#define AUDIO_PEQ_02_B2_LEN    (20U)
#define AUDIO_PEQ_02_B2_MSK    (((1U << AUDIO_PEQ_02_B2_LEN) - 1) << AUDIO_PEQ_02_B2_POS)
#define AUDIO_PEQ_02_B2_UMSK   (~(((1U << AUDIO_PEQ_02_B2_LEN) - 1) << AUDIO_PEQ_02_B2_POS))

/* 0x234 : peq_02_a1 */
#define AUDIO_PEQ_02_A1_OFFSET (0x234)
#define AUDIO_PEQ_02_A1        AUDIO_PEQ_02_A1
#define AUDIO_PEQ_02_A1_POS    (0U)
#define AUDIO_PEQ_02_A1_LEN    (20U)
#define AUDIO_PEQ_02_A1_MSK    (((1U << AUDIO_PEQ_02_A1_LEN) - 1) << AUDIO_PEQ_02_A1_POS)
#define AUDIO_PEQ_02_A1_UMSK   (~(((1U << AUDIO_PEQ_02_A1_LEN) - 1) << AUDIO_PEQ_02_A1_POS))

/* 0x238 : peq_02_a2 */
#define AUDIO_PEQ_02_A2_OFFSET (0x238)
#define AUDIO_PEQ_02_A2        AUDIO_PEQ_02_A2
#define AUDIO_PEQ_02_A2_POS    (0U)
#define AUDIO_PEQ_02_A2_LEN    (20U)
#define AUDIO_PEQ_02_A2_MSK    (((1U << AUDIO_PEQ_02_A2_LEN) - 1) << AUDIO_PEQ_02_A2_POS)
#define AUDIO_PEQ_02_A2_UMSK   (~(((1U << AUDIO_PEQ_02_A2_LEN) - 1) << AUDIO_PEQ_02_A2_POS))

