XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x23C : peq_03_b0 */
#define AUDIO_PEQ_03_B0_OFFSET (0x23C)
#define AUDIO_PEQ_03_B0        AUDIO_PEQ_03_B0
#define AUDIO_PEQ_03_B0_POS    (0U)
#define AUDIO_PEQ_03_B0_LEN    (20U)
#define AUDIO_PEQ_03_B0_MSK    (((1U << AUDIO_PEQ_03_B0_LEN) - 1) << AUDIO_PEQ_03_B0_POS)
#define AUDIO_PEQ_03_B0_UMSK   (~(((1U << AUDIO_PEQ_03_B0_LEN) - 1) << AUDIO_PEQ_03_B0_POS))
#define AUDIO_PEQ_03_BYP       AUDIO_PEQ_03_BYP
#define AUDIO_PEQ_03_BYP_POS   (20U)
#define AUDIO_PEQ_03_BYP_LEN   (1U)
#define AUDIO_PEQ_03_BYP_MSK   (((1U << AUDIO_PEQ_03_BYP_LEN) - 1) << AUDIO_PEQ_03_BYP_POS)
#define AUDIO_PEQ_03_BYP_UMSK  (~(((1U << AUDIO_PEQ_03_BYP_LEN) - 1) << AUDIO_PEQ_03_BYP_POS))
#define AUDIO_PEQ_03_QFMT      AUDIO_PEQ_03_QFMT
#define AUDIO_PEQ_03_QFMT_POS  (21U)
#define AUDIO_PEQ_03_QFMT_LEN  (1U)
#define AUDIO_PEQ_03_QFMT_MSK  (((1U << AUDIO_PEQ_03_QFMT_LEN) - 1) << AUDIO_PEQ_03_QFMT_POS)
#define AUDIO_PEQ_03_QFMT_UMSK (~(((1U << AUDIO_PEQ_03_QFMT_LEN) - 1) << AUDIO_PEQ_03_QFMT_POS))

/* 0x240 : peq_03_b1 */
#define AUDIO_PEQ_03_B1_OFFSET (0x240)
#define AUDIO_PEQ_03_B1        AUDIO_PEQ_03_B1
#define AUDIO_PEQ_03_B1_POS    (0U)
#define AUDIO_PEQ_03_B1_LEN    (20U)
#define AUDIO_PEQ_03_B1_MSK    (((1U << AUDIO_PEQ_03_B1_LEN) - 1) << AUDIO_PEQ_03_B1_POS)
#define AUDIO_PEQ_03_B1_UMSK   (~(((1U << AUDIO_PEQ_03_B1_LEN) - 1) << AUDIO_PEQ_03_B1_POS))

/* 0x244 : peq_03_b2 */
#define AUDIO_PEQ_03_B2_OFFSET (0x244)
#define AUDIO_PEQ_03_B2        AUDIO_PEQ_03_B2
#define AUDIO_PEQ_03_B2_POS    (0U)
#define AUDIO_PEQ_03_B2_LEN    (20U)
#define AUDIO_PEQ_03_B2_MSK    (((1U << AUDIO_PEQ_03_B2_LEN) - 1) << AUDIO_PEQ_03_B2_POS)
#define AUDIO_PEQ_03_B2_UMSK   (~(((1U << AUDIO_PEQ_03_B2_LEN) - 1) << AUDIO_PEQ_03_B2_POS))

/* 0x248 : peq_03_a1 */
#define AUDIO_PEQ_03_A1_OFFSET (0x248)
#define AUDIO_PEQ_03_A1        AUDIO_PEQ_03_A1
#define AUDIO_PEQ_03_A1_POS    (0U)
#define AUDIO_PEQ_03_A1_LEN    (20U)
#define AUDIO_PEQ_03_A1_MSK    (((1U << AUDIO_PEQ_03_A1_LEN) - 1) << AUDIO_PEQ_03_A1_POS)
#define AUDIO_PEQ_03_A1_UMSK   (~(((1U << AUDIO_PEQ_03_A1_LEN) - 1) << AUDIO_PEQ_03_A1_POS))

/* 0x24C : peq_03_a2 */
#define AUDIO_PEQ_03_A2_OFFSET (0x24C)
#define AUDIO_PEQ_03_A2        AUDIO_PEQ_03_A2
#define AUDIO_PEQ_03_A2_POS    (0U)
#define AUDIO_PEQ_03_A2_LEN    (20U)
#define AUDIO_PEQ_03_A2_MSK    (((1U << AUDIO_PEQ_03_A2_LEN) - 1) << AUDIO_PEQ_03_A2_POS)
#define AUDIO_PEQ_03_A2_UMSK   (~(((1U << AUDIO_PEQ_03_A2_LEN) - 1) << AUDIO_PEQ_03_A2_POS))

/* 0x250 : peq_04_b0 */
#define AUDIO_PEQ_04_B0_OFFSET (0x250)
#define AUDIO_PEQ_04_B0        AUDIO_PEQ_04_B0
#define AUDIO_PEQ_04_B0_POS    (0U)
#define AUDIO_PEQ_04_B0_LEN    (20U)
#define AUDIO_PEQ_04_B0_MSK    (((1U << AUDIO_PEQ_04_B0_LEN) - 1) << AUDIO_PEQ_04_B0_POS)
#define AUDIO_PEQ_04_B0_UMSK   (~(((1U << AUDIO_PEQ_04_B0_LEN) - 1) << AUDIO_PEQ_04_B0_POS))
#define AUDIO_PEQ_04_BYP       AUDIO_PEQ_04_BYP
#define AUDIO_PEQ_04_BYP_POS   (20U)
#define AUDIO_PEQ_04_BYP_LEN   (1U)
#define AUDIO_PEQ_04_BYP_MSK   (((1U << AUDIO_PEQ_04_BYP_LEN) - 1) << AUDIO_PEQ_04_BYP_POS)
#define AUDIO_PEQ_04_BYP_UMSK  (~(((1U << AUDIO_PEQ_04_BYP_LEN) - 1) << AUDIO_PEQ_04_BYP_POS))
#define AUDIO_PEQ_04_QFMT      AUDIO_PEQ_04_QFMT
#define AUDIO_PEQ_04_QFMT_POS  (21U)
#define AUDIO_PEQ_04_QFMT_LEN  (1U)
#define AUDIO_PEQ_04_QFMT_MSK  (((1U << AUDIO_PEQ_04_QFMT_LEN) - 1) << AUDIO_PEQ_04_QFMT_POS)
#define AUDIO_PEQ_04_QFMT_UMSK (~(((1U << AUDIO_PEQ_04_QFMT_LEN) - 1) << AUDIO_PEQ_04_QFMT_POS))

/* 0x254 : peq_04_b1 */
#define AUDIO_PEQ_04_B1_OFFSET (0x254)
#define AUDIO_PEQ_04_B1        AUDIO_PEQ_04_B1
#define AUDIO_PEQ_04_B1_POS    (0U)
#define AUDIO_PEQ_04_B1_LEN    (20U)
#define AUDIO_PEQ_04_B1_MSK    (((1U << AUDIO_PEQ_04_B1_LEN) - 1) << AUDIO_PEQ_04_B1_POS)
#define AUDIO_PEQ_04_B1_UMSK   (~(((1U << AUDIO_PEQ_04_B1_LEN) - 1) << AUDIO_PEQ_04_B1_POS))

/* 0x258 : peq_04_b2 */
#define AUDIO_PEQ_04_B2_OFFSET (0x258)
#define AUDIO_PEQ_04_B2        AUDIO_PEQ_04_B2
#define AUDIO_PEQ_04_B2_POS    (0U)
#define AUDIO_PEQ_04_B2_LEN    (20U)
#define AUDIO_PEQ_04_B2_MSK    (((1U << AUDIO_PEQ_04_B2_LEN) - 1) << AUDIO_PEQ_04_B2_POS)
#define AUDIO_PEQ_04_B2_UMSK   (~(((1U << AUDIO_PEQ_04_B2_LEN) - 1) << AUDIO_PEQ_04_B2_POS))

/* 0x25C : peq_04_a1 */
#define AUDIO_PEQ_04_A1_OFFSET (0x25C)
#define AUDIO_PEQ_04_A1        AUDIO_PEQ_04_A1
#define AUDIO_PEQ_04_A1_POS    (0U)
#define AUDIO_PEQ_04_A1_LEN    (20U)
#define AUDIO_PEQ_04_A1_MSK    (((1U << AUDIO_PEQ_04_A1_LEN) - 1) << AUDIO_PEQ_04_A1_POS)
#define AUDIO_PEQ_04_A1_UMSK   (~(((1U << AUDIO_PEQ_04_A1_LEN) - 1) << AUDIO_PEQ_04_A1_POS))

/* 0x260 : peq_04_a2 */
#define AUDIO_PEQ_04_A2_OFFSET (0x260)
#define AUDIO_PEQ_04_A2        AUDIO_PEQ_04_A2
#define AUDIO_PEQ_04_A2_POS    (0U)
#define AUDIO_PEQ_04_A2_LEN    (20U)
#define AUDIO_PEQ_04_A2_MSK    (((1U << AUDIO_PEQ_04_A2_LEN) - 1) << AUDIO_PEQ_04_A2_POS)
#define AUDIO_PEQ_04_A2_UMSK   (~(((1U << AUDIO_PEQ_04_A2_LEN) - 1) << AUDIO_PEQ_04_A2_POS))

/* 0x264 : peq_05_b0 */
#define AUDIO_PEQ_05_B0_OFFSET (0x264)
#define AUDIO_PEQ_05_B0        AUDIO_PEQ_05_B0
#define AUDIO_PEQ_05_B0_POS    (0U)
#define AUDIO_PEQ_05_B0_LEN    (20U)
#define AUDIO_PEQ_05_B0_MSK    (((1U << AUDIO_PEQ_05_B0_LEN) - 1) << AUDIO_PEQ_05_B0_POS)
#define AUDIO_PEQ_05_B0_UMSK   (~(((1U << AUDIO_PEQ_05_B0_LEN) - 1) << AUDIO_PEQ_05_B0_POS))
#define AUDIO_PEQ_05_BYP       AUDIO_PEQ_05_BYP
#define AUDIO_PEQ_05_BYP_POS   (20U)
#define AUDIO_PEQ_05_BYP_LEN   (1U)
#define AUDIO_PEQ_05_BYP_MSK   (((1U << AUDIO_PEQ_05_BYP_LEN) - 1) << AUDIO_PEQ_05_BYP_POS)
#define AUDIO_PEQ_05_BYP_UMSK  (~(((1U << AUDIO_PEQ_05_BYP_LEN) - 1) << AUDIO_PEQ_05_BYP_POS))
#define AUDIO_PEQ_05_QFMT      AUDIO_PEQ_05_QFMT
#define AUDIO_PEQ_05_QFMT_POS  (21U)
#define AUDIO_PEQ_05_QFMT_LEN  (1U)
#define AUDIO_PEQ_05_QFMT_MSK  (((1U << AUDIO_PEQ_05_QFMT_LEN) - 1) << AUDIO_PEQ_05_QFMT_POS)
#define AUDIO_PEQ_05_QFMT_UMSK (~(((1U << AUDIO_PEQ_05_QFMT_LEN) - 1) << AUDIO_PEQ_05_QFMT_POS))

/* 0x268 : peq_05_b1 */
#define AUDIO_PEQ_05_B1_OFFSET (0x268)
#define AUDIO_PEQ_05_B1        AUDIO_PEQ_05_B1
#define AUDIO_PEQ_05_B1_POS    (0U)
#define AUDIO_PEQ_05_B1_LEN    (20U)
#define AUDIO_PEQ_05_B1_MSK    (((1U << AUDIO_PEQ_05_B1_LEN) - 1) << AUDIO_PEQ_05_B1_POS)
#define AUDIO_PEQ_05_B1_UMSK   (~(((1U << AUDIO_PEQ_05_B1_LEN) - 1) << AUDIO_PEQ_05_B1_POS))

/* 0x26C : peq_05_b2 */
#define AUDIO_PEQ_05_B2_OFFSET (0x26C)
#define AUDIO_PEQ_05_B2        AUDIO_PEQ_05_B2
#define AUDIO_PEQ_05_B2_POS    (0U)
#define AUDIO_PEQ_05_B2_LEN    (20U)
#define AUDIO_PEQ_05_B2_MSK    (((1U << AUDIO_PEQ_05_B2_LEN) - 1) << AUDIO_PEQ_05_B2_POS)
#define AUDIO_PEQ_05_B2_UMSK   (~(((1U << AUDIO_PEQ_05_B2_LEN) - 1) << AUDIO_PEQ_05_B2_POS))

/* 0x270 : peq_05_a1 */
#define AUDIO_PEQ_05_A1_OFFSET (0x270)
#define AUDIO_PEQ_05_A1        AUDIO_PEQ_05_A1
#define AUDIO_PEQ_05_A1_POS    (0U)
#define AUDIO_PEQ_05_A1_LEN    (20U)
#define AUDIO_PEQ_05_A1_MSK    (((1U << AUDIO_PEQ_05_A1_LEN) - 1) << AUDIO_PEQ_05_A1_POS)
#define AUDIO_PEQ_05_A1_UMSK   (~(((1U << AUDIO_PEQ_05_A1_LEN) - 1) << AUDIO_PEQ_05_A1_POS))

/* 0x274 : peq_05_a2 */
#define AUDIO_PEQ_05_A2_OFFSET (0x274)
#define AUDIO_PEQ_05_A2        AUDIO_PEQ_05_A2
#define AUDIO_PEQ_05_A2_POS    (0U)
#define AUDIO_PEQ_05_A2_LEN    (20U)
#define AUDIO_PEQ_05_A2_MSK    (((1U << AUDIO_PEQ_05_A2_LEN) - 1) << AUDIO_PEQ_05_A2_POS)
#define AUDIO_PEQ_05_A2_UMSK   (~(((1U << AUDIO_PEQ_05_A2_LEN) - 1) << AUDIO_PEQ_05_A2_POS))

