XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x2C8 : peq_10_b0 */
#define AUDIO_PEQ_10_B0_OFFSET (0x2C8)
#define AUDIO_PEQ_10_B0        AUDIO_PEQ_10_B0
#define AUDIO_PEQ_10_B0_POS    (0U)
#define AUDIO_PEQ_10_B0_LEN    (20U)
#define AUDIO_PEQ_10_B0_MSK    (((1U << AUDIO_PEQ_10_B0_LEN) - 1) << AUDIO_PEQ_10_B0_POS)
#define AUDIO_PEQ_10_B0_UMSK   (~(((1U << AUDIO_PEQ_10_B0_LEN) - 1) << AUDIO_PEQ_10_B0_POS))
#define AUDIO_PEQ_10_BYP       AUDIO_PEQ_10_BYP
#define AUDIO_PEQ_10_BYP_POS   (20U)
#define AUDIO_PEQ_10_BYP_LEN   (1U)
#define AUDIO_PEQ_10_BYP_MSK   (((1U << AUDIO_PEQ_10_BYP_LEN) - 1) << AUDIO_PEQ_10_BYP_POS)
#define AUDIO_PEQ_10_BYP_UMSK  (~(((1U << AUDIO_PEQ_10_BYP_LEN) - 1) << AUDIO_PEQ_10_BYP_POS))
#define AUDIO_PEQ_10_QFMT      AUDIO_PEQ_10_QFMT
#define AUDIO_PEQ_10_QFMT_POS  (21U)
#define AUDIO_PEQ_10_QFMT_LEN  (1U)
#define AUDIO_PEQ_10_QFMT_MSK  (((1U << AUDIO_PEQ_10_QFMT_LEN) - 1) << AUDIO_PEQ_10_QFMT_POS)
#define AUDIO_PEQ_10_QFMT_UMSK (~(((1U << AUDIO_PEQ_10_QFMT_LEN) - 1) << AUDIO_PEQ_10_QFMT_POS))

/* 0x2CC : peq_10_b1 */
#define AUDIO_PEQ_10_B1_OFFSET (0x2CC)
#define AUDIO_PEQ_10_B1        AUDIO_PEQ_10_B1
#define AUDIO_PEQ_10_B1_POS    (0U)
#define AUDIO_PEQ_10_B1_LEN    (20U)
#define AUDIO_PEQ_10_B1_MSK    (((1U << AUDIO_PEQ_10_B1_LEN) - 1) << AUDIO_PEQ_10_B1_POS)
#define AUDIO_PEQ_10_B1_UMSK   (~(((1U << AUDIO_PEQ_10_B1_LEN) - 1) << AUDIO_PEQ_10_B1_POS))

/* 0x2D0 : peq_10_b2 */
#define AUDIO_PEQ_10_B2_OFFSET (0x2D0)
#define AUDIO_PEQ_10_B2        AUDIO_PEQ_10_B2
#define AUDIO_PEQ_10_B2_POS    (0U)
#define AUDIO_PEQ_10_B2_LEN    (20U)
#define AUDIO_PEQ_10_B2_MSK    (((1U << AUDIO_PEQ_10_B2_LEN) - 1) << AUDIO_PEQ_10_B2_POS)
#define AUDIO_PEQ_10_B2_UMSK   (~(((1U << AUDIO_PEQ_10_B2_LEN) - 1) << AUDIO_PEQ_10_B2_POS))

/* 0x2D4 : peq_10_a1 */
#define AUDIO_PEQ_10_A1_OFFSET (0x2D4)
#define AUDIO_PEQ_10_A1        AUDIO_PEQ_10_A1
#define AUDIO_PEQ_10_A1_POS    (0U)
#define AUDIO_PEQ_10_A1_LEN    (20U)
#define AUDIO_PEQ_10_A1_MSK    (((1U << AUDIO_PEQ_10_A1_LEN) - 1) << AUDIO_PEQ_10_A1_POS)
#define AUDIO_PEQ_10_A1_UMSK   (~(((1U << AUDIO_PEQ_10_A1_LEN) - 1) << AUDIO_PEQ_10_A1_POS))

/* 0x2D8 : peq_10_a2 */
#define AUDIO_PEQ_10_A2_OFFSET (0x2D8)
#define AUDIO_PEQ_10_A2        AUDIO_PEQ_10_A2
#define AUDIO_PEQ_10_A2_POS    (0U)
#define AUDIO_PEQ_10_A2_LEN    (20U)
#define AUDIO_PEQ_10_A2_MSK    (((1U << AUDIO_PEQ_10_A2_LEN) - 1) << AUDIO_PEQ_10_A2_POS)
#define AUDIO_PEQ_10_A2_UMSK   (~(((1U << AUDIO_PEQ_10_A2_LEN) - 1) << AUDIO_PEQ_10_A2_POS))

/* 0x2DC : peq_11_b0 */
#define AUDIO_PEQ_11_B0_OFFSET (0x2DC)
#define AUDIO_PEQ_11_B0        AUDIO_PEQ_11_B0
#define AUDIO_PEQ_11_B0_POS    (0U)
#define AUDIO_PEQ_11_B0_LEN    (20U)
#define AUDIO_PEQ_11_B0_MSK    (((1U << AUDIO_PEQ_11_B0_LEN) - 1) << AUDIO_PEQ_11_B0_POS)
#define AUDIO_PEQ_11_B0_UMSK   (~(((1U << AUDIO_PEQ_11_B0_LEN) - 1) << AUDIO_PEQ_11_B0_POS))
#define AUDIO_PEQ_11_BYP       AUDIO_PEQ_11_BYP
#define AUDIO_PEQ_11_BYP_POS   (20U)
#define AUDIO_PEQ_11_BYP_LEN   (1U)
#define AUDIO_PEQ_11_BYP_MSK   (((1U << AUDIO_PEQ_11_BYP_LEN) - 1) << AUDIO_PEQ_11_BYP_POS)
#define AUDIO_PEQ_11_BYP_UMSK  (~(((1U << AUDIO_PEQ_11_BYP_LEN) - 1) << AUDIO_PEQ_11_BYP_POS))
#define AUDIO_PEQ_11_QFMT      AUDIO_PEQ_11_QFMT
#define AUDIO_PEQ_11_QFMT_POS  (21U)
#define AUDIO_PEQ_11_QFMT_LEN  (1U)
#define AUDIO_PEQ_11_QFMT_MSK  (((1U << AUDIO_PEQ_11_QFMT_LEN) - 1) << AUDIO_PEQ_11_QFMT_POS)
#define AUDIO_PEQ_11_QFMT_UMSK (~(((1U << AUDIO_PEQ_11_QFMT_LEN) - 1) << AUDIO_PEQ_11_QFMT_POS))

/* 0x2E0 : peq_11_b1 */
#define AUDIO_PEQ_11_B1_OFFSET (0x2E0)
#define AUDIO_PEQ_11_B1        AUDIO_PEQ_11_B1
#define AUDIO_PEQ_11_B1_POS    (0U)
#define AUDIO_PEQ_11_B1_LEN    (20U)
#define AUDIO_PEQ_11_B1_MSK    (((1U << AUDIO_PEQ_11_B1_LEN) - 1) << AUDIO_PEQ_11_B1_POS)
#define AUDIO_PEQ_11_B1_UMSK   (~(((1U << AUDIO_PEQ_11_B1_LEN) - 1) << AUDIO_PEQ_11_B1_POS))

/* 0x2E4 : peq_11_b2 */
#define AUDIO_PEQ_11_B2_OFFSET (0x2E4)
#define AUDIO_PEQ_11_B2        AUDIO_PEQ_11_B2
#define AUDIO_PEQ_11_B2_POS    (0U)
#define AUDIO_PEQ_11_B2_LEN    (20U)
#define AUDIO_PEQ_11_B2_MSK    (((1U << AUDIO_PEQ_11_B2_LEN) - 1) << AUDIO_PEQ_11_B2_POS)
#define AUDIO_PEQ_11_B2_UMSK   (~(((1U << AUDIO_PEQ_11_B2_LEN) - 1) << AUDIO_PEQ_11_B2_POS))

/* 0x2E8 : peq_11_a1 */
#define AUDIO_PEQ_11_A1_OFFSET (0x2E8)
#define AUDIO_PEQ_11_A1        AUDIO_PEQ_11_A1
#define AUDIO_PEQ_11_A1_POS    (0U)
#define AUDIO_PEQ_11_A1_LEN    (20U)
#define AUDIO_PEQ_11_A1_MSK    (((1U << AUDIO_PEQ_11_A1_LEN) - 1) << AUDIO_PEQ_11_A1_POS)
#define AUDIO_PEQ_11_A1_UMSK   (~(((1U << AUDIO_PEQ_11_A1_LEN) - 1) << AUDIO_PEQ_11_A1_POS))

/* 0x2EC : peq_11_a2 */
#define AUDIO_PEQ_11_A2_OFFSET (0x2EC)
#define AUDIO_PEQ_11_A2        AUDIO_PEQ_11_A2
#define AUDIO_PEQ_11_A2_POS    (0U)
#define AUDIO_PEQ_11_A2_LEN    (20U)
#define AUDIO_PEQ_11_A2_MSK    (((1U << AUDIO_PEQ_11_A2_LEN) - 1) << AUDIO_PEQ_11_A2_POS)
#define AUDIO_PEQ_11_A2_UMSK   (~(((1U << AUDIO_PEQ_11_A2_LEN) - 1) << AUDIO_PEQ_11_A2_POS))

/* 0x2F0 : peq_12_b0 */
#define AUDIO_PEQ_12_B0_OFFSET (0x2F0)
#define AUDIO_PEQ_12_B0        AUDIO_PEQ_12_B0
#define AUDIO_PEQ_12_B0_POS    (0U)
#define AUDIO_PEQ_12_B0_LEN    (20U)
#define AUDIO_PEQ_12_B0_MSK    (((1U << AUDIO_PEQ_12_B0_LEN) - 1) << AUDIO_PEQ_12_B0_POS)
#define AUDIO_PEQ_12_B0_UMSK   (~(((1U << AUDIO_PEQ_12_B0_LEN) - 1) << AUDIO_PEQ_12_B0_POS))
#define AUDIO_PEQ_12_BYP       AUDIO_PEQ_12_BYP
#define AUDIO_PEQ_12_BYP_POS   (20U)
#define AUDIO_PEQ_12_BYP_LEN   (1U)
#define AUDIO_PEQ_12_BYP_MSK   (((1U << AUDIO_PEQ_12_BYP_LEN) - 1) << AUDIO_PEQ_12_BYP_POS)
#define AUDIO_PEQ_12_BYP_UMSK  (~(((1U << AUDIO_PEQ_12_BYP_LEN) - 1) << AUDIO_PEQ_12_BYP_POS))
#define AUDIO_PEQ_12_QFMT      AUDIO_PEQ_12_QFMT
#define AUDIO_PEQ_12_QFMT_POS  (21U)
#define AUDIO_PEQ_12_QFMT_LEN  (1U)
#define AUDIO_PEQ_12_QFMT_MSK  (((1U << AUDIO_PEQ_12_QFMT_LEN) - 1) << AUDIO_PEQ_12_QFMT_POS)
#define AUDIO_PEQ_12_QFMT_UMSK (~(((1U << AUDIO_PEQ_12_QFMT_LEN) - 1) << AUDIO_PEQ_12_QFMT_POS))

