XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x2F4 : peq_12_b1 */
#define AUDIO_PEQ_12_B1_OFFSET (0x2F4)
#define AUDIO_PEQ_12_B1        AUDIO_PEQ_12_B1
#define AUDIO_PEQ_12_B1_POS    (0U)
#define AUDIO_PEQ_12_B1_LEN    (20U)
#define AUDIO_PEQ_12_B1_MSK    (((1U << AUDIO_PEQ_12_B1_LEN) - 1) << AUDIO_PEQ_12_B1_POS)
#define AUDIO_PEQ_12_B1_UMSK   (~(((1U << AUDIO_PEQ_12_B1_LEN) - 1) << AUDIO_PEQ_12_B1_POS))

/* 0x2F8 : peq_12_b2 */
#define AUDIO_PEQ_12_B2_OFFSET (0x2F8)
#define AUDIO_PEQ_12_B2        AUDIO_PEQ_12_B2
#define AUDIO_PEQ_12_B2_POS    (0U)
#define AUDIO_PEQ_12_B2_LEN    (20U)
#define AUDIO_PEQ_12_B2_MSK    (((1U << AUDIO_PEQ_12_B2_LEN) - 1) << AUDIO_PEQ_12_B2_POS)
#define AUDIO_PEQ_12_B2_UMSK   (~(((1U << AUDIO_PEQ_12_B2_LEN) - 1) << AUDIO_PEQ_12_B2_POS))

/* 0x2FC : peq_12_a1 */
#define AUDIO_PEQ_12_A1_OFFSET (0x2FC)
#define AUDIO_PEQ_12_A1        AUDIO_PEQ_12_A1
#define AUDIO_PEQ_12_A1_POS    (0U)
#define AUDIO_PEQ_12_A1_LEN    (20U)
#define AUDIO_PEQ_12_A1_MSK    (((1U << AUDIO_PEQ_12_A1_LEN) - 1) << AUDIO_PEQ_12_A1_POS)
#define AUDIO_PEQ_12_A1_UMSK   (~(((1U << AUDIO_PEQ_12_A1_LEN) - 1) << AUDIO_PEQ_12_A1_POS))

/* 0x300 : peq_12_a2 */
#define AUDIO_PEQ_12_A2_OFFSET (0x300)
#define AUDIO_PEQ_12_A2        AUDIO_PEQ_12_A2
#define AUDIO_PEQ_12_A2_POS    (0U)
#define AUDIO_PEQ_12_A2_LEN    (20U)
#define AUDIO_PEQ_12_A2_MSK    (((1U << AUDIO_PEQ_12_A2_LEN) - 1) << AUDIO_PEQ_12_A2_POS)
#define AUDIO_PEQ_12_A2_UMSK   (~(((1U << AUDIO_PEQ_12_A2_LEN) - 1) << AUDIO_PEQ_12_A2_POS))

/* 0x304 : peq_13_b0 */
#define AUDIO_PEQ_13_B0_OFFSET (0x304)
#define AUDIO_PEQ_13_B0        AUDIO_PEQ_13_B0
#define AUDIO_PEQ_13_B0_POS    (0U)
#define AUDIO_PEQ_13_B0_LEN    (20U)
#define AUDIO_PEQ_13_B0_MSK    (((1U << AUDIO_PEQ_13_B0_LEN) - 1) << AUDIO_PEQ_13_B0_POS)
#define AUDIO_PEQ_13_B0_UMSK   (~(((1U << AUDIO_PEQ_13_B0_LEN) - 1) << AUDIO_PEQ_13_B0_POS))
#define AUDIO_PEQ_13_BYP       AUDIO_PEQ_13_BYP
#define AUDIO_PEQ_13_BYP_POS   (20U)
#define AUDIO_PEQ_13_BYP_LEN   (1U)
#define AUDIO_PEQ_13_BYP_MSK   (((1U << AUDIO_PEQ_13_BYP_LEN) - 1) << AUDIO_PEQ_13_BYP_POS)
#define AUDIO_PEQ_13_BYP_UMSK  (~(((1U << AUDIO_PEQ_13_BYP_LEN) - 1) << AUDIO_PEQ_13_BYP_POS))
#define AUDIO_PEQ_13_QFMT      AUDIO_PEQ_13_QFMT
#define AUDIO_PEQ_13_QFMT_POS  (21U)
#define AUDIO_PEQ_13_QFMT_LEN  (1U)
#define AUDIO_PEQ_13_QFMT_MSK  (((1U << AUDIO_PEQ_13_QFMT_LEN) - 1) << AUDIO_PEQ_13_QFMT_POS)
#define AUDIO_PEQ_13_QFMT_UMSK (~(((1U << AUDIO_PEQ_13_QFMT_LEN) - 1) << AUDIO_PEQ_13_QFMT_POS))

/* 0x308 : peq_13_b1 */
#define AUDIO_PEQ_13_B1_OFFSET (0x308)
#define AUDIO_PEQ_13_B1        AUDIO_PEQ_13_B1
#define AUDIO_PEQ_13_B1_POS    (0U)
#define AUDIO_PEQ_13_B1_LEN    (20U)
#define AUDIO_PEQ_13_B1_MSK    (((1U << AUDIO_PEQ_13_B1_LEN) - 1) << AUDIO_PEQ_13_B1_POS)
#define AUDIO_PEQ_13_B1_UMSK   (~(((1U << AUDIO_PEQ_13_B1_LEN) - 1) << AUDIO_PEQ_13_B1_POS))

/* 0x30C : peq_13_b2 */
#define AUDIO_PEQ_13_B2_OFFSET (0x30C)
#define AUDIO_PEQ_13_B2        AUDIO_PEQ_13_B2
#define AUDIO_PEQ_13_B2_POS    (0U)
#define AUDIO_PEQ_13_B2_LEN    (20U)
#define AUDIO_PEQ_13_B2_MSK    (((1U << AUDIO_PEQ_13_B2_LEN) - 1) << AUDIO_PEQ_13_B2_POS)
#define AUDIO_PEQ_13_B2_UMSK   (~(((1U << AUDIO_PEQ_13_B2_LEN) - 1) << AUDIO_PEQ_13_B2_POS))

/* 0x310 : peq_13_a1 */
#define AUDIO_PEQ_13_A1_OFFSET (0x310)
#define AUDIO_PEQ_13_A1        AUDIO_PEQ_13_A1
#define AUDIO_PEQ_13_A1_POS    (0U)
#define AUDIO_PEQ_13_A1_LEN    (20U)
#define AUDIO_PEQ_13_A1_MSK    (((1U << AUDIO_PEQ_13_A1_LEN) - 1) << AUDIO_PEQ_13_A1_POS)
#define AUDIO_PEQ_13_A1_UMSK   (~(((1U << AUDIO_PEQ_13_A1_LEN) - 1) << AUDIO_PEQ_13_A1_POS))

/* 0x314 : peq_13_a2 */
#define AUDIO_PEQ_13_A2_OFFSET (0x314)
#define AUDIO_PEQ_13_A2        AUDIO_PEQ_13_A2
#define AUDIO_PEQ_13_A2_POS    (0U)
#define AUDIO_PEQ_13_A2_LEN    (20U)
#define AUDIO_PEQ_13_A2_MSK    (((1U << AUDIO_PEQ_13_A2_LEN) - 1) << AUDIO_PEQ_13_A2_POS)
#define AUDIO_PEQ_13_A2_UMSK   (~(((1U << AUDIO_PEQ_13_A2_LEN) - 1) << AUDIO_PEQ_13_A2_POS))

/* 0x318 : peq_14_b0 */
#define AUDIO_PEQ_14_B0_OFFSET (0x318)
#define AUDIO_PEQ_14_B0        AUDIO_PEQ_14_B0
#define AUDIO_PEQ_14_B0_POS    (0U)
#define AUDIO_PEQ_14_B0_LEN    (20U)
#define AUDIO_PEQ_14_B0_MSK    (((1U << AUDIO_PEQ_14_B0_LEN) - 1) << AUDIO_PEQ_14_B0_POS)
#define AUDIO_PEQ_14_B0_UMSK   (~(((1U << AUDIO_PEQ_14_B0_LEN) - 1) << AUDIO_PEQ_14_B0_POS))
#define AUDIO_PEQ_14_BYP       AUDIO_PEQ_14_BYP
#define AUDIO_PEQ_14_BYP_POS   (20U)
#define AUDIO_PEQ_14_BYP_LEN   (1U)
#define AUDIO_PEQ_14_BYP_MSK   (((1U << AUDIO_PEQ_14_BYP_LEN) - 1) << AUDIO_PEQ_14_BYP_POS)
#define AUDIO_PEQ_14_BYP_UMSK  (~(((1U << AUDIO_PEQ_14_BYP_LEN) - 1) << AUDIO_PEQ_14_BYP_POS))
#define AUDIO_PEQ_14_QFMT      AUDIO_PEQ_14_QFMT
#define AUDIO_PEQ_14_QFMT_POS  (21U)
#define AUDIO_PEQ_14_QFMT_LEN  (1U)
#define AUDIO_PEQ_14_QFMT_MSK  (((1U << AUDIO_PEQ_14_QFMT_LEN) - 1) << AUDIO_PEQ_14_QFMT_POS)
#define AUDIO_PEQ_14_QFMT_UMSK (~(((1U << AUDIO_PEQ_14_QFMT_LEN) - 1) << AUDIO_PEQ_14_QFMT_POS))

/* 0x31C : peq_14_b1 */
#define AUDIO_PEQ_14_B1_OFFSET (0x31C)
#define AUDIO_PEQ_14_B1        AUDIO_PEQ_14_B1
#define AUDIO_PEQ_14_B1_POS    (0U)
#define AUDIO_PEQ_14_B1_LEN    (20U)
#define AUDIO_PEQ_14_B1_MSK    (((1U << AUDIO_PEQ_14_B1_LEN) - 1) << AUDIO_PEQ_14_B1_POS)
#define AUDIO_PEQ_14_B1_UMSK   (~(((1U << AUDIO_PEQ_14_B1_LEN) - 1) << AUDIO_PEQ_14_B1_POS))

/* 0x320 : peq_14_b2 */
#define AUDIO_PEQ_14_B2_OFFSET (0x320)
#define AUDIO_PEQ_14_B2        AUDIO_PEQ_14_B2
#define AUDIO_PEQ_14_B2_POS    (0U)
#define AUDIO_PEQ_14_B2_LEN    (20U)
#define AUDIO_PEQ_14_B2_MSK    (((1U << AUDIO_PEQ_14_B2_LEN) - 1) << AUDIO_PEQ_14_B2_POS)
#define AUDIO_PEQ_14_B2_UMSK   (~(((1U << AUDIO_PEQ_14_B2_LEN) - 1) << AUDIO_PEQ_14_B2_POS))

/* 0x324 : peq_14_a1 */
#define AUDIO_PEQ_14_A1_OFFSET (0x324)
#define AUDIO_PEQ_14_A1        AUDIO_PEQ_14_A1
#define AUDIO_PEQ_14_A1_POS    (0U)
#define AUDIO_PEQ_14_A1_LEN    (20U)
#define AUDIO_PEQ_14_A1_MSK    (((1U << AUDIO_PEQ_14_A1_LEN) - 1) << AUDIO_PEQ_14_A1_POS)
#define AUDIO_PEQ_14_A1_UMSK   (~(((1U << AUDIO_PEQ_14_A1_LEN) - 1) << AUDIO_PEQ_14_A1_POS))

/* 0x328 : peq_14_a2 */
#define AUDIO_PEQ_14_A2_OFFSET (0x328)
#define AUDIO_PEQ_14_A2        AUDIO_PEQ_14_A2
#define AUDIO_PEQ_14_A2_POS    (0U)
#define AUDIO_PEQ_14_A2_LEN    (20U)
#define AUDIO_PEQ_14_A2_MSK    (((1U << AUDIO_PEQ_14_A2_LEN) - 1) << AUDIO_PEQ_14_A2_POS)
#define AUDIO_PEQ_14_A2_UMSK   (~(((1U << AUDIO_PEQ_14_A2_LEN) - 1) << AUDIO_PEQ_14_A2_POS))

/* 0x32C : peq_15_b0 */
#define AUDIO_PEQ_15_B0_OFFSET (0x32C)
#define AUDIO_PEQ_15_B0        AUDIO_PEQ_15_B0
#define AUDIO_PEQ_15_B0_POS    (0U)
#define AUDIO_PEQ_15_B0_LEN    (20U)
#define AUDIO_PEQ_15_B0_MSK    (((1U << AUDIO_PEQ_15_B0_LEN) - 1) << AUDIO_PEQ_15_B0_POS)
#define AUDIO_PEQ_15_B0_UMSK   (~(((1U << AUDIO_PEQ_15_B0_LEN) - 1) << AUDIO_PEQ_15_B0_POS))
#define AUDIO_PEQ_15_BYP       AUDIO_PEQ_15_BYP
#define AUDIO_PEQ_15_BYP_POS   (20U)
#define AUDIO_PEQ_15_BYP_LEN   (1U)
#define AUDIO_PEQ_15_BYP_MSK   (((1U << AUDIO_PEQ_15_BYP_LEN) - 1) << AUDIO_PEQ_15_BYP_POS)
#define AUDIO_PEQ_15_BYP_UMSK  (~(((1U << AUDIO_PEQ_15_BYP_LEN) - 1) << AUDIO_PEQ_15_BYP_POS))
#define AUDIO_PEQ_15_QFMT      AUDIO_PEQ_15_QFMT
#define AUDIO_PEQ_15_QFMT_POS  (21U)
#define AUDIO_PEQ_15_QFMT_LEN  (1U)
#define AUDIO_PEQ_15_QFMT_MSK  (((1U << AUDIO_PEQ_15_QFMT_LEN) - 1) << AUDIO_PEQ_15_QFMT_POS)
#define AUDIO_PEQ_15_QFMT_UMSK (~(((1U << AUDIO_PEQ_15_QFMT_LEN) - 1) << AUDIO_PEQ_15_QFMT_POS))

/* 0x330 : peq_15_b1 */
#define AUDIO_PEQ_15_B1_OFFSET (0x330)
#define AUDIO_PEQ_15_B1        AUDIO_PEQ_15_B1
#define AUDIO_PEQ_15_B1_POS    (0U)
#define AUDIO_PEQ_15_B1_LEN    (20U)
#define AUDIO_PEQ_15_B1_MSK    (((1U << AUDIO_PEQ_15_B1_LEN) - 1) << AUDIO_PEQ_15_B1_POS)
#define AUDIO_PEQ_15_B1_UMSK   (~(((1U << AUDIO_PEQ_15_B1_LEN) - 1) << AUDIO_PEQ_15_B1_POS))

/* 0x334 : peq_15_b2 */
#define AUDIO_PEQ_15_B2_OFFSET (0x334)
#define AUDIO_PEQ_15_B2        AUDIO_PEQ_15_B2
#define AUDIO_PEQ_15_B2_POS    (0U)
#define AUDIO_PEQ_15_B2_LEN    (20U)
#define AUDIO_PEQ_15_B2_MSK    (((1U << AUDIO_PEQ_15_B2_LEN) - 1) << AUDIO_PEQ_15_B2_POS)
#define AUDIO_PEQ_15_B2_UMSK   (~(((1U << AUDIO_PEQ_15_B2_LEN) - 1) << AUDIO_PEQ_15_B2_POS))

