XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x40C : adc_s0_misc */
#define AUDIO_ADC_S0_MISC_OFFSET           (0x40C)
#define AUDIO_ADC_S012_VOLUME_UPDATE       AUDIO_ADC_S012_VOLUME_UPDATE
#define AUDIO_ADC_S012_VOLUME_UPDATE_POS   (0U)
#define AUDIO_ADC_S012_VOLUME_UPDATE_LEN   (1U)
#define AUDIO_ADC_S012_VOLUME_UPDATE_MSK   (((1U << AUDIO_ADC_S012_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S012_VOLUME_UPDATE_POS)
#define AUDIO_ADC_S012_VOLUME_UPDATE_UMSK  (~(((1U << AUDIO_ADC_S012_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S012_VOLUME_UPDATE_POS))
#define AUDIO_ADC_S012_MUTE                AUDIO_ADC_S012_MUTE
#define AUDIO_ADC_S012_MUTE_POS            (1U)
#define AUDIO_ADC_S012_MUTE_LEN            (1U)
#define AUDIO_ADC_S012_MUTE_MSK            (((1U << AUDIO_ADC_S012_MUTE_LEN) - 1) << AUDIO_ADC_S012_MUTE_POS)
#define AUDIO_ADC_S012_MUTE_UMSK           (~(((1U << AUDIO_ADC_S012_MUTE_LEN) - 1) << AUDIO_ADC_S012_MUTE_POS))
#define AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT      AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT
#define AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_POS  (28U)
#define AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_LEN  (4U)
#define AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_MSK  (((1U << AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_POS)
#define AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_UMSK (~(((1U << AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT_POS))

/* 0x410 : adc_s1 */
#define AUDIO_ADC_S1_OFFSET               (0x410)
#define AUDIO_ADC_S1_CTRL_RMP_RATE        AUDIO_ADC_S1_CTRL_RMP_RATE
#define AUDIO_ADC_S1_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_ADC_S1_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_ADC_S1_CTRL_RMP_RATE_MSK    (((1U << AUDIO_ADC_S1_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S1_CTRL_RMP_RATE_POS)
#define AUDIO_ADC_S1_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_ADC_S1_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S1_CTRL_RMP_RATE_POS))
#define AUDIO_ADC_S1_CTRL_ZCD_RATE        AUDIO_ADC_S1_CTRL_ZCD_RATE
#define AUDIO_ADC_S1_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_ADC_S1_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_ADC_S1_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_ADC_S1_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S1_CTRL_ZCD_RATE_POS)
#define AUDIO_ADC_S1_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_ADC_S1_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S1_CTRL_ZCD_RATE_POS))
#define AUDIO_ADC_S1_CTRL_MODE            AUDIO_ADC_S1_CTRL_MODE
#define AUDIO_ADC_S1_CTRL_MODE_POS        (10U)
#define AUDIO_ADC_S1_CTRL_MODE_LEN        (2U)
#define AUDIO_ADC_S1_CTRL_MODE_MSK        (((1U << AUDIO_ADC_S1_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S1_CTRL_MODE_POS)
#define AUDIO_ADC_S1_CTRL_MODE_UMSK       (~(((1U << AUDIO_ADC_S1_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S1_CTRL_MODE_POS))
#define AUDIO_ADC_S1_VOLUME_UPDATE        AUDIO_ADC_S1_VOLUME_UPDATE
#define AUDIO_ADC_S1_VOLUME_UPDATE_POS    (12U)
#define AUDIO_ADC_S1_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_ADC_S1_VOLUME_UPDATE_MSK    (((1U << AUDIO_ADC_S1_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S1_VOLUME_UPDATE_POS)
#define AUDIO_ADC_S1_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_ADC_S1_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S1_VOLUME_UPDATE_POS))
#define AUDIO_ADC_S1_VOLUME               AUDIO_ADC_S1_VOLUME
#define AUDIO_ADC_S1_VOLUME_POS           (13U)
#define AUDIO_ADC_S1_VOLUME_LEN           (9U)
#define AUDIO_ADC_S1_VOLUME_MSK           (((1U << AUDIO_ADC_S1_VOLUME_LEN) - 1) << AUDIO_ADC_S1_VOLUME_POS)
#define AUDIO_ADC_S1_VOLUME_UMSK          (~(((1U << AUDIO_ADC_S1_VOLUME_LEN) - 1) << AUDIO_ADC_S1_VOLUME_POS))
#define AUDIO_ADC_S1_MUTE_RMPUP_RATE      AUDIO_ADC_S1_MUTE_RMPUP_RATE
#define AUDIO_ADC_S1_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_ADC_S1_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_ADC_S1_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_ADC_S1_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S1_MUTE_RMPUP_RATE_POS)
#define AUDIO_ADC_S1_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_ADC_S1_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S1_MUTE_RMPUP_RATE_POS))
#define AUDIO_ADC_S1_MUTE_RMPDN_RATE      AUDIO_ADC_S1_MUTE_RMPDN_RATE
#define AUDIO_ADC_S1_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_ADC_S1_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_ADC_S1_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_ADC_S1_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S1_MUTE_RMPDN_RATE_POS)
#define AUDIO_ADC_S1_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_ADC_S1_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S1_MUTE_RMPDN_RATE_POS))
#define AUDIO_ADC_S1_MUTE_SOFTMODE        AUDIO_ADC_S1_MUTE_SOFTMODE
#define AUDIO_ADC_S1_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_ADC_S1_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_ADC_S1_MUTE_SOFTMODE_MSK    (((1U << AUDIO_ADC_S1_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S1_MUTE_SOFTMODE_POS)
#define AUDIO_ADC_S1_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_ADC_S1_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S1_MUTE_SOFTMODE_POS))
#define AUDIO_ADC_S1_MUTE                 AUDIO_ADC_S1_MUTE
#define AUDIO_ADC_S1_MUTE_POS             (31U)
#define AUDIO_ADC_S1_MUTE_LEN             (1U)
#define AUDIO_ADC_S1_MUTE_MSK             (((1U << AUDIO_ADC_S1_MUTE_LEN) - 1) << AUDIO_ADC_S1_MUTE_POS)
#define AUDIO_ADC_S1_MUTE_UMSK            (~(((1U << AUDIO_ADC_S1_MUTE_LEN) - 1) << AUDIO_ADC_S1_MUTE_POS))

/* 0x414 : adc_s1_misc */
#define AUDIO_ADC_S1_MISC_OFFSET           (0x414)
#define AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT      AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT
#define AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_POS  (28U)
#define AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_LEN  (4U)
#define AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_MSK  (((1U << AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_POS)
#define AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_UMSK (~(((1U << AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S1_CTRL_ZCD_TIMEOUT_POS))

/* 0x418 : adc_s2 */
#define AUDIO_ADC_S2_OFFSET               (0x418)
#define AUDIO_ADC_S2_CTRL_RMP_RATE        AUDIO_ADC_S2_CTRL_RMP_RATE
#define AUDIO_ADC_S2_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_ADC_S2_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_ADC_S2_CTRL_RMP_RATE_MSK    (((1U << AUDIO_ADC_S2_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S2_CTRL_RMP_RATE_POS)
#define AUDIO_ADC_S2_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_ADC_S2_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S2_CTRL_RMP_RATE_POS))
#define AUDIO_ADC_S2_CTRL_ZCD_RATE        AUDIO_ADC_S2_CTRL_ZCD_RATE
#define AUDIO_ADC_S2_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_ADC_S2_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_ADC_S2_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_ADC_S2_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S2_CTRL_ZCD_RATE_POS)
#define AUDIO_ADC_S2_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_ADC_S2_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S2_CTRL_ZCD_RATE_POS))
#define AUDIO_ADC_S2_CTRL_MODE            AUDIO_ADC_S2_CTRL_MODE
#define AUDIO_ADC_S2_CTRL_MODE_POS        (10U)
#define AUDIO_ADC_S2_CTRL_MODE_LEN        (2U)
#define AUDIO_ADC_S2_CTRL_MODE_MSK        (((1U << AUDIO_ADC_S2_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S2_CTRL_MODE_POS)
#define AUDIO_ADC_S2_CTRL_MODE_UMSK       (~(((1U << AUDIO_ADC_S2_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S2_CTRL_MODE_POS))
#define AUDIO_ADC_S2_VOLUME_UPDATE        AUDIO_ADC_S2_VOLUME_UPDATE
#define AUDIO_ADC_S2_VOLUME_UPDATE_POS    (12U)
#define AUDIO_ADC_S2_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_ADC_S2_VOLUME_UPDATE_MSK    (((1U << AUDIO_ADC_S2_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S2_VOLUME_UPDATE_POS)
#define AUDIO_ADC_S2_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_ADC_S2_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S2_VOLUME_UPDATE_POS))
#define AUDIO_ADC_S2_VOLUME               AUDIO_ADC_S2_VOLUME
#define AUDIO_ADC_S2_VOLUME_POS           (13U)
#define AUDIO_ADC_S2_VOLUME_LEN           (9U)
#define AUDIO_ADC_S2_VOLUME_MSK           (((1U << AUDIO_ADC_S2_VOLUME_LEN) - 1) << AUDIO_ADC_S2_VOLUME_POS)
#define AUDIO_ADC_S2_VOLUME_UMSK          (~(((1U << AUDIO_ADC_S2_VOLUME_LEN) - 1) << AUDIO_ADC_S2_VOLUME_POS))
#define AUDIO_ADC_S2_MUTE_RMPUP_RATE      AUDIO_ADC_S2_MUTE_RMPUP_RATE
#define AUDIO_ADC_S2_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_ADC_S2_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_ADC_S2_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_ADC_S2_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S2_MUTE_RMPUP_RATE_POS)
#define AUDIO_ADC_S2_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_ADC_S2_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S2_MUTE_RMPUP_RATE_POS))
#define AUDIO_ADC_S2_MUTE_RMPDN_RATE      AUDIO_ADC_S2_MUTE_RMPDN_RATE
#define AUDIO_ADC_S2_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_ADC_S2_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_ADC_S2_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_ADC_S2_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S2_MUTE_RMPDN_RATE_POS)
#define AUDIO_ADC_S2_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_ADC_S2_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S2_MUTE_RMPDN_RATE_POS))
#define AUDIO_ADC_S2_MUTE_SOFTMODE        AUDIO_ADC_S2_MUTE_SOFTMODE
#define AUDIO_ADC_S2_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_ADC_S2_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_ADC_S2_MUTE_SOFTMODE_MSK    (((1U << AUDIO_ADC_S2_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S2_MUTE_SOFTMODE_POS)
#define AUDIO_ADC_S2_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_ADC_S2_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S2_MUTE_SOFTMODE_POS))
#define AUDIO_ADC_S2_MUTE                 AUDIO_ADC_S2_MUTE
#define AUDIO_ADC_S2_MUTE_POS             (31U)
#define AUDIO_ADC_S2_MUTE_LEN             (1U)
#define AUDIO_ADC_S2_MUTE_MSK             (((1U << AUDIO_ADC_S2_MUTE_LEN) - 1) << AUDIO_ADC_S2_MUTE_POS)
#define AUDIO_ADC_S2_MUTE_UMSK            (~(((1U << AUDIO_ADC_S2_MUTE_LEN) - 1) << AUDIO_ADC_S2_MUTE_POS))

/* 0x41C : adc_s2_misc */
#define AUDIO_ADC_S2_MISC_OFFSET           (0x41C)
#define AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT      AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT
#define AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_POS  (28U)
#define AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_LEN  (4U)
#define AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_MSK  (((1U << AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_POS)
#define AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_UMSK (~(((1U << AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_S2_CTRL_ZCD_TIMEOUT_POS))

/* 0x420 : adc_agc_0 */
#define AUDIO_ADC_AGC_0_OFFSET        (0x420)
#define AUDIO_ADC_AGC_EN              AUDIO_ADC_AGC_EN
#define AUDIO_ADC_AGC_EN_POS          (0U)
#define AUDIO_ADC_AGC_EN_LEN          (1U)
#define AUDIO_ADC_AGC_EN_MSK          (((1U << AUDIO_ADC_AGC_EN_LEN) - 1) << AUDIO_ADC_AGC_EN_POS)
#define AUDIO_ADC_AGC_EN_UMSK         (~(((1U << AUDIO_ADC_AGC_EN_LEN) - 1) << AUDIO_ADC_AGC_EN_POS))
#define AUDIO_AGC_MIN_GAIN_QDB        AUDIO_AGC_MIN_GAIN_QDB
#define AUDIO_AGC_MIN_GAIN_QDB_POS    (3U)
#define AUDIO_AGC_MIN_GAIN_QDB_LEN    (9U)
#define AUDIO_AGC_MIN_GAIN_QDB_MSK    (((1U << AUDIO_AGC_MIN_GAIN_QDB_LEN) - 1) << AUDIO_AGC_MIN_GAIN_QDB_POS)
#define AUDIO_AGC_MIN_GAIN_QDB_UMSK   (~(((1U << AUDIO_AGC_MIN_GAIN_QDB_LEN) - 1) << AUDIO_AGC_MIN_GAIN_QDB_POS))
#define AUDIO_AGC_MAX_GAIN_QDB        AUDIO_AGC_MAX_GAIN_QDB
#define AUDIO_AGC_MAX_GAIN_QDB_POS    (12U)
#define AUDIO_AGC_MAX_GAIN_QDB_LEN    (9U)
#define AUDIO_AGC_MAX_GAIN_QDB_MSK    (((1U << AUDIO_AGC_MAX_GAIN_QDB_LEN) - 1) << AUDIO_AGC_MAX_GAIN_QDB_POS)
#define AUDIO_AGC_MAX_GAIN_QDB_UMSK   (~(((1U << AUDIO_AGC_MAX_GAIN_QDB_LEN) - 1) << AUDIO_AGC_MAX_GAIN_QDB_POS))
#define AUDIO_AGC_FORCE_GAIN_IND      AUDIO_AGC_FORCE_GAIN_IND
#define AUDIO_AGC_FORCE_GAIN_IND_POS  (21U)
#define AUDIO_AGC_FORCE_GAIN_IND_LEN  (10U)
#define AUDIO_AGC_FORCE_GAIN_IND_MSK  (((1U << AUDIO_AGC_FORCE_GAIN_IND_LEN) - 1) << AUDIO_AGC_FORCE_GAIN_IND_POS)
#define AUDIO_AGC_FORCE_GAIN_IND_UMSK (~(((1U << AUDIO_AGC_FORCE_GAIN_IND_LEN) - 1) << AUDIO_AGC_FORCE_GAIN_IND_POS))
#define AUDIO_AGC_FORCE_GAIN_EN       AUDIO_AGC_FORCE_GAIN_EN
#define AUDIO_AGC_FORCE_GAIN_EN_POS   (31U)
#define AUDIO_AGC_FORCE_GAIN_EN_LEN   (1U)
#define AUDIO_AGC_FORCE_GAIN_EN_MSK   (((1U << AUDIO_AGC_FORCE_GAIN_EN_LEN) - 1) << AUDIO_AGC_FORCE_GAIN_EN_POS)
#define AUDIO_AGC_FORCE_GAIN_EN_UMSK  (~(((1U << AUDIO_AGC_FORCE_GAIN_EN_LEN) - 1) << AUDIO_AGC_FORCE_GAIN_EN_POS))

