XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x424 : adc_agc_1 */
#define AUDIO_ADC_AGC_1_OFFSET           (0x424)
#define AUDIO_ADC0_PGA_HW_CTRL           AUDIO_ADC0_PGA_HW_CTRL
#define AUDIO_ADC0_PGA_HW_CTRL_POS       (0U)
#define AUDIO_ADC0_PGA_HW_CTRL_LEN       (1U)
#define AUDIO_ADC0_PGA_HW_CTRL_MSK       (((1U << AUDIO_ADC0_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC0_PGA_HW_CTRL_POS)
#define AUDIO_ADC0_PGA_HW_CTRL_UMSK      (~(((1U << AUDIO_ADC0_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC0_PGA_HW_CTRL_POS))
#define AUDIO_ADC1_PGA_HW_CTRL           AUDIO_ADC1_PGA_HW_CTRL
#define AUDIO_ADC1_PGA_HW_CTRL_POS       (1U)
#define AUDIO_ADC1_PGA_HW_CTRL_LEN       (1U)
#define AUDIO_ADC1_PGA_HW_CTRL_MSK       (((1U << AUDIO_ADC1_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC1_PGA_HW_CTRL_POS)
#define AUDIO_ADC1_PGA_HW_CTRL_UMSK      (~(((1U << AUDIO_ADC1_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC1_PGA_HW_CTRL_POS))
#define AUDIO_ADC2_PGA_HW_CTRL           AUDIO_ADC2_PGA_HW_CTRL
#define AUDIO_ADC2_PGA_HW_CTRL_POS       (2U)
#define AUDIO_ADC2_PGA_HW_CTRL_LEN       (1U)
#define AUDIO_ADC2_PGA_HW_CTRL_MSK       (((1U << AUDIO_ADC2_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC2_PGA_HW_CTRL_POS)
#define AUDIO_ADC2_PGA_HW_CTRL_UMSK      (~(((1U << AUDIO_ADC2_PGA_HW_CTRL_LEN) - 1) << AUDIO_ADC2_PGA_HW_CTRL_POS))
#define AUDIO_AGC_ATTACK_TIME_MS         AUDIO_AGC_ATTACK_TIME_MS
#define AUDIO_AGC_ATTACK_TIME_MS_POS     (4U)
#define AUDIO_AGC_ATTACK_TIME_MS_LEN     (4U)
#define AUDIO_AGC_ATTACK_TIME_MS_MSK     (((1U << AUDIO_AGC_ATTACK_TIME_MS_LEN) - 1) << AUDIO_AGC_ATTACK_TIME_MS_POS)
#define AUDIO_AGC_ATTACK_TIME_MS_UMSK    (~(((1U << AUDIO_AGC_ATTACK_TIME_MS_LEN) - 1) << AUDIO_AGC_ATTACK_TIME_MS_POS))
#define AUDIO_AGC_DECAY_TIME_MS          AUDIO_AGC_DECAY_TIME_MS
#define AUDIO_AGC_DECAY_TIME_MS_POS      (8U)
#define AUDIO_AGC_DECAY_TIME_MS_LEN      (4U)
#define AUDIO_AGC_DECAY_TIME_MS_MSK      (((1U << AUDIO_AGC_DECAY_TIME_MS_LEN) - 1) << AUDIO_AGC_DECAY_TIME_MS_POS)
#define AUDIO_AGC_DECAY_TIME_MS_UMSK     (~(((1U << AUDIO_AGC_DECAY_TIME_MS_LEN) - 1) << AUDIO_AGC_DECAY_TIME_MS_POS))
#define AUDIO_AGC_HOLD_TIME_MS           AUDIO_AGC_HOLD_TIME_MS
#define AUDIO_AGC_HOLD_TIME_MS_POS       (12U)
#define AUDIO_AGC_HOLD_TIME_MS_LEN       (4U)
#define AUDIO_AGC_HOLD_TIME_MS_MSK       (((1U << AUDIO_AGC_HOLD_TIME_MS_LEN) - 1) << AUDIO_AGC_HOLD_TIME_MS_POS)
#define AUDIO_AGC_HOLD_TIME_MS_UMSK      (~(((1U << AUDIO_AGC_HOLD_TIME_MS_LEN) - 1) << AUDIO_AGC_HOLD_TIME_MS_POS))
#define AUDIO_AGC_LEVEL_HYST_DECAY       AUDIO_AGC_LEVEL_HYST_DECAY
#define AUDIO_AGC_LEVEL_HYST_DECAY_POS   (16U)
#define AUDIO_AGC_LEVEL_HYST_DECAY_LEN   (5U)
#define AUDIO_AGC_LEVEL_HYST_DECAY_MSK   (((1U << AUDIO_AGC_LEVEL_HYST_DECAY_LEN) - 1) << AUDIO_AGC_LEVEL_HYST_DECAY_POS)
#define AUDIO_AGC_LEVEL_HYST_DECAY_UMSK  (~(((1U << AUDIO_AGC_LEVEL_HYST_DECAY_LEN) - 1) << AUDIO_AGC_LEVEL_HYST_DECAY_POS))
#define AUDIO_AGC_LEVEL_HYST_ATTACK      AUDIO_AGC_LEVEL_HYST_ATTACK
#define AUDIO_AGC_LEVEL_HYST_ATTACK_POS  (21U)
#define AUDIO_AGC_LEVEL_HYST_ATTACK_LEN  (5U)
#define AUDIO_AGC_LEVEL_HYST_ATTACK_MSK  (((1U << AUDIO_AGC_LEVEL_HYST_ATTACK_LEN) - 1) << AUDIO_AGC_LEVEL_HYST_ATTACK_POS)
#define AUDIO_AGC_LEVEL_HYST_ATTACK_UMSK (~(((1U << AUDIO_AGC_LEVEL_HYST_ATTACK_LEN) - 1) << AUDIO_AGC_LEVEL_HYST_ATTACK_POS))
#define AUDIO_AGC_LEVEL_TARGET           AUDIO_AGC_LEVEL_TARGET
#define AUDIO_AGC_LEVEL_TARGET_POS       (26U)
#define AUDIO_AGC_LEVEL_TARGET_LEN       (6U)
#define AUDIO_AGC_LEVEL_TARGET_MSK       (((1U << AUDIO_AGC_LEVEL_TARGET_LEN) - 1) << AUDIO_AGC_LEVEL_TARGET_POS)
#define AUDIO_AGC_LEVEL_TARGET_UMSK      (~(((1U << AUDIO_AGC_LEVEL_TARGET_LEN) - 1) << AUDIO_AGC_LEVEL_TARGET_POS))

/* 0x428 : adc_agc_2 */
#define AUDIO_ADC_AGC_2_OFFSET              (0x428)
#define AUDIO_AGC_NOISE_ENTER_TIME_MS       AUDIO_AGC_NOISE_ENTER_TIME_MS
#define AUDIO_AGC_NOISE_ENTER_TIME_MS_POS   (0U)
#define AUDIO_AGC_NOISE_ENTER_TIME_MS_LEN   (7U)
#define AUDIO_AGC_NOISE_ENTER_TIME_MS_MSK   (((1U << AUDIO_AGC_NOISE_ENTER_TIME_MS_LEN) - 1) << AUDIO_AGC_NOISE_ENTER_TIME_MS_POS)
#define AUDIO_AGC_NOISE_ENTER_TIME_MS_UMSK  (~(((1U << AUDIO_AGC_NOISE_ENTER_TIME_MS_LEN) - 1) << AUDIO_AGC_NOISE_ENTER_TIME_MS_POS))
#define AUDIO_AGC_SILENCE_GAIN_WAIT_MS      AUDIO_AGC_SILENCE_GAIN_WAIT_MS
#define AUDIO_AGC_SILENCE_GAIN_WAIT_MS_POS  (7U)
#define AUDIO_AGC_SILENCE_GAIN_WAIT_MS_LEN  (4U)
#define AUDIO_AGC_SILENCE_GAIN_WAIT_MS_MSK  (((1U << AUDIO_AGC_SILENCE_GAIN_WAIT_MS_LEN) - 1) << AUDIO_AGC_SILENCE_GAIN_WAIT_MS_POS)
#define AUDIO_AGC_SILENCE_GAIN_WAIT_MS_UMSK (~(((1U << AUDIO_AGC_SILENCE_GAIN_WAIT_MS_LEN) - 1) << AUDIO_AGC_SILENCE_GAIN_WAIT_MS_POS))
#define AUDIO_AGC_SILENCE_GAIN_QDB          AUDIO_AGC_SILENCE_GAIN_QDB
#define AUDIO_AGC_SILENCE_GAIN_QDB_POS      (11U)
#define AUDIO_AGC_SILENCE_GAIN_QDB_LEN      (10U)
#define AUDIO_AGC_SILENCE_GAIN_QDB_MSK      (((1U << AUDIO_AGC_SILENCE_GAIN_QDB_LEN) - 1) << AUDIO_AGC_SILENCE_GAIN_QDB_POS)
#define AUDIO_AGC_SILENCE_GAIN_QDB_UMSK     (~(((1U << AUDIO_AGC_SILENCE_GAIN_QDB_LEN) - 1) << AUDIO_AGC_SILENCE_GAIN_QDB_POS))
#define AUDIO_AGC_NOISE_GATE_HYST           AUDIO_AGC_NOISE_GATE_HYST
#define AUDIO_AGC_NOISE_GATE_HYST_POS       (21U)
#define AUDIO_AGC_NOISE_GATE_HYST_LEN       (3U)
#define AUDIO_AGC_NOISE_GATE_HYST_MSK       (((1U << AUDIO_AGC_NOISE_GATE_HYST_LEN) - 1) << AUDIO_AGC_NOISE_GATE_HYST_POS)
#define AUDIO_AGC_NOISE_GATE_HYST_UMSK      (~(((1U << AUDIO_AGC_NOISE_GATE_HYST_LEN) - 1) << AUDIO_AGC_NOISE_GATE_HYST_POS))
#define AUDIO_AGC_NOISE_GATE_TH             AUDIO_AGC_NOISE_GATE_TH
#define AUDIO_AGC_NOISE_GATE_TH_POS         (24U)
#define AUDIO_AGC_NOISE_GATE_TH_LEN         (8U)
#define AUDIO_AGC_NOISE_GATE_TH_MSK         (((1U << AUDIO_AGC_NOISE_GATE_TH_LEN) - 1) << AUDIO_AGC_NOISE_GATE_TH_POS)
#define AUDIO_AGC_NOISE_GATE_TH_UMSK        (~(((1U << AUDIO_AGC_NOISE_GATE_TH_LEN) - 1) << AUDIO_AGC_NOISE_GATE_TH_POS))

/* 0x42C : adc_agc_3 */
#define AUDIO_ADC_AGC_3_OFFSET            (0x42C)
#define AUDIO_AGC_PGA_CTRL_EN             AUDIO_AGC_PGA_CTRL_EN
#define AUDIO_AGC_PGA_CTRL_EN_POS         (2U)
#define AUDIO_AGC_PGA_CTRL_EN_LEN         (1U)
#define AUDIO_AGC_PGA_CTRL_EN_MSK         (((1U << AUDIO_AGC_PGA_CTRL_EN_LEN) - 1) << AUDIO_AGC_PGA_CTRL_EN_POS)
#define AUDIO_AGC_PGA_CTRL_EN_UMSK        (~(((1U << AUDIO_AGC_PGA_CTRL_EN_LEN) - 1) << AUDIO_AGC_PGA_CTRL_EN_POS))
#define AUDIO_AGC_AVERAGE_TIME            AUDIO_AGC_AVERAGE_TIME
#define AUDIO_AGC_AVERAGE_TIME_POS        (3U)
#define AUDIO_AGC_AVERAGE_TIME_LEN        (5U)
#define AUDIO_AGC_AVERAGE_TIME_MSK        (((1U << AUDIO_AGC_AVERAGE_TIME_LEN) - 1) << AUDIO_AGC_AVERAGE_TIME_POS)
#define AUDIO_AGC_AVERAGE_TIME_UMSK       (~(((1U << AUDIO_AGC_AVERAGE_TIME_LEN) - 1) << AUDIO_AGC_AVERAGE_TIME_POS))
#define AUDIO_AGC_RELEASE_TIME            AUDIO_AGC_RELEASE_TIME
#define AUDIO_AGC_RELEASE_TIME_POS        (8U)
#define AUDIO_AGC_RELEASE_TIME_LEN        (5U)
#define AUDIO_AGC_RELEASE_TIME_MSK        (((1U << AUDIO_AGC_RELEASE_TIME_LEN) - 1) << AUDIO_AGC_RELEASE_TIME_POS)
#define AUDIO_AGC_RELEASE_TIME_UMSK       (~(((1U << AUDIO_AGC_RELEASE_TIME_LEN) - 1) << AUDIO_AGC_RELEASE_TIME_POS))
#define AUDIO_AGC_ATTACK_TIME             AUDIO_AGC_ATTACK_TIME
#define AUDIO_AGC_ATTACK_TIME_POS         (13U)
#define AUDIO_AGC_ATTACK_TIME_LEN         (5U)
#define AUDIO_AGC_ATTACK_TIME_MSK         (((1U << AUDIO_AGC_ATTACK_TIME_LEN) - 1) << AUDIO_AGC_ATTACK_TIME_POS)
#define AUDIO_AGC_ATTACK_TIME_UMSK        (~(((1U << AUDIO_AGC_ATTACK_TIME_LEN) - 1) << AUDIO_AGC_ATTACK_TIME_POS))
#define AUDIO_AGC_DETECT_MODE             AUDIO_AGC_DETECT_MODE
#define AUDIO_AGC_DETECT_MODE_POS         (18U)
#define AUDIO_AGC_DETECT_MODE_LEN         (1U)
#define AUDIO_AGC_DETECT_MODE_MSK         (((1U << AUDIO_AGC_DETECT_MODE_LEN) - 1) << AUDIO_AGC_DETECT_MODE_POS)
#define AUDIO_AGC_DETECT_MODE_UMSK        (~(((1U << AUDIO_AGC_DETECT_MODE_LEN) - 1) << AUDIO_AGC_DETECT_MODE_POS))
#define AUDIO_AGC_SRC_SELECT              AUDIO_AGC_SRC_SELECT
#define AUDIO_AGC_SRC_SELECT_POS          (19U)
#define AUDIO_AGC_SRC_SELECT_LEN          (2U)
#define AUDIO_AGC_SRC_SELECT_MSK          (((1U << AUDIO_AGC_SRC_SELECT_LEN) - 1) << AUDIO_AGC_SRC_SELECT_POS)
#define AUDIO_AGC_SRC_SELECT_UMSK         (~(((1U << AUDIO_AGC_SRC_SELECT_LEN) - 1) << AUDIO_AGC_SRC_SELECT_POS))
#define AUDIO_AGC_DBV_SETTLE_TIME         AUDIO_AGC_DBV_SETTLE_TIME
#define AUDIO_AGC_DBV_SETTLE_TIME_POS     (21U)
#define AUDIO_AGC_DBV_SETTLE_TIME_LEN     (4U)
#define AUDIO_AGC_DBV_SETTLE_TIME_MSK     (((1U << AUDIO_AGC_DBV_SETTLE_TIME_LEN) - 1) << AUDIO_AGC_DBV_SETTLE_TIME_POS)
#define AUDIO_AGC_DBV_SETTLE_TIME_UMSK    (~(((1U << AUDIO_AGC_DBV_SETTLE_TIME_LEN) - 1) << AUDIO_AGC_DBV_SETTLE_TIME_POS))
#define AUDIO_AGC_NOISE_EXIT_TIME_MS      AUDIO_AGC_NOISE_EXIT_TIME_MS
#define AUDIO_AGC_NOISE_EXIT_TIME_MS_POS  (25U)
#define AUDIO_AGC_NOISE_EXIT_TIME_MS_LEN  (7U)
#define AUDIO_AGC_NOISE_EXIT_TIME_MS_MSK  (((1U << AUDIO_AGC_NOISE_EXIT_TIME_MS_LEN) - 1) << AUDIO_AGC_NOISE_EXIT_TIME_MS_POS)
#define AUDIO_AGC_NOISE_EXIT_TIME_MS_UMSK (~(((1U << AUDIO_AGC_NOISE_EXIT_TIME_MS_LEN) - 1) << AUDIO_AGC_NOISE_EXIT_TIME_MS_POS))

/* 0x430 : audio_status */
#define AUDIO_STATUS_OFFSET         (0x430)
#define AUDIO_ADC_H0_BUSY           AUDIO_ADC_H0_BUSY
#define AUDIO_ADC_H0_BUSY_POS       (0U)
#define AUDIO_ADC_H0_BUSY_LEN       (1U)
#define AUDIO_ADC_H0_BUSY_MSK       (((1U << AUDIO_ADC_H0_BUSY_LEN) - 1) << AUDIO_ADC_H0_BUSY_POS)
#define AUDIO_ADC_H0_BUSY_UMSK      (~(((1U << AUDIO_ADC_H0_BUSY_LEN) - 1) << AUDIO_ADC_H0_BUSY_POS))
#define AUDIO_ADC_H0_MUTE_DONE      AUDIO_ADC_H0_MUTE_DONE
#define AUDIO_ADC_H0_MUTE_DONE_POS  (1U)
#define AUDIO_ADC_H0_MUTE_DONE_LEN  (1U)
#define AUDIO_ADC_H0_MUTE_DONE_MSK  (((1U << AUDIO_ADC_H0_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H0_MUTE_DONE_POS)
#define AUDIO_ADC_H0_MUTE_DONE_UMSK (~(((1U << AUDIO_ADC_H0_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H0_MUTE_DONE_POS))
#define AUDIO_ADC_H1_BUSY           AUDIO_ADC_H1_BUSY
#define AUDIO_ADC_H1_BUSY_POS       (2U)
#define AUDIO_ADC_H1_BUSY_LEN       (1U)
#define AUDIO_ADC_H1_BUSY_MSK       (((1U << AUDIO_ADC_H1_BUSY_LEN) - 1) << AUDIO_ADC_H1_BUSY_POS)
#define AUDIO_ADC_H1_BUSY_UMSK      (~(((1U << AUDIO_ADC_H1_BUSY_LEN) - 1) << AUDIO_ADC_H1_BUSY_POS))
#define AUDIO_ADC_H1_MUTE_DONE      AUDIO_ADC_H1_MUTE_DONE
#define AUDIO_ADC_H1_MUTE_DONE_POS  (3U)
#define AUDIO_ADC_H1_MUTE_DONE_LEN  (1U)
#define AUDIO_ADC_H1_MUTE_DONE_MSK  (((1U << AUDIO_ADC_H1_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H1_MUTE_DONE_POS)
#define AUDIO_ADC_H1_MUTE_DONE_UMSK (~(((1U << AUDIO_ADC_H1_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H1_MUTE_DONE_POS))
#define AUDIO_ADC_H2_BUSY           AUDIO_ADC_H2_BUSY
#define AUDIO_ADC_H2_BUSY_POS       (4U)
#define AUDIO_ADC_H2_BUSY_LEN       (1U)
#define AUDIO_ADC_H2_BUSY_MSK       (((1U << AUDIO_ADC_H2_BUSY_LEN) - 1) << AUDIO_ADC_H2_BUSY_POS)
#define AUDIO_ADC_H2_BUSY_UMSK      (~(((1U << AUDIO_ADC_H2_BUSY_LEN) - 1) << AUDIO_ADC_H2_BUSY_POS))
#define AUDIO_ADC_H2_MUTE_DONE      AUDIO_ADC_H2_MUTE_DONE
#define AUDIO_ADC_H2_MUTE_DONE_POS  (5U)
#define AUDIO_ADC_H2_MUTE_DONE_LEN  (1U)
#define AUDIO_ADC_H2_MUTE_DONE_MSK  (((1U << AUDIO_ADC_H2_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H2_MUTE_DONE_POS)
#define AUDIO_ADC_H2_MUTE_DONE_UMSK (~(((1U << AUDIO_ADC_H2_MUTE_DONE_LEN) - 1) << AUDIO_ADC_H2_MUTE_DONE_POS))
#define AUDIO_ADC_S0_INT            AUDIO_ADC_S0_INT
#define AUDIO_ADC_S0_INT_POS        (6U)
#define AUDIO_ADC_S0_INT_LEN        (1U)
#define AUDIO_ADC_S0_INT_MSK        (((1U << AUDIO_ADC_S0_INT_LEN) - 1) << AUDIO_ADC_S0_INT_POS)
#define AUDIO_ADC_S0_INT_UMSK       (~(((1U << AUDIO_ADC_S0_INT_LEN) - 1) << AUDIO_ADC_S0_INT_POS))
#define AUDIO_ADC_S0_INT_CLR        AUDIO_ADC_S0_INT_CLR
#define AUDIO_ADC_S0_INT_CLR_POS    (7U)
#define AUDIO_ADC_S0_INT_CLR_LEN    (1U)
#define AUDIO_ADC_S0_INT_CLR_MSK    (((1U << AUDIO_ADC_S0_INT_CLR_LEN) - 1) << AUDIO_ADC_S0_INT_CLR_POS)
#define AUDIO_ADC_S0_INT_CLR_UMSK   (~(((1U << AUDIO_ADC_S0_INT_CLR_LEN) - 1) << AUDIO_ADC_S0_INT_CLR_POS))
#define AUDIO_ADC_S1_INT            AUDIO_ADC_S1_INT
#define AUDIO_ADC_S1_INT_POS        (8U)
#define AUDIO_ADC_S1_INT_LEN        (1U)
#define AUDIO_ADC_S1_INT_MSK        (((1U << AUDIO_ADC_S1_INT_LEN) - 1) << AUDIO_ADC_S1_INT_POS)
#define AUDIO_ADC_S1_INT_UMSK       (~(((1U << AUDIO_ADC_S1_INT_LEN) - 1) << AUDIO_ADC_S1_INT_POS))
#define AUDIO_ADC_S1_INT_CLR        AUDIO_ADC_S1_INT_CLR
#define AUDIO_ADC_S1_INT_CLR_POS    (9U)
#define AUDIO_ADC_S1_INT_CLR_LEN    (1U)
#define AUDIO_ADC_S1_INT_CLR_MSK    (((1U << AUDIO_ADC_S1_INT_CLR_LEN) - 1) << AUDIO_ADC_S1_INT_CLR_POS)
#define AUDIO_ADC_S1_INT_CLR_UMSK   (~(((1U << AUDIO_ADC_S1_INT_CLR_LEN) - 1) << AUDIO_ADC_S1_INT_CLR_POS))
#define AUDIO_ADC_S2_INT            AUDIO_ADC_S2_INT
#define AUDIO_ADC_S2_INT_POS        (10U)
#define AUDIO_ADC_S2_INT_LEN        (1U)
#define AUDIO_ADC_S2_INT_MSK        (((1U << AUDIO_ADC_S2_INT_LEN) - 1) << AUDIO_ADC_S2_INT_POS)
#define AUDIO_ADC_S2_INT_UMSK       (~(((1U << AUDIO_ADC_S2_INT_LEN) - 1) << AUDIO_ADC_S2_INT_POS))
#define AUDIO_ADC_S2_INT_CLR        AUDIO_ADC_S2_INT_CLR
#define AUDIO_ADC_S2_INT_CLR_POS    (11U)
#define AUDIO_ADC_S2_INT_CLR_LEN    (1U)
#define AUDIO_ADC_S2_INT_CLR_MSK    (((1U << AUDIO_ADC_S2_INT_CLR_LEN) - 1) << AUDIO_ADC_S2_INT_CLR_POS)
#define AUDIO_ADC_S2_INT_CLR_UMSK   (~(((1U << AUDIO_ADC_S2_INT_CLR_LEN) - 1) << AUDIO_ADC_S2_INT_CLR_POS))
#define AUDIO_DAC_H0_BUSY           AUDIO_DAC_H0_BUSY
#define AUDIO_DAC_H0_BUSY_POS       (12U)
#define AUDIO_DAC_H0_BUSY_LEN       (1U)
#define AUDIO_DAC_H0_BUSY_MSK       (((1U << AUDIO_DAC_H0_BUSY_LEN) - 1) << AUDIO_DAC_H0_BUSY_POS)
#define AUDIO_DAC_H0_BUSY_UMSK      (~(((1U << AUDIO_DAC_H0_BUSY_LEN) - 1) << AUDIO_DAC_H0_BUSY_POS))
#define AUDIO_DAC_H0_MUTE_DONE      AUDIO_DAC_H0_MUTE_DONE
#define AUDIO_DAC_H0_MUTE_DONE_POS  (13U)
#define AUDIO_DAC_H0_MUTE_DONE_LEN  (1U)
#define AUDIO_DAC_H0_MUTE_DONE_MSK  (((1U << AUDIO_DAC_H0_MUTE_DONE_LEN) - 1) << AUDIO_DAC_H0_MUTE_DONE_POS)
#define AUDIO_DAC_H0_MUTE_DONE_UMSK (~(((1U << AUDIO_DAC_H0_MUTE_DONE_LEN) - 1) << AUDIO_DAC_H0_MUTE_DONE_POS))
#define AUDIO_DAC_H1_BUSY           AUDIO_DAC_H1_BUSY
#define AUDIO_DAC_H1_BUSY_POS       (14U)
#define AUDIO_DAC_H1_BUSY_LEN       (1U)
#define AUDIO_DAC_H1_BUSY_MSK       (((1U << AUDIO_DAC_H1_BUSY_LEN) - 1) << AUDIO_DAC_H1_BUSY_POS)
#define AUDIO_DAC_H1_BUSY_UMSK      (~(((1U << AUDIO_DAC_H1_BUSY_LEN) - 1) << AUDIO_DAC_H1_BUSY_POS))
#define AUDIO_DAC_H1_MUTE_DONE      AUDIO_DAC_H1_MUTE_DONE
#define AUDIO_DAC_H1_MUTE_DONE_POS  (15U)
#define AUDIO_DAC_H1_MUTE_DONE_LEN  (1U)
#define AUDIO_DAC_H1_MUTE_DONE_MSK  (((1U << AUDIO_DAC_H1_MUTE_DONE_LEN) - 1) << AUDIO_DAC_H1_MUTE_DONE_POS)
#define AUDIO_DAC_H1_MUTE_DONE_UMSK (~(((1U << AUDIO_DAC_H1_MUTE_DONE_LEN) - 1) << AUDIO_DAC_H1_MUTE_DONE_POS))
#define AUDIO_DAC_S0_INT            AUDIO_DAC_S0_INT
#define AUDIO_DAC_S0_INT_POS        (16U)
#define AUDIO_DAC_S0_INT_LEN        (1U)
#define AUDIO_DAC_S0_INT_MSK        (((1U << AUDIO_DAC_S0_INT_LEN) - 1) << AUDIO_DAC_S0_INT_POS)
#define AUDIO_DAC_S0_INT_UMSK       (~(((1U << AUDIO_DAC_S0_INT_LEN) - 1) << AUDIO_DAC_S0_INT_POS))
#define AUDIO_DAC_S0_INT_CLR        AUDIO_DAC_S0_INT_CLR
#define AUDIO_DAC_S0_INT_CLR_POS    (17U)
#define AUDIO_DAC_S0_INT_CLR_LEN    (1U)
#define AUDIO_DAC_S0_INT_CLR_MSK    (((1U << AUDIO_DAC_S0_INT_CLR_LEN) - 1) << AUDIO_DAC_S0_INT_CLR_POS)
#define AUDIO_DAC_S0_INT_CLR_UMSK   (~(((1U << AUDIO_DAC_S0_INT_CLR_LEN) - 1) << AUDIO_DAC_S0_INT_CLR_POS))
#define AUDIO_DAC_S1_INT            AUDIO_DAC_S1_INT
#define AUDIO_DAC_S1_INT_POS        (18U)
#define AUDIO_DAC_S1_INT_LEN        (1U)
#define AUDIO_DAC_S1_INT_MSK        (((1U << AUDIO_DAC_S1_INT_LEN) - 1) << AUDIO_DAC_S1_INT_POS)
#define AUDIO_DAC_S1_INT_UMSK       (~(((1U << AUDIO_DAC_S1_INT_LEN) - 1) << AUDIO_DAC_S1_INT_POS))
#define AUDIO_DAC_S1_INT_CLR        AUDIO_DAC_S1_INT_CLR
#define AUDIO_DAC_S1_INT_CLR_POS    (19U)
#define AUDIO_DAC_S1_INT_CLR_LEN    (1U)
#define AUDIO_DAC_S1_INT_CLR_MSK    (((1U << AUDIO_DAC_S1_INT_CLR_LEN) - 1) << AUDIO_DAC_S1_INT_CLR_POS)
#define AUDIO_DAC_S1_INT_CLR_UMSK   (~(((1U << AUDIO_DAC_S1_INT_CLR_LEN) - 1) << AUDIO_DAC_S1_INT_CLR_POS))
#define AUDIO_NGT_AMUTE             AUDIO_NGT_AMUTE
#define AUDIO_NGT_AMUTE_POS         (20U)
#define AUDIO_NGT_AMUTE_LEN         (1U)
#define AUDIO_NGT_AMUTE_MSK         (((1U << AUDIO_NGT_AMUTE_LEN) - 1) << AUDIO_NGT_AMUTE_POS)
#define AUDIO_NGT_AMUTE_UMSK        (~(((1U << AUDIO_NGT_AMUTE_LEN) - 1) << AUDIO_NGT_AMUTE_POS))
#define AUDIO_NGT_DMUTE             AUDIO_NGT_DMUTE
#define AUDIO_NGT_DMUTE_POS         (21U)
#define AUDIO_NGT_DMUTE_LEN         (1U)
#define AUDIO_NGT_DMUTE_MSK         (((1U << AUDIO_NGT_DMUTE_LEN) - 1) << AUDIO_NGT_DMUTE_POS)
#define AUDIO_NGT_DMUTE_UMSK        (~(((1U << AUDIO_NGT_DMUTE_LEN) - 1) << AUDIO_NGT_DMUTE_POS))
#define AUDIO_NGT_DMUTE_DONE        AUDIO_NGT_DMUTE_DONE
#define AUDIO_NGT_DMUTE_DONE_POS    (22U)
#define AUDIO_NGT_DMUTE_DONE_LEN    (1U)
#define AUDIO_NGT_DMUTE_DONE_MSK    (((1U << AUDIO_NGT_DMUTE_DONE_LEN) - 1) << AUDIO_NGT_DMUTE_DONE_POS)
#define AUDIO_NGT_DMUTE_DONE_UMSK   (~(((1U << AUDIO_NGT_DMUTE_DONE_LEN) - 1) << AUDIO_NGT_DMUTE_DONE_POS))
#define AUDIO_ZD_AMUTE              AUDIO_ZD_AMUTE
#define AUDIO_ZD_AMUTE_POS          (23U)
#define AUDIO_ZD_AMUTE_LEN          (1U)
#define AUDIO_ZD_AMUTE_MSK          (((1U << AUDIO_ZD_AMUTE_LEN) - 1) << AUDIO_ZD_AMUTE_POS)
#define AUDIO_ZD_AMUTE_UMSK         (~(((1U << AUDIO_ZD_AMUTE_LEN) - 1) << AUDIO_ZD_AMUTE_POS))
#define AUDIO_INT_ALL               AUDIO_INT_ALL
#define AUDIO_INT_ALL_POS           (24U)
#define AUDIO_INT_ALL_LEN           (1U)
#define AUDIO_INT_ALL_MSK           (((1U << AUDIO_INT_ALL_LEN) - 1) << AUDIO_INT_ALL_POS)
#define AUDIO_INT_ALL_UMSK          (~(((1U << AUDIO_INT_ALL_LEN) - 1) << AUDIO_INT_ALL_POS))
#define AUDIO_VAD_INT               AUDIO_VAD_INT
#define AUDIO_VAD_INT_POS           (25U)
#define AUDIO_VAD_INT_LEN           (1U)
#define AUDIO_VAD_INT_MSK           (((1U << AUDIO_VAD_INT_LEN) - 1) << AUDIO_VAD_INT_POS)
#define AUDIO_VAD_INT_UMSK          (~(((1U << AUDIO_VAD_INT_LEN) - 1) << AUDIO_VAD_INT_POS))
#define AUDIO_VAD_INT_CLR           AUDIO_VAD_INT_CLR
#define AUDIO_VAD_INT_CLR_POS       (26U)
#define AUDIO_VAD_INT_CLR_LEN       (1U)
#define AUDIO_VAD_INT_CLR_MSK       (((1U << AUDIO_VAD_INT_CLR_LEN) - 1) << AUDIO_VAD_INT_CLR_POS)
#define AUDIO_VAD_INT_CLR_UMSK      (~(((1U << AUDIO_VAD_INT_CLR_LEN) - 1) << AUDIO_VAD_INT_CLR_POS))
#define AUDIO_VAD_INT_SET           AUDIO_VAD_INT_SET
#define AUDIO_VAD_INT_SET_POS       (27U)
#define AUDIO_VAD_INT_SET_LEN       (1U)
#define AUDIO_VAD_INT_SET_MSK       (((1U << AUDIO_VAD_INT_SET_LEN) - 1) << AUDIO_VAD_INT_SET_POS)
#define AUDIO_VAD_INT_SET_UMSK      (~(((1U << AUDIO_VAD_INT_SET_LEN) - 1) << AUDIO_VAD_INT_SET_POS))

/* 0x434 : dac_s0 */
#define AUDIO_DAC_S0_OFFSET               (0x434)
#define AUDIO_DAC_S0_CTRL_RMP_RATE        AUDIO_DAC_S0_CTRL_RMP_RATE
#define AUDIO_DAC_S0_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_DAC_S0_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_DAC_S0_CTRL_RMP_RATE_MSK    (((1U << AUDIO_DAC_S0_CTRL_RMP_RATE_LEN) - 1) << AUDIO_DAC_S0_CTRL_RMP_RATE_POS)
#define AUDIO_DAC_S0_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_DAC_S0_CTRL_RMP_RATE_LEN) - 1) << AUDIO_DAC_S0_CTRL_RMP_RATE_POS))
#define AUDIO_DAC_S0_CTRL_ZCD_RATE        AUDIO_DAC_S0_CTRL_ZCD_RATE
#define AUDIO_DAC_S0_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_DAC_S0_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_DAC_S0_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_DAC_S0_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_DAC_S0_CTRL_ZCD_RATE_POS)
#define AUDIO_DAC_S0_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_DAC_S0_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_DAC_S0_CTRL_ZCD_RATE_POS))
#define AUDIO_DAC_S0_CTRL_MODE            AUDIO_DAC_S0_CTRL_MODE
#define AUDIO_DAC_S0_CTRL_MODE_POS        (10U)
#define AUDIO_DAC_S0_CTRL_MODE_LEN        (2U)
#define AUDIO_DAC_S0_CTRL_MODE_MSK        (((1U << AUDIO_DAC_S0_CTRL_MODE_LEN) - 1) << AUDIO_DAC_S0_CTRL_MODE_POS)
#define AUDIO_DAC_S0_CTRL_MODE_UMSK       (~(((1U << AUDIO_DAC_S0_CTRL_MODE_LEN) - 1) << AUDIO_DAC_S0_CTRL_MODE_POS))
#define AUDIO_DAC_S0_VOLUME_UPDATE        AUDIO_DAC_S0_VOLUME_UPDATE
#define AUDIO_DAC_S0_VOLUME_UPDATE_POS    (12U)
#define AUDIO_DAC_S0_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_DAC_S0_VOLUME_UPDATE_MSK    (((1U << AUDIO_DAC_S0_VOLUME_UPDATE_LEN) - 1) << AUDIO_DAC_S0_VOLUME_UPDATE_POS)
#define AUDIO_DAC_S0_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_DAC_S0_VOLUME_UPDATE_LEN) - 1) << AUDIO_DAC_S0_VOLUME_UPDATE_POS))
#define AUDIO_DAC_S0_VOLUME               AUDIO_DAC_S0_VOLUME
#define AUDIO_DAC_S0_VOLUME_POS           (13U)
#define AUDIO_DAC_S0_VOLUME_LEN           (9U)
#define AUDIO_DAC_S0_VOLUME_MSK           (((1U << AUDIO_DAC_S0_VOLUME_LEN) - 1) << AUDIO_DAC_S0_VOLUME_POS)
#define AUDIO_DAC_S0_VOLUME_UMSK          (~(((1U << AUDIO_DAC_S0_VOLUME_LEN) - 1) << AUDIO_DAC_S0_VOLUME_POS))
#define AUDIO_DAC_S0_MUTE_RMPUP_RATE      AUDIO_DAC_S0_MUTE_RMPUP_RATE
#define AUDIO_DAC_S0_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_DAC_S0_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_DAC_S0_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_DAC_S0_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_DAC_S0_MUTE_RMPUP_RATE_POS)
#define AUDIO_DAC_S0_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_DAC_S0_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_DAC_S0_MUTE_RMPUP_RATE_POS))
#define AUDIO_DAC_S0_MUTE_RMPDN_RATE      AUDIO_DAC_S0_MUTE_RMPDN_RATE
#define AUDIO_DAC_S0_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_DAC_S0_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_DAC_S0_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_DAC_S0_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_DAC_S0_MUTE_RMPDN_RATE_POS)
#define AUDIO_DAC_S0_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_DAC_S0_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_DAC_S0_MUTE_RMPDN_RATE_POS))
#define AUDIO_DAC_S0_MUTE_SOFTMODE        AUDIO_DAC_S0_MUTE_SOFTMODE
#define AUDIO_DAC_S0_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_DAC_S0_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_DAC_S0_MUTE_SOFTMODE_MSK    (((1U << AUDIO_DAC_S0_MUTE_SOFTMODE_LEN) - 1) << AUDIO_DAC_S0_MUTE_SOFTMODE_POS)
#define AUDIO_DAC_S0_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_DAC_S0_MUTE_SOFTMODE_LEN) - 1) << AUDIO_DAC_S0_MUTE_SOFTMODE_POS))
#define AUDIO_DAC_S0_MUTE                 AUDIO_DAC_S0_MUTE
#define AUDIO_DAC_S0_MUTE_POS             (31U)
#define AUDIO_DAC_S0_MUTE_LEN             (1U)
#define AUDIO_DAC_S0_MUTE_MSK             (((1U << AUDIO_DAC_S0_MUTE_LEN) - 1) << AUDIO_DAC_S0_MUTE_POS)
#define AUDIO_DAC_S0_MUTE_UMSK            (~(((1U << AUDIO_DAC_S0_MUTE_LEN) - 1) << AUDIO_DAC_S0_MUTE_POS))

