XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x710 : codec_adc0 */
#define AUDIO_CODEC_ADC0_OFFSET     (0x710)
#define AUDIO_ADC0_SDM_LP           AUDIO_ADC0_SDM_LP
#define AUDIO_ADC0_SDM_LP_POS       (0U)
#define AUDIO_ADC0_SDM_LP_LEN       (1U)
#define AUDIO_ADC0_SDM_LP_MSK       (((1U << AUDIO_ADC0_SDM_LP_LEN) - 1) << AUDIO_ADC0_SDM_LP_POS)
#define AUDIO_ADC0_SDM_LP_UMSK      (~(((1U << AUDIO_ADC0_SDM_LP_LEN) - 1) << AUDIO_ADC0_SDM_LP_POS))
#define AUDIO_ADC0_CKB_EN           AUDIO_ADC0_CKB_EN
#define AUDIO_ADC0_CKB_EN_POS       (1U)
#define AUDIO_ADC0_CKB_EN_LEN       (1U)
#define AUDIO_ADC0_CKB_EN_MSK       (((1U << AUDIO_ADC0_CKB_EN_LEN) - 1) << AUDIO_ADC0_CKB_EN_POS)
#define AUDIO_ADC0_CKB_EN_UMSK      (~(((1U << AUDIO_ADC0_CKB_EN_LEN) - 1) << AUDIO_ADC0_CKB_EN_POS))
#define AUDIO_ADC0_REG_RESEV        AUDIO_ADC0_REG_RESEV
#define AUDIO_ADC0_REG_RESEV_POS    (2U)
#define AUDIO_ADC0_REG_RESEV_LEN    (1U)
#define AUDIO_ADC0_REG_RESEV_MSK    (((1U << AUDIO_ADC0_REG_RESEV_LEN) - 1) << AUDIO_ADC0_REG_RESEV_POS)
#define AUDIO_ADC0_REG_RESEV_UMSK   (~(((1U << AUDIO_ADC0_REG_RESEV_LEN) - 1) << AUDIO_ADC0_REG_RESEV_POS))
#define AUDIO_ADC0_PGA_RCM_SEL      AUDIO_ADC0_PGA_RCM_SEL
#define AUDIO_ADC0_PGA_RCM_SEL_POS  (4U)
#define AUDIO_ADC0_PGA_RCM_SEL_LEN  (2U)
#define AUDIO_ADC0_PGA_RCM_SEL_MSK  (((1U << AUDIO_ADC0_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC0_PGA_RCM_SEL_POS)
#define AUDIO_ADC0_PGA_RCM_SEL_UMSK (~(((1U << AUDIO_ADC0_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC0_PGA_RCM_SEL_POS))
#define AUDIO_ADC0_PGA_GAIN         AUDIO_ADC0_PGA_GAIN
#define AUDIO_ADC0_PGA_GAIN_POS     (8U)
#define AUDIO_ADC0_PGA_GAIN_LEN     (4U)
#define AUDIO_ADC0_PGA_GAIN_MSK     (((1U << AUDIO_ADC0_PGA_GAIN_LEN) - 1) << AUDIO_ADC0_PGA_GAIN_POS)
#define AUDIO_ADC0_PGA_GAIN_UMSK    (~(((1U << AUDIO_ADC0_PGA_GAIN_LEN) - 1) << AUDIO_ADC0_PGA_GAIN_POS))
#define AUDIO_ADC0_ICTRL_MIC        AUDIO_ADC0_ICTRL_MIC
#define AUDIO_ADC0_ICTRL_MIC_POS    (12U)
#define AUDIO_ADC0_ICTRL_MIC_LEN    (2U)
#define AUDIO_ADC0_ICTRL_MIC_MSK    (((1U << AUDIO_ADC0_ICTRL_MIC_LEN) - 1) << AUDIO_ADC0_ICTRL_MIC_POS)
#define AUDIO_ADC0_ICTRL_MIC_UMSK   (~(((1U << AUDIO_ADC0_ICTRL_MIC_LEN) - 1) << AUDIO_ADC0_ICTRL_MIC_POS))
#define AUDIO_ADC0_ICTRL_ADC2       AUDIO_ADC0_ICTRL_ADC2
#define AUDIO_ADC0_ICTRL_ADC2_POS   (14U)
#define AUDIO_ADC0_ICTRL_ADC2_LEN   (2U)
#define AUDIO_ADC0_ICTRL_ADC2_MSK   (((1U << AUDIO_ADC0_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC0_ICTRL_ADC2_POS)
#define AUDIO_ADC0_ICTRL_ADC2_UMSK  (~(((1U << AUDIO_ADC0_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC0_ICTRL_ADC2_POS))
#define AUDIO_ADC0_ICTRL_ADC1       AUDIO_ADC0_ICTRL_ADC1
#define AUDIO_ADC0_ICTRL_ADC1_POS   (16U)
#define AUDIO_ADC0_ICTRL_ADC1_LEN   (2U)
#define AUDIO_ADC0_ICTRL_ADC1_MSK   (((1U << AUDIO_ADC0_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC0_ICTRL_ADC1_POS)
#define AUDIO_ADC0_ICTRL_ADC1_UMSK  (~(((1U << AUDIO_ADC0_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC0_ICTRL_ADC1_POS))
#define AUDIO_ADC0_ICTRL_AAF        AUDIO_ADC0_ICTRL_AAF
#define AUDIO_ADC0_ICTRL_AAF_POS    (18U)
#define AUDIO_ADC0_ICTRL_AAF_LEN    (2U)
#define AUDIO_ADC0_ICTRL_AAF_MSK    (((1U << AUDIO_ADC0_ICTRL_AAF_LEN) - 1) << AUDIO_ADC0_ICTRL_AAF_POS)
#define AUDIO_ADC0_ICTRL_AAF_UMSK   (~(((1U << AUDIO_ADC0_ICTRL_AAF_LEN) - 1) << AUDIO_ADC0_ICTRL_AAF_POS))
#define AUDIO_ADC0_EN_SDM           AUDIO_ADC0_EN_SDM
#define AUDIO_ADC0_EN_SDM_POS       (20U)
#define AUDIO_ADC0_EN_SDM_LEN       (1U)
#define AUDIO_ADC0_EN_SDM_MSK       (((1U << AUDIO_ADC0_EN_SDM_LEN) - 1) << AUDIO_ADC0_EN_SDM_POS)
#define AUDIO_ADC0_EN_SDM_UMSK      (~(((1U << AUDIO_ADC0_EN_SDM_LEN) - 1) << AUDIO_ADC0_EN_SDM_POS))
#define AUDIO_ADC0_EN_PGA           AUDIO_ADC0_EN_PGA
#define AUDIO_ADC0_EN_PGA_POS       (21U)
#define AUDIO_ADC0_EN_PGA_LEN       (1U)
#define AUDIO_ADC0_EN_PGA_MSK       (((1U << AUDIO_ADC0_EN_PGA_LEN) - 1) << AUDIO_ADC0_EN_PGA_POS)
#define AUDIO_ADC0_EN_PGA_UMSK      (~(((1U << AUDIO_ADC0_EN_PGA_LEN) - 1) << AUDIO_ADC0_EN_PGA_POS))
#define AUDIO_ADC_DITHER_SEL        AUDIO_ADC_DITHER_SEL
#define AUDIO_ADC_DITHER_SEL_POS    (22U)
#define AUDIO_ADC_DITHER_SEL_LEN    (2U)
#define AUDIO_ADC_DITHER_SEL_MSK    (((1U << AUDIO_ADC_DITHER_SEL_LEN) - 1) << AUDIO_ADC_DITHER_SEL_POS)
#define AUDIO_ADC_DITHER_SEL_UMSK   (~(((1U << AUDIO_ADC_DITHER_SEL_LEN) - 1) << AUDIO_ADC_DITHER_SEL_POS))

/* 0x714 : codec_adc1 */
#define AUDIO_CODEC_ADC1_OFFSET     (0x714)
#define AUDIO_ADC1_SDM_LP           AUDIO_ADC1_SDM_LP
#define AUDIO_ADC1_SDM_LP_POS       (0U)
#define AUDIO_ADC1_SDM_LP_LEN       (1U)
#define AUDIO_ADC1_SDM_LP_MSK       (((1U << AUDIO_ADC1_SDM_LP_LEN) - 1) << AUDIO_ADC1_SDM_LP_POS)
#define AUDIO_ADC1_SDM_LP_UMSK      (~(((1U << AUDIO_ADC1_SDM_LP_LEN) - 1) << AUDIO_ADC1_SDM_LP_POS))
#define AUDIO_ADC1_CKB_EN           AUDIO_ADC1_CKB_EN
#define AUDIO_ADC1_CKB_EN_POS       (1U)
#define AUDIO_ADC1_CKB_EN_LEN       (1U)
#define AUDIO_ADC1_CKB_EN_MSK       (((1U << AUDIO_ADC1_CKB_EN_LEN) - 1) << AUDIO_ADC1_CKB_EN_POS)
#define AUDIO_ADC1_CKB_EN_UMSK      (~(((1U << AUDIO_ADC1_CKB_EN_LEN) - 1) << AUDIO_ADC1_CKB_EN_POS))
#define AUDIO_ADC1_REG_RESEV        AUDIO_ADC1_REG_RESEV
#define AUDIO_ADC1_REG_RESEV_POS    (2U)
#define AUDIO_ADC1_REG_RESEV_LEN    (1U)
#define AUDIO_ADC1_REG_RESEV_MSK    (((1U << AUDIO_ADC1_REG_RESEV_LEN) - 1) << AUDIO_ADC1_REG_RESEV_POS)
#define AUDIO_ADC1_REG_RESEV_UMSK   (~(((1U << AUDIO_ADC1_REG_RESEV_LEN) - 1) << AUDIO_ADC1_REG_RESEV_POS))
#define AUDIO_ADC1_PGA_RCM_SEL      AUDIO_ADC1_PGA_RCM_SEL
#define AUDIO_ADC1_PGA_RCM_SEL_POS  (4U)
#define AUDIO_ADC1_PGA_RCM_SEL_LEN  (2U)
#define AUDIO_ADC1_PGA_RCM_SEL_MSK  (((1U << AUDIO_ADC1_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC1_PGA_RCM_SEL_POS)
#define AUDIO_ADC1_PGA_RCM_SEL_UMSK (~(((1U << AUDIO_ADC1_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC1_PGA_RCM_SEL_POS))
#define AUDIO_ADC1_PGA_GAIN         AUDIO_ADC1_PGA_GAIN
#define AUDIO_ADC1_PGA_GAIN_POS     (8U)
#define AUDIO_ADC1_PGA_GAIN_LEN     (4U)
#define AUDIO_ADC1_PGA_GAIN_MSK     (((1U << AUDIO_ADC1_PGA_GAIN_LEN) - 1) << AUDIO_ADC1_PGA_GAIN_POS)
#define AUDIO_ADC1_PGA_GAIN_UMSK    (~(((1U << AUDIO_ADC1_PGA_GAIN_LEN) - 1) << AUDIO_ADC1_PGA_GAIN_POS))
#define AUDIO_ADC1_ICTRL_MIC        AUDIO_ADC1_ICTRL_MIC
#define AUDIO_ADC1_ICTRL_MIC_POS    (12U)
#define AUDIO_ADC1_ICTRL_MIC_LEN    (2U)
#define AUDIO_ADC1_ICTRL_MIC_MSK    (((1U << AUDIO_ADC1_ICTRL_MIC_LEN) - 1) << AUDIO_ADC1_ICTRL_MIC_POS)
#define AUDIO_ADC1_ICTRL_MIC_UMSK   (~(((1U << AUDIO_ADC1_ICTRL_MIC_LEN) - 1) << AUDIO_ADC1_ICTRL_MIC_POS))
#define AUDIO_ADC1_ICTRL_ADC2       AUDIO_ADC1_ICTRL_ADC2
#define AUDIO_ADC1_ICTRL_ADC2_POS   (14U)
#define AUDIO_ADC1_ICTRL_ADC2_LEN   (2U)
#define AUDIO_ADC1_ICTRL_ADC2_MSK   (((1U << AUDIO_ADC1_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC1_ICTRL_ADC2_POS)
#define AUDIO_ADC1_ICTRL_ADC2_UMSK  (~(((1U << AUDIO_ADC1_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC1_ICTRL_ADC2_POS))
#define AUDIO_ADC1_ICTRL_ADC1       AUDIO_ADC1_ICTRL_ADC1
#define AUDIO_ADC1_ICTRL_ADC1_POS   (16U)
#define AUDIO_ADC1_ICTRL_ADC1_LEN   (2U)
#define AUDIO_ADC1_ICTRL_ADC1_MSK   (((1U << AUDIO_ADC1_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC1_ICTRL_ADC1_POS)
#define AUDIO_ADC1_ICTRL_ADC1_UMSK  (~(((1U << AUDIO_ADC1_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC1_ICTRL_ADC1_POS))
#define AUDIO_ADC1_ICTRL_AAF        AUDIO_ADC1_ICTRL_AAF
#define AUDIO_ADC1_ICTRL_AAF_POS    (18U)
#define AUDIO_ADC1_ICTRL_AAF_LEN    (2U)
#define AUDIO_ADC1_ICTRL_AAF_MSK    (((1U << AUDIO_ADC1_ICTRL_AAF_LEN) - 1) << AUDIO_ADC1_ICTRL_AAF_POS)
#define AUDIO_ADC1_ICTRL_AAF_UMSK   (~(((1U << AUDIO_ADC1_ICTRL_AAF_LEN) - 1) << AUDIO_ADC1_ICTRL_AAF_POS))
#define AUDIO_ADC1_EN_SDM           AUDIO_ADC1_EN_SDM
#define AUDIO_ADC1_EN_SDM_POS       (20U)
#define AUDIO_ADC1_EN_SDM_LEN       (1U)
#define AUDIO_ADC1_EN_SDM_MSK       (((1U << AUDIO_ADC1_EN_SDM_LEN) - 1) << AUDIO_ADC1_EN_SDM_POS)
#define AUDIO_ADC1_EN_SDM_UMSK      (~(((1U << AUDIO_ADC1_EN_SDM_LEN) - 1) << AUDIO_ADC1_EN_SDM_POS))
#define AUDIO_ADC1_EN_PGA           AUDIO_ADC1_EN_PGA
#define AUDIO_ADC1_EN_PGA_POS       (21U)
#define AUDIO_ADC1_EN_PGA_LEN       (1U)
#define AUDIO_ADC1_EN_PGA_MSK       (((1U << AUDIO_ADC1_EN_PGA_LEN) - 1) << AUDIO_ADC1_EN_PGA_POS)
#define AUDIO_ADC1_EN_PGA_UMSK      (~(((1U << AUDIO_ADC1_EN_PGA_LEN) - 1) << AUDIO_ADC1_EN_PGA_POS))

/* 0x718 : codec_adc2 */
#define AUDIO_CODEC_ADC2_OFFSET     (0x718)
#define AUDIO_ADC2_SDM_LP           AUDIO_ADC2_SDM_LP
#define AUDIO_ADC2_SDM_LP_POS       (0U)
#define AUDIO_ADC2_SDM_LP_LEN       (1U)
#define AUDIO_ADC2_SDM_LP_MSK       (((1U << AUDIO_ADC2_SDM_LP_LEN) - 1) << AUDIO_ADC2_SDM_LP_POS)
#define AUDIO_ADC2_SDM_LP_UMSK      (~(((1U << AUDIO_ADC2_SDM_LP_LEN) - 1) << AUDIO_ADC2_SDM_LP_POS))
#define AUDIO_ADC2_CKB_EN           AUDIO_ADC2_CKB_EN
#define AUDIO_ADC2_CKB_EN_POS       (1U)
#define AUDIO_ADC2_CKB_EN_LEN       (1U)
#define AUDIO_ADC2_CKB_EN_MSK       (((1U << AUDIO_ADC2_CKB_EN_LEN) - 1) << AUDIO_ADC2_CKB_EN_POS)
#define AUDIO_ADC2_CKB_EN_UMSK      (~(((1U << AUDIO_ADC2_CKB_EN_LEN) - 1) << AUDIO_ADC2_CKB_EN_POS))
#define AUDIO_ADC2_REG_RESEV        AUDIO_ADC2_REG_RESEV
#define AUDIO_ADC2_REG_RESEV_POS    (2U)
#define AUDIO_ADC2_REG_RESEV_LEN    (1U)
#define AUDIO_ADC2_REG_RESEV_MSK    (((1U << AUDIO_ADC2_REG_RESEV_LEN) - 1) << AUDIO_ADC2_REG_RESEV_POS)
#define AUDIO_ADC2_REG_RESEV_UMSK   (~(((1U << AUDIO_ADC2_REG_RESEV_LEN) - 1) << AUDIO_ADC2_REG_RESEV_POS))
#define AUDIO_ADC2_PGA_RCM_SEL      AUDIO_ADC2_PGA_RCM_SEL
#define AUDIO_ADC2_PGA_RCM_SEL_POS  (4U)
#define AUDIO_ADC2_PGA_RCM_SEL_LEN  (2U)
#define AUDIO_ADC2_PGA_RCM_SEL_MSK  (((1U << AUDIO_ADC2_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC2_PGA_RCM_SEL_POS)
#define AUDIO_ADC2_PGA_RCM_SEL_UMSK (~(((1U << AUDIO_ADC2_PGA_RCM_SEL_LEN) - 1) << AUDIO_ADC2_PGA_RCM_SEL_POS))
#define AUDIO_ADC2_PGA_GAIN         AUDIO_ADC2_PGA_GAIN
#define AUDIO_ADC2_PGA_GAIN_POS     (8U)
#define AUDIO_ADC2_PGA_GAIN_LEN     (4U)
#define AUDIO_ADC2_PGA_GAIN_MSK     (((1U << AUDIO_ADC2_PGA_GAIN_LEN) - 1) << AUDIO_ADC2_PGA_GAIN_POS)
#define AUDIO_ADC2_PGA_GAIN_UMSK    (~(((1U << AUDIO_ADC2_PGA_GAIN_LEN) - 1) << AUDIO_ADC2_PGA_GAIN_POS))
#define AUDIO_ADC2_ICTRL_MIC        AUDIO_ADC2_ICTRL_MIC
#define AUDIO_ADC2_ICTRL_MIC_POS    (12U)
#define AUDIO_ADC2_ICTRL_MIC_LEN    (2U)
#define AUDIO_ADC2_ICTRL_MIC_MSK    (((1U << AUDIO_ADC2_ICTRL_MIC_LEN) - 1) << AUDIO_ADC2_ICTRL_MIC_POS)
#define AUDIO_ADC2_ICTRL_MIC_UMSK   (~(((1U << AUDIO_ADC2_ICTRL_MIC_LEN) - 1) << AUDIO_ADC2_ICTRL_MIC_POS))
#define AUDIO_ADC2_ICTRL_ADC2       AUDIO_ADC2_ICTRL_ADC2
#define AUDIO_ADC2_ICTRL_ADC2_POS   (14U)
#define AUDIO_ADC2_ICTRL_ADC2_LEN   (2U)
#define AUDIO_ADC2_ICTRL_ADC2_MSK   (((1U << AUDIO_ADC2_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC2_ICTRL_ADC2_POS)
#define AUDIO_ADC2_ICTRL_ADC2_UMSK  (~(((1U << AUDIO_ADC2_ICTRL_ADC2_LEN) - 1) << AUDIO_ADC2_ICTRL_ADC2_POS))
#define AUDIO_ADC2_ICTRL_ADC1       AUDIO_ADC2_ICTRL_ADC1
#define AUDIO_ADC2_ICTRL_ADC1_POS   (16U)
#define AUDIO_ADC2_ICTRL_ADC1_LEN   (2U)
#define AUDIO_ADC2_ICTRL_ADC1_MSK   (((1U << AUDIO_ADC2_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC2_ICTRL_ADC1_POS)
#define AUDIO_ADC2_ICTRL_ADC1_UMSK  (~(((1U << AUDIO_ADC2_ICTRL_ADC1_LEN) - 1) << AUDIO_ADC2_ICTRL_ADC1_POS))
#define AUDIO_ADC2_ICTRL_AAF        AUDIO_ADC2_ICTRL_AAF
#define AUDIO_ADC2_ICTRL_AAF_POS    (18U)
#define AUDIO_ADC2_ICTRL_AAF_LEN    (2U)
#define AUDIO_ADC2_ICTRL_AAF_MSK    (((1U << AUDIO_ADC2_ICTRL_AAF_LEN) - 1) << AUDIO_ADC2_ICTRL_AAF_POS)
#define AUDIO_ADC2_ICTRL_AAF_UMSK   (~(((1U << AUDIO_ADC2_ICTRL_AAF_LEN) - 1) << AUDIO_ADC2_ICTRL_AAF_POS))
#define AUDIO_ADC2_EN_SDM           AUDIO_ADC2_EN_SDM
#define AUDIO_ADC2_EN_SDM_POS       (20U)
#define AUDIO_ADC2_EN_SDM_LEN       (1U)
#define AUDIO_ADC2_EN_SDM_MSK       (((1U << AUDIO_ADC2_EN_SDM_LEN) - 1) << AUDIO_ADC2_EN_SDM_POS)
#define AUDIO_ADC2_EN_SDM_UMSK      (~(((1U << AUDIO_ADC2_EN_SDM_LEN) - 1) << AUDIO_ADC2_EN_SDM_POS))
#define AUDIO_ADC2_EN_PGA           AUDIO_ADC2_EN_PGA
#define AUDIO_ADC2_EN_PGA_POS       (21U)
#define AUDIO_ADC2_EN_PGA_LEN       (1U)
#define AUDIO_ADC2_EN_PGA_MSK       (((1U << AUDIO_ADC2_EN_PGA_LEN) - 1) << AUDIO_ADC2_EN_PGA_POS)
#define AUDIO_ADC2_EN_PGA_UMSK      (~(((1U << AUDIO_ADC2_EN_PGA_LEN) - 1) << AUDIO_ADC2_EN_PGA_POS))

/* 0x800 : padc_ana_cfg1 */
#define AUDIO_PADC_ANA_CFG1_OFFSET      (0x800)
#define AUDIO_PADC_PGA_CHOP_CKSEL       AUDIO_PADC_PGA_CHOP_CKSEL
#define AUDIO_PADC_PGA_CHOP_CKSEL_POS   (0U)
#define AUDIO_PADC_PGA_CHOP_CKSEL_LEN   (1U)
#define AUDIO_PADC_PGA_CHOP_CKSEL_MSK   (((1U << AUDIO_PADC_PGA_CHOP_CKSEL_LEN) - 1) << AUDIO_PADC_PGA_CHOP_CKSEL_POS)
#define AUDIO_PADC_PGA_CHOP_CKSEL_UMSK  (~(((1U << AUDIO_PADC_PGA_CHOP_CKSEL_LEN) - 1) << AUDIO_PADC_PGA_CHOP_CKSEL_POS))
#define AUDIO_PADC_PGA_CHOP_FREQ        AUDIO_PADC_PGA_CHOP_FREQ
#define AUDIO_PADC_PGA_CHOP_FREQ_POS    (1U)
#define AUDIO_PADC_PGA_CHOP_FREQ_LEN    (3U)
#define AUDIO_PADC_PGA_CHOP_FREQ_MSK    (((1U << AUDIO_PADC_PGA_CHOP_FREQ_LEN) - 1) << AUDIO_PADC_PGA_CHOP_FREQ_POS)
#define AUDIO_PADC_PGA_CHOP_FREQ_UMSK   (~(((1U << AUDIO_PADC_PGA_CHOP_FREQ_LEN) - 1) << AUDIO_PADC_PGA_CHOP_FREQ_POS))
#define AUDIO_PADC_PGA_CHOP_EN          AUDIO_PADC_PGA_CHOP_EN
#define AUDIO_PADC_PGA_CHOP_EN_POS      (4U)
#define AUDIO_PADC_PGA_CHOP_EN_LEN      (1U)
#define AUDIO_PADC_PGA_CHOP_EN_MSK      (((1U << AUDIO_PADC_PGA_CHOP_EN_LEN) - 1) << AUDIO_PADC_PGA_CHOP_EN_POS)
#define AUDIO_PADC_PGA_CHOP_EN_UMSK     (~(((1U << AUDIO_PADC_PGA_CHOP_EN_LEN) - 1) << AUDIO_PADC_PGA_CHOP_EN_POS))
#define AUDIO_PADC_PGA_NOISCTRL         AUDIO_PADC_PGA_NOISCTRL
#define AUDIO_PADC_PGA_NOISCTRL_POS     (5U)
#define AUDIO_PADC_PGA_NOISCTRL_LEN     (2U)
#define AUDIO_PADC_PGA_NOISCTRL_MSK     (((1U << AUDIO_PADC_PGA_NOISCTRL_LEN) - 1) << AUDIO_PADC_PGA_NOISCTRL_POS)
#define AUDIO_PADC_PGA_NOISCTRL_UMSK    (~(((1U << AUDIO_PADC_PGA_NOISCTRL_LEN) - 1) << AUDIO_PADC_PGA_NOISCTRL_POS))
#define AUDIO_PADC_ICTRL_PGA_BUF        AUDIO_PADC_ICTRL_PGA_BUF
#define AUDIO_PADC_ICTRL_PGA_BUF_POS    (7U)
#define AUDIO_PADC_ICTRL_PGA_BUF_LEN    (2U)
#define AUDIO_PADC_ICTRL_PGA_BUF_MSK    (((1U << AUDIO_PADC_ICTRL_PGA_BUF_LEN) - 1) << AUDIO_PADC_ICTRL_PGA_BUF_POS)
#define AUDIO_PADC_ICTRL_PGA_BUF_UMSK   (~(((1U << AUDIO_PADC_ICTRL_PGA_BUF_LEN) - 1) << AUDIO_PADC_ICTRL_PGA_BUF_POS))
#define AUDIO_PADC_ICTRL_PGA_IA         AUDIO_PADC_ICTRL_PGA_IA
#define AUDIO_PADC_ICTRL_PGA_IA_POS     (9U)
#define AUDIO_PADC_ICTRL_PGA_IA_LEN     (2U)
#define AUDIO_PADC_ICTRL_PGA_IA_MSK     (((1U << AUDIO_PADC_ICTRL_PGA_IA_LEN) - 1) << AUDIO_PADC_ICTRL_PGA_IA_POS)
#define AUDIO_PADC_ICTRL_PGA_IA_UMSK    (~(((1U << AUDIO_PADC_ICTRL_PGA_IA_LEN) - 1) << AUDIO_PADC_ICTRL_PGA_IA_POS))
#define AUDIO_PADC_PGA_FORCE            AUDIO_PADC_PGA_FORCE
#define AUDIO_PADC_PGA_FORCE_POS        (11U)
#define AUDIO_PADC_PGA_FORCE_LEN        (1U)
#define AUDIO_PADC_PGA_FORCE_MSK        (((1U << AUDIO_PADC_PGA_FORCE_LEN) - 1) << AUDIO_PADC_PGA_FORCE_POS)
#define AUDIO_PADC_PGA_FORCE_UMSK       (~(((1U << AUDIO_PADC_PGA_FORCE_LEN) - 1) << AUDIO_PADC_PGA_FORCE_POS))
#define AUDIO_PADC_PGA_AUTOBPS_BUF      AUDIO_PADC_PGA_AUTOBPS_BUF
#define AUDIO_PADC_PGA_AUTOBPS_BUF_POS  (12U)
#define AUDIO_PADC_PGA_AUTOBPS_BUF_LEN  (1U)
#define AUDIO_PADC_PGA_AUTOBPS_BUF_MSK  (((1U << AUDIO_PADC_PGA_AUTOBPS_BUF_LEN) - 1) << AUDIO_PADC_PGA_AUTOBPS_BUF_POS)
#define AUDIO_PADC_PGA_AUTOBPS_BUF_UMSK (~(((1U << AUDIO_PADC_PGA_AUTOBPS_BUF_LEN) - 1) << AUDIO_PADC_PGA_AUTOBPS_BUF_POS))
#define AUDIO_PADC_PGA_AUTOBPS_IA       AUDIO_PADC_PGA_AUTOBPS_IA
#define AUDIO_PADC_PGA_AUTOBPS_IA_POS   (13U)
#define AUDIO_PADC_PGA_AUTOBPS_IA_LEN   (1U)
#define AUDIO_PADC_PGA_AUTOBPS_IA_MSK   (((1U << AUDIO_PADC_PGA_AUTOBPS_IA_LEN) - 1) << AUDIO_PADC_PGA_AUTOBPS_IA_POS)
#define AUDIO_PADC_PGA_AUTOBPS_IA_UMSK  (~(((1U << AUDIO_PADC_PGA_AUTOBPS_IA_LEN) - 1) << AUDIO_PADC_PGA_AUTOBPS_IA_POS))
#define AUDIO_PADC_PGA_MODE             AUDIO_PADC_PGA_MODE
#define AUDIO_PADC_PGA_MODE_POS         (14U)
#define AUDIO_PADC_PGA_MODE_LEN         (2U)
#define AUDIO_PADC_PGA_MODE_MSK         (((1U << AUDIO_PADC_PGA_MODE_LEN) - 1) << AUDIO_PADC_PGA_MODE_POS)
#define AUDIO_PADC_PGA_MODE_UMSK        (~(((1U << AUDIO_PADC_PGA_MODE_LEN) - 1) << AUDIO_PADC_PGA_MODE_POS))
#define AUDIO_PADC_AFEVCM_ROUT          AUDIO_PADC_AFEVCM_ROUT
#define AUDIO_PADC_AFEVCM_ROUT_POS      (16U)
#define AUDIO_PADC_AFEVCM_ROUT_LEN      (2U)
#define AUDIO_PADC_AFEVCM_ROUT_MSK      (((1U << AUDIO_PADC_AFEVCM_ROUT_LEN) - 1) << AUDIO_PADC_AFEVCM_ROUT_POS)
#define AUDIO_PADC_AFEVCM_ROUT_UMSK     (~(((1U << AUDIO_PADC_AFEVCM_ROUT_LEN) - 1) << AUDIO_PADC_AFEVCM_ROUT_POS))
#define AUDIO_PADC_AFEVCM_SEL           AUDIO_PADC_AFEVCM_SEL
#define AUDIO_PADC_AFEVCM_SEL_POS       (18U)
#define AUDIO_PADC_AFEVCM_SEL_LEN       (1U)
#define AUDIO_PADC_AFEVCM_SEL_MSK       (((1U << AUDIO_PADC_AFEVCM_SEL_LEN) - 1) << AUDIO_PADC_AFEVCM_SEL_POS)
#define AUDIO_PADC_AFEVCM_SEL_UMSK      (~(((1U << AUDIO_PADC_AFEVCM_SEL_LEN) - 1) << AUDIO_PADC_AFEVCM_SEL_POS))
#define AUDIO_PADC_CKB_EN               AUDIO_PADC_CKB_EN
#define AUDIO_PADC_CKB_EN_POS           (19U)
#define AUDIO_PADC_CKB_EN_LEN           (1U)
#define AUDIO_PADC_CKB_EN_MSK           (((1U << AUDIO_PADC_CKB_EN_LEN) - 1) << AUDIO_PADC_CKB_EN_POS)
#define AUDIO_PADC_CKB_EN_UMSK          (~(((1U << AUDIO_PADC_CKB_EN_LEN) - 1) << AUDIO_PADC_CKB_EN_POS))
#define AUDIO_PADC_SEL_EDGE             AUDIO_PADC_SEL_EDGE
#define AUDIO_PADC_SEL_EDGE_POS         (20U)
#define AUDIO_PADC_SEL_EDGE_LEN         (1U)
#define AUDIO_PADC_SEL_EDGE_MSK         (((1U << AUDIO_PADC_SEL_EDGE_LEN) - 1) << AUDIO_PADC_SEL_EDGE_POS)
#define AUDIO_PADC_SEL_EDGE_UMSK        (~(((1U << AUDIO_PADC_SEL_EDGE_LEN) - 1) << AUDIO_PADC_SEL_EDGE_POS))

