XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
/* 0x904 : padc_rx_fifo_status */
#define AUDIO_PADC_RX_FIFO_STATUS_OFFSET (0x904)
#define AUDIO_PADC_RXO_INT               AUDIO_PADC_RXO_INT
#define AUDIO_PADC_RXO_INT_POS           (1U)
#define AUDIO_PADC_RXO_INT_LEN           (1U)
#define AUDIO_PADC_RXO_INT_MSK           (((1U << AUDIO_PADC_RXO_INT_LEN) - 1) << AUDIO_PADC_RXO_INT_POS)
#define AUDIO_PADC_RXO_INT_UMSK          (~(((1U << AUDIO_PADC_RXO_INT_LEN) - 1) << AUDIO_PADC_RXO_INT_POS))
#define AUDIO_PADC_RXU_INT               AUDIO_PADC_RXU_INT
#define AUDIO_PADC_RXU_INT_POS           (2U)
#define AUDIO_PADC_RXU_INT_LEN           (1U)
#define AUDIO_PADC_RXU_INT_MSK           (((1U << AUDIO_PADC_RXU_INT_LEN) - 1) << AUDIO_PADC_RXU_INT_POS)
#define AUDIO_PADC_RXU_INT_UMSK          (~(((1U << AUDIO_PADC_RXU_INT_LEN) - 1) << AUDIO_PADC_RXU_INT_POS))
#define AUDIO_PADC_RXA_INT               AUDIO_PADC_RXA_INT
#define AUDIO_PADC_RXA_INT_POS           (4U)
#define AUDIO_PADC_RXA_INT_LEN           (1U)
#define AUDIO_PADC_RXA_INT_MSK           (((1U << AUDIO_PADC_RXA_INT_LEN) - 1) << AUDIO_PADC_RXA_INT_POS)
#define AUDIO_PADC_RXA_INT_UMSK          (~(((1U << AUDIO_PADC_RXA_INT_LEN) - 1) << AUDIO_PADC_RXA_INT_POS))
#define AUDIO_PADC_RXA_CNT               AUDIO_PADC_RXA_CNT
#define AUDIO_PADC_RXA_CNT_POS           (16U)
#define AUDIO_PADC_RXA_CNT_LEN           (4U)
#define AUDIO_PADC_RXA_CNT_MSK           (((1U << AUDIO_PADC_RXA_CNT_LEN) - 1) << AUDIO_PADC_RXA_CNT_POS)
#define AUDIO_PADC_RXA_CNT_UMSK          (~(((1U << AUDIO_PADC_RXA_CNT_LEN) - 1) << AUDIO_PADC_RXA_CNT_POS))
#define AUDIO_PADC_RXA                   AUDIO_PADC_RXA
#define AUDIO_PADC_RXA_POS               (24U)
#define AUDIO_PADC_RXA_LEN               (1U)
#define AUDIO_PADC_RXA_MSK               (((1U << AUDIO_PADC_RXA_LEN) - 1) << AUDIO_PADC_RXA_POS)
#define AUDIO_PADC_RXA_UMSK              (~(((1U << AUDIO_PADC_RXA_LEN) - 1) << AUDIO_PADC_RXA_POS))

/* 0x908 : padc_rx_fifo_data */
#define AUDIO_PADC_RX_FIFO_DATA_OFFSET (0x908)
#define AUDIO_PADC_RX_DATA             AUDIO_PADC_RX_DATA
#define AUDIO_PADC_RX_DATA_POS         (0U)
#define AUDIO_PADC_RX_DATA_LEN         (32U)
#define AUDIO_PADC_RX_DATA_MSK         (((1U << AUDIO_PADC_RX_DATA_LEN) - 1) << AUDIO_PADC_RX_DATA_POS)
#define AUDIO_PADC_RX_DATA_UMSK        (~(((1U << AUDIO_PADC_RX_DATA_LEN) - 1) << AUDIO_PADC_RX_DATA_POS))

struct audio_reg {
    /* 0x0 : aud_top */
    union {
        struct {
            uint32_t audio_ckg_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dac_itf_inv_sel : 1;  /* [    1],        r/w,        0x1 */
            uint32_t adc_itf_inv_sel : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pdm_itf_inv_sel : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_23   : 20; /* [23: 4],       rsvd,        0x0 */
            uint32_t dac_rate        : 3;  /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27     : 1;  /* [   27],       rsvd,        0x0 */
            uint32_t adc_rate        : 3;  /* [30:28],        r/w,        0x1 */
            uint32_t reserved_31     : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aud_top;

    /* 0x4 : aud_itf */
    union {
        struct {
            uint32_t adc_0_en      : 1; /* [    0],        r/w,        0x0 */
            uint32_t adc_1_en      : 1; /* [    1],        r/w,        0x0 */
            uint32_t adc_2_en      : 1; /* [    2],        r/w,        0x0 */
            uint32_t dac_0_en      : 1; /* [    3],        r/w,        0x0 */
            uint32_t dac_1_en      : 1; /* [    4],        r/w,        0x0 */
            uint32_t aec_0_en      : 1; /* [    5],        r/w,        0x0 */
            uint32_t aec_1_en      : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_12 : 6; /* [12: 7],       rsvd,        0x0 */
            uint32_t aud_rx0_sel   : 3; /* [15:13],        r/w,        0x0 */
            uint32_t aud_rx1_sel   : 3; /* [18:16],        r/w,        0x1 */
            uint32_t aud_rx2_sel   : 3; /* [21:19],        r/w,        0x2 */
            uint32_t aud_rx3_sel   : 3; /* [24:22],        r/w,        0x3 */
            uint32_t aud_rx4_sel   : 3; /* [27:25],        r/w,        0x4 */
            uint32_t aud_tx0_sel   : 1; /* [   28],        r/w,        0x0 */
            uint32_t aud_tx1_sel   : 1; /* [   29],        r/w,        0x1 */
            uint32_t adc_itf_en    : 1; /* [   30],        r/w,        0x0 */
            uint32_t dac_itf_en    : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } aud_itf;

    /* 0x8 : adc_0 */
    union {
        struct {
            uint32_t adc_0_fir_mode  : 1; /* [    0],        r/w,        0x0 */
            uint32_t adc_1_fir_mode  : 1; /* [    1],        r/w,        0x0 */
            uint32_t adc_2_fir_mode  : 1; /* [    2],        r/w,        0x0 */
            uint32_t adc_0_scal      : 6; /* [ 8: 3],        r/w,       0x20 */
            uint32_t adc_1_scal      : 6; /* [14: 9],        r/w,       0x20 */
            uint32_t adc_2_scal      : 6; /* [20:15],        r/w,       0x20 */
            uint32_t reserved_21_28  : 8; /* [28:21],       rsvd,        0x0 */
            uint32_t adc_dither_data : 1; /* [   29],          r,        0x1 */
            uint32_t adc_lfsr_mode   : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_0;

    /* 0xC : adc_1 */
    union {
        struct {
            uint32_t adc_0_k1       : 4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t adc_0_k1_en    : 1; /* [    4],        r/w,        0x1 */
            uint32_t adc_0_k2       : 4; /* [ 8: 5],        r/w,        0xd */
            uint32_t adc_0_k2_en    : 1; /* [    9],        r/w,        0x0 */
            uint32_t adc_1_k1       : 4; /* [13:10],        r/w,        0x8 */
            uint32_t adc_1_k1_en    : 1; /* [   14],        r/w,        0x1 */
            uint32_t adc_1_k2       : 4; /* [18:15],        r/w,        0xd */
            uint32_t adc_1_k2_en    : 1; /* [   19],        r/w,        0x0 */
            uint32_t adc_2_k1       : 4; /* [23:20],        r/w,        0x8 */
            uint32_t adc_2_k1_en    : 1; /* [   24],        r/w,        0x1 */
            uint32_t adc_2_k2       : 4; /* [28:25],        r/w,        0xd */
            uint32_t adc_2_k2_en    : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_1;

