XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
    /* 0x10 : dac_0 */
    union {
        struct {
            uint32_t adc_pdm_h           : 6; /* [ 5: 0],        r/w,        0x1 */
            uint32_t adc_pdm_l           : 6; /* [11: 6],        r/w,       0x3f */
            uint32_t adc_0_src           : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_0_pdm_lvl_swap  : 1; /* [   13],        r/w,        0x0 */
            uint32_t adc_0_mash_bit_swap : 1; /* [   14],        r/w,        0x0 */
            uint32_t adc_1_src           : 1; /* [   15],        r/w,        0x0 */
            uint32_t adc_1_pdm_lvl_swap  : 1; /* [   16],        r/w,        0x0 */
            uint32_t adc_1_mash_bit_swap : 1; /* [   17],        r/w,        0x0 */
            uint32_t adc_2_src           : 1; /* [   18],        r/w,        0x0 */
            uint32_t adc_2_pdm_lvl_swap  : 1; /* [   19],        r/w,        0x0 */
            uint32_t adc_2_mash_bit_swap : 1; /* [   20],        r/w,        0x0 */
            uint32_t mix_0_sel           : 2; /* [22:21],        r/w,        0x0 */
            uint32_t mix_0_mode          : 2; /* [24:23],        r/w,        0x0 */
            uint32_t mix_0_att_mode1     : 3; /* [27:25],        r/w,        0x0 */
            uint32_t mix_0_att_mode2     : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_0;

    /* 0x14 : dac_1 */
    union {
        struct {
            uint32_t dac_dem_bypass           : 1; /* [    0],        r/w,        0x0 */
            uint32_t dac_dem_out_swap         : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_4             : 3; /* [ 4: 2],       rsvd,        0x0 */
            uint32_t dac_dsm_order            : 1; /* [    5],        r/w,        0x0 */
            uint32_t dac_dsm_scaling_factor   : 4; /* [ 9: 6],        r/w,        0xf */
            uint32_t dac_dsm_scaling_en       : 1; /* [   10],        r/w,        0x1 */
            uint32_t dac_dsm_dither_amp       : 3; /* [13:11],        r/w,        0x0 */
            uint32_t dac_dsm_dither_en        : 1; /* [   14],        r/w,        0x1 */
            uint32_t dac_dsm_dither_prbs_mode : 2; /* [16:15],        r/w,        0x0 */
            uint32_t reserved_17_20           : 4; /* [20:17],       rsvd,        0x0 */
            uint32_t mix_1_sel                : 2; /* [22:21],        r/w,        0x0 */
            uint32_t mix_1_mode               : 2; /* [24:23],        r/w,        0x0 */
            uint32_t mix_1_att_mode1          : 3; /* [27:25],        r/w,        0x0 */
            uint32_t mix_1_att_mode2          : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31              : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_1;

    /* 0x18 : aec_0 */
    union {
        struct {
            uint32_t reserved_0_4          : 5;  /* [ 4: 0],       rsvd,        0x0 */
            uint32_t aec_0_atten_mode      : 3;  /* [ 7: 5],        r/w,        0x0 */
            uint32_t aec_1_atten_mode      : 3;  /* [10: 8],        r/w,        0x0 */
            uint32_t aec_record_vld_4s_div : 2;  /* [12:11],        r/w,        0x0 */
            uint32_t aec_record_vld_4s_en  : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_31        : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aec_0;

    /* 0x1C : pdm_0 */
    union {
        struct {
            uint32_t pdm_0_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t pdm_1_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t pdm_2_en       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t adc_0_pdm_sel  : 3;  /* [ 5: 3],        r/w,        0x0 */
            uint32_t adc_1_pdm_sel  : 3;  /* [ 8: 6],        r/w,        0x1 */
            uint32_t adc_2_pdm_sel  : 3;  /* [11: 9],        r/w,        0x2 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_0;

    /* 0x20 : rsvd0 */
    union {
        struct {
            uint32_t rsvd0 : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } rsvd0;

    /* 0x24 : dbg_0 */
    union {
        struct {
            uint32_t aud_sin_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t aud_sin_step       : 3;  /* [ 3: 1],        r/w,        0x2 */
            uint32_t reserved_4_17      : 14; /* [17: 4],       rsvd,        0x0 */
            uint32_t audio_test_out_sel : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t dac_test_clkin_en  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t adc_test_clkin_en  : 1;  /* [   21],        r/w,        0x0 */
            uint32_t dac_test_din_en    : 1;  /* [   22],        r/w,        0x0 */
            uint32_t adc_test_din_en    : 1;  /* [   23],        r/w,        0x0 */
            uint32_t aud_test_read_sel  : 6;  /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31     : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_0;

    /* 0x28 : dbg_1 */
    union {
        struct {
            uint32_t aud_test_read : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_1;

    /* 0x2C : dbg_2 */
    union {
        struct {
            uint32_t adc_fir_4s_val    : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t adc_0_fir_4s_en   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t adc_1_fir_4s_en   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t adc_2_fir_4s_en   : 1;  /* [   22],        r/w,        0x0 */
            uint32_t adc_in_0_test_sel : 1;  /* [   23],        r/w,        0x0 */
            uint32_t adc_in_1_test_sel : 1;  /* [   24],        r/w,        0x0 */
            uint32_t adc_in_2_test_sel : 1;  /* [   25],        r/w,        0x0 */
            uint32_t reserved_26_31    : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_2;

    /* 0x30 : dbg_3 */
    union {
        struct {
            uint32_t dac_4s_val        : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t dac_dwa_0_4s_en   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t dac_dwa_1_4s_en   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t dac_in_0_test_sel : 1;  /* [   22],        r/w,        0x0 */
            uint32_t dac_in_1_test_sel : 1;  /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31    : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_3;

