XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
    /* 0x3E4 : peq_24_b1 */
    union {
        struct {
            uint32_t peq_24_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_24_b1;

    /* 0x3E8 : peq_24_b2 */
    union {
        struct {
            uint32_t peq_24_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_24_b2;

    /* 0x3EC : peq_24_a1 */
    union {
        struct {
            uint32_t peq_24_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_24_a1;

    /* 0x3F0 : peq_24_a2 */
    union {
        struct {
            uint32_t peq_24_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_24_a2;

    /* 0x3f4  reserved */
    uint8_t RESERVED0x3f4[12];

    /* 0x400 : adc_h */
    union {
        struct {
            uint32_t reserved_0_1          : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t adc_h_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x1 */
            uint32_t adc_h_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t adc_h_ctrl_mode       : 2; /* [11:10],        r/w,        0x0 */
            uint32_t adc_h_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_h_volume          : 9; /* [21:13],          r,        0x0 */
            uint32_t adc_h_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x1 */
            uint32_t adc_h_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x1 */
            uint32_t adc_h_mute_softmode   : 1; /* [   30],        r/w,        0x0 */
            uint32_t adc_h_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_h;

    /* 0x404 : adc_h_misc */
    union {
        struct {
            uint32_t reserved_0_27          : 28; /* [27: 0],       rsvd,        0x0 */
            uint32_t adc_h_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } adc_h_misc;

    /* 0x408 : adc_s0 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t adc_s0_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x1 */
            uint32_t adc_s0_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t adc_s0_ctrl_mode       : 2; /* [11:10],        r/w,        0x2 */
            uint32_t adc_s0_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_s0_volume          : 9; /* [21:13],        r/w,        0x0 */
            uint32_t adc_s0_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x1 */
            uint32_t adc_s0_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x1 */
            uint32_t adc_s0_mute_softmode   : 1; /* [   30],        r/w,        0x0 */
            uint32_t adc_s0_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_s0;

    /* 0x40C : adc_s0_misc */
    union {
        struct {
            uint32_t adc_s012_volume_update  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t adc_s012_mute           : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_27           : 26; /* [27: 2],       rsvd,        0x0 */
            uint32_t adc_s0_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } adc_s0_misc;

    /* 0x410 : adc_s1 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t adc_s1_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x1 */
            uint32_t adc_s1_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t adc_s1_ctrl_mode       : 2; /* [11:10],        r/w,        0x2 */
            uint32_t adc_s1_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_s1_volume          : 9; /* [21:13],        r/w,        0x0 */
            uint32_t adc_s1_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x1 */
            uint32_t adc_s1_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x1 */
            uint32_t adc_s1_mute_softmode   : 1; /* [   30],        r/w,        0x0 */
            uint32_t adc_s1_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_s1;

    /* 0x414 : adc_s1_misc */
    union {
        struct {
            uint32_t reserved_0_27           : 28; /* [27: 0],       rsvd,        0x0 */
            uint32_t adc_s1_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } adc_s1_misc;

    /* 0x418 : adc_s2 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t adc_s2_ctrl_rmp_rate   : 4; /* [ 5: 2],        r/w,        0x1 */
            uint32_t adc_s2_ctrl_zcd_rate   : 4; /* [ 9: 6],        r/w,        0x2 */
            uint32_t adc_s2_ctrl_mode       : 2; /* [11:10],        r/w,        0x2 */
            uint32_t adc_s2_volume_update   : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_s2_volume          : 9; /* [21:13],        r/w,        0x0 */
            uint32_t adc_s2_mute_rmpup_rate : 4; /* [25:22],        r/w,        0x1 */
            uint32_t adc_s2_mute_rmpdn_rate : 4; /* [29:26],        r/w,        0x1 */
            uint32_t adc_s2_mute_softmode   : 1; /* [   30],        r/w,        0x0 */
            uint32_t adc_s2_mute            : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_s2;

    /* 0x41C : adc_s2_misc */
    union {
        struct {
            uint32_t reserved_0_27           : 28; /* [27: 0],       rsvd,        0x0 */
            uint32_t adc_s2_ctrl_zcd_timeout : 4;  /* [31:28],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } adc_s2_misc;

    /* 0x420 : adc_agc_0 */
    union {
        struct {
            uint32_t adc_agc_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_2       : 2;  /* [ 2: 1],       rsvd,        0x0 */
            uint32_t agc_min_gain_qdb   : 9;  /* [11: 3],        r/w,      0x1a0 */
            uint32_t agc_max_gain_qdb   : 9;  /* [20:12],        r/w,       0x18 */
            uint32_t agc_force_gain_ind : 10; /* [30:21],        r/w,        0x0 */
            uint32_t agc_force_gain_en  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } adc_agc_0;

