XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/audio_reg.h
    /* 0x710 : codec_adc0 */
    union {
        struct {
            uint32_t adc0_sdm_lp      : 1; /* [    0],        r/w,        0x0 */
            uint32_t adc0_ckb_en      : 1; /* [    1],        r/w,        0x0 */
            uint32_t adc0_reg_resev   : 1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3       : 1; /* [    3],       rsvd,        0x0 */
            uint32_t adc0_pga_rcm_sel : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t adc0_pga_gain    : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t adc0_ictrl_mic   : 2; /* [13:12],        r/w,        0x2 */
            uint32_t adc0_ictrl_adc2  : 2; /* [15:14],        r/w,        0x2 */
            uint32_t adc0_ictrl_adc1  : 2; /* [17:16],        r/w,        0x2 */
            uint32_t adc0_ictrl_aaf   : 2; /* [19:18],        r/w,        0x2 */
            uint32_t adc0_en_sdm      : 1; /* [   20],        r/w,        0x0 */
            uint32_t adc0_en_pga      : 1; /* [   21],        r/w,        0x0 */
            uint32_t adc_dither_sel   : 2; /* [23:22],        r/w,        0x2 */
            uint32_t reserved_24_31   : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_adc0;

    /* 0x714 : codec_adc1 */
    union {
        struct {
            uint32_t adc1_sdm_lp      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc1_ckb_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc1_reg_resev   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t adc1_pga_rcm_sel : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t adc1_pga_gain    : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t adc1_ictrl_mic   : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t adc1_ictrl_adc2  : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t adc1_ictrl_adc1  : 2;  /* [17:16],        r/w,        0x2 */
            uint32_t adc1_ictrl_aaf   : 2;  /* [19:18],        r/w,        0x2 */
            uint32_t adc1_en_sdm      : 1;  /* [   20],        r/w,        0x0 */
            uint32_t adc1_en_pga      : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31   : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_adc1;

    /* 0x718 : codec_adc2 */
    union {
        struct {
            uint32_t adc2_sdm_lp      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc2_ckb_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc2_reg_resev   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t adc2_pga_rcm_sel : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t adc2_pga_gain    : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t adc2_ictrl_mic   : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t adc2_ictrl_adc2  : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t adc2_ictrl_adc1  : 2;  /* [17:16],        r/w,        0x2 */
            uint32_t adc2_ictrl_aaf   : 2;  /* [19:18],        r/w,        0x2 */
            uint32_t adc2_en_sdm      : 1;  /* [   20],        r/w,        0x0 */
            uint32_t adc2_en_pga      : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31   : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_adc2;

    /* 0x71c  reserved */
    uint8_t RESERVED0x71c[228];

    /* 0x800 : padc_ana_cfg1 */
    union {
        struct {
            uint32_t padc_pga_chop_cksel  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t padc_pga_chop_freq   : 3;  /* [ 3: 1],        r/w,        0x4 */
            uint32_t padc_pga_chop_en     : 1;  /* [    4],        r/w,        0x1 */
            uint32_t padc_pga_noisctrl    : 2;  /* [ 6: 5],        r/w,        0x3 */
            uint32_t padc_ictrl_pga_buf   : 2;  /* [ 8: 7],        r/w,        0x1 */
            uint32_t padc_ictrl_pga_ia    : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t padc_pga_force       : 1;  /* [   11],        r/w,        0x0 */
            uint32_t padc_pga_autobps_buf : 1;  /* [   12],        r/w,        0x0 */
            uint32_t padc_pga_autobps_ia  : 1;  /* [   13],        r/w,        0x0 */
            uint32_t padc_pga_mode        : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t padc_afevcm_rout     : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t padc_afevcm_sel      : 1;  /* [   18],        r/w,        0x0 */
            uint32_t padc_ckb_en          : 1;  /* [   19],        r/w,        0x0 */
            uint32_t padc_sel_edge        : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31       : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_ana_cfg1;

    /* 0x804 : padc_ana_cfg2 */
    union {
        struct {
            uint32_t padc_sdm_chop_phas : 1;  /* [    0],        r/w,        0x1 */
            uint32_t padc_sdm_chop_freq : 3;  /* [ 3: 1],        r/w,        0x4 */
            uint32_t padc_sdm_chop_en   : 1;  /* [    4],        r/w,        0x1 */
            uint32_t padc_dither_order  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t padc_dither_sel    : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t padc_quan_gain     : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t padc_dem_en        : 1;  /* [   10],        r/w,        0x1 */
            uint32_t padc_nctrl_adc2    : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12        : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t padc_nctrl_adc1    : 2;  /* [14:13],        r/w,        0x0 */
            uint32_t padc_ictrl_adc     : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t padc_reserved      : 4;  /* [20:17],        r/w,        0x0 */
            uint32_t reserved_21_31     : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_ana_cfg2;

    /* 0x808 : padc_ana_cmd */
    union {
        struct {
            uint32_t reserved_0_1      : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t padc_self_test_en : 1; /* [    2],        r/w,        0x0 */
            uint32_t padc_sdm_lp_en    : 1; /* [    3],        r/w,        0x0 */
            uint32_t padc_pga_lp_en    : 1; /* [    4],        r/w,        0x0 */
            uint32_t padc_diag_gsw     : 2; /* [ 6: 5],        r/w,        0x0 */
            uint32_t padc_diag_psw     : 2; /* [ 8: 7],        r/w,        0x0 */
            uint32_t padc_ictrl_diag   : 2; /* [10: 9],        r/w,        0x0 */
            uint32_t padc_pga_gain     : 3; /* [13:11],        r/w,        0x0 */
            uint32_t padc_inv_sig      : 1; /* [   14],        r/w,        0x0 */
            uint32_t padc_single_mode  : 2; /* [16:15],        r/w,        0x0 */
            uint32_t padc_single_cfg   : 4; /* [20:17],        r/w,        0x0 */
            uint32_t padc_channel_sel  : 2; /* [22:21],        r/w,        0x0 */
            uint32_t padc_channel_en   : 1; /* [   23],        r/w,        0x0 */
            uint32_t padc_conv_delay   : 4; /* [27:24],        r/w,        0x3 */
            uint32_t padc_conv         : 1; /* [   28],        r/w,        0x0 */
            uint32_t padc_en_caldac    : 1; /* [   29],        r/w,        0x0 */
            uint32_t padc_sdm_pu       : 1; /* [   30],        r/w,        0x0 */
            uint32_t padc_pga_pu       : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_ana_cmd;

    /* 0x80C : padc_out_cfg */
    union {
        struct {
            uint32_t reserved_0_20       : 21; /* [20: 0],       rsvd,        0x0 */
            uint32_t padc_valid_4s_val   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t padc_valid_4s_en    : 1;  /* [   22],        r/w,        0x0 */
            uint32_t padc_global_chop_en : 1;  /* [   23],        r/w,        0x0 */
            uint32_t padc_filter_type    : 1;  /* [   24],        r/w,        0x0 */
            uint32_t padc_odr            : 4;  /* [28:25],        r/w,        0x3 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_out_cfg;

    /* 0x810 : padc_calib_cmd */
    union {
        struct {
            uint32_t reserved_0_15      : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t padc_calib_average : 3;  /* [18:16],        r/w,        0x4 */
            uint32_t padc_calib_discard : 3;  /* [21:19],        r/w,        0x4 */
            uint32_t padc_calib_run     : 1;  /* [   22],        r/w,        0x0 */
            uint32_t padc_calib_lvl     : 2;  /* [24:23],        r/w,        0x2 */
            uint32_t padc_calib_gain    : 3;  /* [27:25],        r/w,        0x0 */
            uint32_t padc_calib_mode    : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t padc_calib_start   : 1;  /* [   30],        w1p,        0x0 */
            uint32_t padc_calib_method  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } padc_calib_cmd;

